{
  "id": 34,
  "apiname": "Anivia",
  "title": "the Cryophoenix",
  "attack": 1,
  "defense": 4,
  "magic": 10,
  "difficulty": 3,
  "herotype": "Mage",
  "alttype": "Support",
  "resource": "Mana",
  "stats": {
    "hp_base": 480,
    "hp_lvl": 82,
    "mp_base": 495,
    "mp_lvl": 25,
    "arm_base": 21.22,
    "arm_lvl": 4,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 5.5,
    "hp5_lvl": 0.55,
    "mp5_base": 8,
    "mp5_lvl": 0.8,
    "dam_base": 51.376,
    "dam_lvl": 3.2,
    "as_base": 0.625,
    "as_lvl": 1.68,
    "range": 600,
    "ms": 325,
    "acquisition_radius": 600,
    "selection_radius": 140,
    "pathing_radius": 35,
    "as_ratio": 0.625,
    "attack_delay_offset": -0.00833333283662796,
    "urf_dmg_dealt": 1.15,
    "urf_dmg_taken": 0.9
  },
  "rangetype": "Ranged",
  "date": "2009-07-10",
  "patch": "July 10, 2009 Patch",
  "changes": "V9.6",
  "role": [
    "Battlemage"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 3,
  "mobility": 1,
  "utility": 2,
  "style": 100,
  "adaptivetype": "magic",
  "be": 3150,
  "rp": 790,
  "skill_i": {
    "Rebirth": {
      "name": "Rebirth",
      "champion": "Anivia",
      "skill": "I",
      "static": "240",
      "icon": "Rebirth.png",
      "blurb": "Upon dying, Anivia will revert into an egg. If the egg can survive for six seconds, she is gloriously reborn.",
      "description": "Innate: Periodically, upon taking fatal damage, Anivia  dispels all debuffs and transforms into Eggnivia, while also recovering all of her  health.",
      "description2": "Eggnivia cannot act but gains -40 − 20 (based on level)  bonus armor and  bonus magic resistance. After 6 seconds, if Eggnivia is still alive, Anivia is  reborn with  Eggnivia's current health.",
      "targeting": "Passive",
      "affects": "Self",
      "spelleffects": "Heal",
      "notes": "* Triggering Rebirth while affected by a channeled ability like  Drain or  Nether Grasp will not end the channel early and the egg will still take damage.\n Triggering Rebirth while being pulled by  Urgot's  Fear Beyond Death will not execute Anivia.\n Triggering Rebirth while leashed by an ability like  Ethereal Chains will make the secondary effect trigger at the moment of Anivia's \"death\" and the egg will not take the damage.\n  Guardian Angel and  Chronoshift will take precedence over Rebirth.\n While in egg form, Anivia is still classified as a champion (unlike  Cell Division).\n If Anivia uses  Teleport before she takes fatal damage, she can still teleport when she transforms into the egg."
    }
  },
  "skill_q": {
    "Flash Frost": {
      "name": "Flash Frost",
      "champion": "Anivia",
      "skill": "Q",
      "target range": "1075",
      "collision radius": "125",
      "effect radius": "225",
      "speed": "850",
      "cost": "80 / 90 / 100 / 110 / 120",
      "costtype": "mana",
      "cooldown": "10 / 9.5 / 9 / 8.5 / 8",
      "icon": "Flash Frost.png",
      "blurb": "Anivia brings her wings together and summons a sphere of ice that flies towards her opponents, chilling and damaging anyone in its path. When the sphere explodes it does moderate damage in a radius, stunning anyone in the area.",
      "description": "Active: Anivia launches a massive chunk of ice which flies toward the target location, dealing  magic damage and  slowing all enemies it passes through by 20% − 40% (based on  Glacial Storm's Rank) for 3 seconds.",
      "leveling": "Magic damage:\n60 / 85 / 110 / 135 / 160 (+ 45% AP)\nTotal Damage:\n120 / 170 / 220 / 270 / 320 (+ 90% AP)",
      "description2": "Recast: Anivia shatters the orb, dealing the same magic damage to enemies within the detonation and  stunning them.",
      "leveling2": "Stun Duration:\n1.1 / 1.2 / 1.3 / 1.4 / 1.5",
      "description3": "At maximum range Flash Frost detonates automatically.",
      "targeting": "Direction-targeted / Ground-targeted",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Both instances of damage will apply spell effects.\n Anivia cannot detonate Flash Frost while disabled.\n Both instances count as ability activations for the purposes of effects such as Spellblade and  Force Pulse."
    }
  },
  "skill_w": {
    "Crystallize": {
      "name": "Crystallize",
      "champion": "Anivia",
      "skill": "W",
      "target range": "1000",
      "cost": "70",
      "costtype": "mana",
      "cooldown": "17",
      "icon": "Crystallize.png",
      "blurb": "Anivia condenses the moisture in the air into an impassable wall of ice to block all movement. The wall only lasts a short duration before it melts.",
      "description": "Active: Anivia summons an impassable wall of ice at the target location perpendicular to which way she is facing,  knocking units away from it. The wall lasts 5 seconds.",
      "leveling": "Wall length:\n400 / 500 / 600 / 700 / 800",
      "targeting": "Ground",
      "affects": "Enemies",
      "notes": "* Crystallize's displacement triggers in-combat effects such as drawing turret aggro, applying  Elixir of Sorcery and  Sudden Impact. It will also trigger  Malzahar's  Void Shift.\n Anivia is granted an assist if the wall touches an enemy champion."
    }
  },
  "skill_e": {
    "Frostbite": {
      "name": "Frostbite",
      "champion": "Anivia",
      "skill": "E",
      "target range": "650",
      "speed": "1600",
      "cost": "50 / 60 / 70 / 80 / 90",
      "costtype": "mana",
      "cooldown": "4",
      "icon": "Frostbite.png",
      "blurb": "With a flap of her wings, Anivia blasts a freezing gust of wind at her target, dealing a low amount of damage. If the target was recently stunned by Flash Frost or damaged by a fully formed Glacial Storm, the damage they take is doubled.",
      "description": "Active: Anivia blasts the target with a freezing wind, dealing magic damage that is doubled against targets stunned by  Flash Frost within the last 3 seconds or damaged by a fully formed  Glacial Storm within the last 2 seconds.",
      "leveling": "Magic damage:\n50 / 75 / 100 / 125 / 150 (+ 50% AP)\nEnhanced Damage:\n100 / 150 / 200 / 250 / 300 (+ 100% AP)",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spell",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* The damage of Frostbite is calculated on-hit. If the target is no longer marked as recently stunned by  Flash Frost or damaged by a fully formed  Glacial Storm while Frostbite is in the air, it will deal standard damage.\n Frostbite can deal double damage to  Dragon and  Baron Nashor if they were damaged by the second damage of  Flash Frost or by a fully formed  Glacial Storm a few seconds ago.\n Frostbite has a different sound effect when it hits a target for double damage."
    }
  },
  "skill_r": {
    "Glacial Storm": {
      "name": "Glacial Storm",
      "champion": "Anivia",
      "skill": "R",
      "target range": "750",
      "effect radius": "200 −  400 (based on time active)",
      "tether radius": "1000",
      "cost": "75",
      "costtype": "mana + 40 / 45 / 50 / 55 / 60 per second",
      "cooldown": "6",
      "icon": "Glacial Storm.png",
      "blurb": "Anivia summons a driving rain of ice and hail to damage her enemies and slow their advance.",
      "description": "Active: Anivia calls forth a driving rain of ice and hail at the target location, dealing magic damage each second to enemies within,  slowing them for 1 second.",
      "leveling": "Magic damage per second:\n40 / 50 / 60 / 70 / 80 (+ 12.5% AP)\nEmpowered damage per second:\n120 / 150 / 180 / 210 / 240 (+ 37.5% AP)\nSlow:\n20 / 25 / 30 / 35 / 40%\nEmpowered Slow:\n30 / 37.5 / 45 / 52.5 / 60%",
      "description2": "The blizzard increases in size over 1.5 seconds. At maximum size, enemies within the area take 300% damage and suffer a 50% stronger slow which lasts 1.5 seconds.",
      "description3": "After Glacial Storm has been active for at least 1 second, Anivia can cast the ability again to deactivate it, dealing one last tick of damage. The ability will deactivate automatically if she gets too far away or runs out of  mana. Additionally, Glacial Storm is deactivated by all forms of  interrupting crowd control.",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "aoedot",
      "spellshield": "False",
      "notes": "* Glacial Storm's slow leaves a trail that is visible even if the target is stealthed.\n Only activating Glacial Storm counts as an ability activation for effects such as Spellblade and  Force Pulse. Deactivating it does not.\n Glacial Storm deals 3 half ticks at 200 / 267 / 333 radius for a total of 1.5 normal damage ticks before starts dealing empowered damage at 400 radius.\n Glacial Storm heals Anivia 15 health upon cast and heals for up to 12 health per second when interacting with  Rod of Ages' Eternity.\n  Stasis doesn't interrupt Glacial Storm.\n  Tahm Kench's  Devour does interrupt (allied and enemy) Glacial Storm."
    }
  }
}