{
  "id": 523,
  "apiname": "Aphelios",
  "title": "the Weapon of the Faithful",
  "attack": 6,
  "defense": 2,
  "magic": 1,
  "difficulty": 3,
  "herotype": "Marksman",
  "resource": "Mana",
  "stats": {
    "hp_base": 500,
    "hp_lvl": 86,
    "mp_base": 348,
    "mp_lvl": 42,
    "arm_base": 28,
    "arm_lvl": 3,
    "mr_base": 26,
    "mr_lvl": 0.5,
    "hp5_base": 3.25,
    "hp5_lvl": 0.55,
    "mp5_base": 6.5,
    "mp5_lvl": 0.4,
    "dam_base": 57,
    "dam_lvl": 2.2,
    "as_base": 0.64,
    "as_lvl": 2.1,
    "range": 550,
    "ms": 325,
    "selection_radius": 110,
    "pathing_radius": 35,
    "as_ratio": 0.6399999856948853,
    "attack_total_time": 1.5,
    "attack_cast_time": 0.23000000417232513,
    "urf_dmg_taken": 0.95
  },
  "rangetype": "Ranged",
  "date": "2019-12-11",
  "patch": "V9.24",
  "changes": "V10.2",
  "role": [
    "Marksman"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 1,
  "utility": 1,
  "style": 20,
  "adaptivetype": "physical",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "The Hitman and the Seer": {
      "name": "The Hitman and the Seer",
      "champion": "Aphelios",
      "skill": "I",
      "icon": "The Hitman and the Seer.png",
      "description": "Innate: Aphelios has access to an arsenal of 5 Moonstone Weapons, created by his sister Alune. He equips two weapons at any one time, one as his main weapon and one as his off-hand. Each weapon has a unique basic attack and passive effect.",
      "description2": "Aphelios begins the game with  Calibrum as his main weapon and  Severum in his off-hand, with  Gravitum,  Infernum, and  Crescendum queued in reserve. The queue order can be rearranged based on weapon usage.",
      "icon3": "The Hitman and the Seer 2.png",
      "description3": "Innate - Moonlight: Weapons spawn with 50 Moonlight for ammunition, which is consumed on basic attacks or to cast his  abilities. Abilities that cause Aphelios to attack do not cost additional Moonlight on top of their ability cost. Once his main weapon is exhausted of Moonlight, it is moved to the end of the queue and Aphelios equips the next available weapon from his reserve.",
      "description4": "Innate - Weapon Master: Aphelios cannot improve his abilities with skill points. He starts the game with  Phase and gains access to  abilities at level 2. He gains access to  Moonlight Vigil at level 6, which improves automatically at levels 11 and 16. Instead, Aphelios may spend his skill points to gain  bonus attack damage,  bonus attack speed or  penetration versus  bonus armor.",
      "leveling4": "Bonus Attack Damage:4 / 8 / 12 / 16 / 20 / 24\nBonus Attack Speed:6 / 12 / 18 / 24 / 30 / 36%\nBonus-Armor Penetration:3 / 6 / 9 / 12 / 15 / 18%",
      "targeting": "Passive",
      "affects": "Self",
      "notes": "* The level up for the bonus attack damage, attack speed, and armor penetration have hotkeys Q, W, E, respectively.\n Assigning points does not follow the same rules as conventional point expenditure. The quickest you can get an individual statistic to rank-6 is by assigning points at 1 / 2 / 3 / 5 / 7 / 9.\n\n An ammunition counter will appear to the right side of the screen at 10 or less Moonlight.\n Abilities can still be used with less than the required amount of Moonlight, consuming all remaining Moonlight in the process.\n Runaan's Hurricane does not consume additional Moonlight for his basic attacks.\n The icon for this ability changes based on the active skin and functions as Alune's portrait, similarly to Aphelios' portrait."
    },
    "Calibrum": {
      "name": "Calibrum",
      "disp_name": "Calibrum, the Sniper Rifle",
      "champion": "Aphelios",
      "skill": "A",
      "cost": "1",
      "costtype": "Moonlight per attack",
      "icon": "Calibrum.png",
      "description": "Innate - Precision: Aphelios gains  100 bonus range while Calibrum is his main weapon. Enemies damaged by Calibrum via an ability are marked for 4.5 seconds,  revealing them for the duration. Aphelios's next basic attack against a marked target uses the current off-hand weapon and gains  global range and bonus missile speed.",
      "description2": "This attack will consume the marks from all targets, dealing 15 (+ 20% bonus AD)  bonus physical damage to the main target for each mark consumed. If Calibrum is the current off-hand weapon, the empowered attack uses the main weapon instead.",
      "targeting": "Unit",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "attack",
      "projectile": "Special",
      "notes": "*  Crescendum's outgoing basic attack can bypass  Yasuo's  Wind Wall and  Braum's  Unbreakable but cannot while returning.\n Triggered Marks apply on-hit effects and are considered a basic attack for  Runaan's Hurricane, but are not considered one for  Guinsoo's Rageblade.\n The mark will not be triggered by  Onslaught attacks.\n The empowered range will be drawn for Aphelios."
    },
    "Severum": {
      "name": "Severum",
      "disp_name": "Severum, the Scythe Pistol",
      "champion": "Aphelios",
      "skill": "A",
      "cost": "1",
      "costtype": "Moonlight per attack",
      "icon": "Severum.png",
      "description": "Innate - Resurgent: Basic attacks with Severum don't use  projectiles.  Severum's attacks  heal him for 8% − 25% (based on level) of damage dealt.",
      "description2": "Healing from Severum in excess of Aphelios  maximum health is converted into a  shield for an amount of up to 10 − 140 (based on level) (+ 6% maximum health), lasting for up to 30 seconds.",
      "targeting": "Unit",
      "affects": "Self",
      "damagetype": "Physical",
      "spelleffects": "attack",
      "projectile": "False"
    },
    "Gravitum": {
      "name": "Gravitum",
      "disp_name": "Gravitum, the Gravity Cannon",
      "champion": "Aphelios",
      "skill": "A",
      "cost": "1",
      "costtype": "Moonlight per attack",
      "icon": "Gravitum.png",
      "description": "Innate - Binding: Gravitum applies a 30%  slow for 3.5 seconds, decaying to 10% after 0.7 seconds.",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "attack",
      "spellshield": "False",
      "projectile": "True"
    },
    "Infernum": {
      "name": "Infernum",
      "disp_name": "Infernum, the Flamethrower",
      "champion": "Aphelios",
      "skill": "A",
      "cost": "1",
      "costtype": "Moonlight per attack",
      "icon": "Infernum.png",
      "description": "Innate - Incendiary: Infernum fires a firebolt towards the target enemy unit, splitting into four other firebolts in a cone behind it. The firebolt deals 110% AD physical damage to the main target and 75 / 100% (based on level) AD physical damage to each secondary enemy it passes through, reduced to 34 / 45% (based on level) AD physical damage against  minions.",
      "description2": "Critical strikes spray eight firebolts over a 100% wider cone and deal bonus damage.",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Special",
      "spellshield": "False",
      "projectile": "True",
      "notes": "* The initial firebolt applies  basic damage to the primary target. The split firebolts deal  area damage to secondary targets."
    },
    "Crescendum": {
      "name": "Crescendum",
      "disp_name": "Crescendum, the Chakram",
      "champion": "Aphelios",
      "skill": "A",
      "speed": "600 (+ 75 per 10% bonus attack speed)",
      "cost": "1",
      "costtype": "Moonlight per attack",
      "icon": "Crescendum.png",
      "description": "Innate - Arcing: Basic attacks with Crescendum hurl the blade at the target, which lingers for 0.25 seconds before homing back to Aphelios. He is  disarmed until he retrieves Crescendum, but the attack timer is reset once caught.",
      "icon2": "Crescendum 2.png",
      "description2": "Whenever Aphelios casts an ability that would require him to throw Crescendum, he instead throws a spectral Chakram at his target that similarly returns to him. Aphelios accumulates the Chakrams he catches, up to 20, which last for 5 seconds. Attacks against  champions and epic  monsters will refresh the lifespan on Chakrams.",
      "description3": "Basic attacks with Crescendum are empowered to deal 0% −  173% (based on number of Chakrams) AD bonus physical damage and have a 10.67% wind up percentage, decreased to 6.67% when  critically striking. The bonus damage from Chakrams can critically strike.",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "attack",
      "projectile": "True",
      "notes": "* Accumulated Chakrams accompany Crescendum whenever Aphelios performs a basic attack. This is merely a visual representation of the increased damage, and the separate blades are not considered separate damage sources nor projectiles.\n All Chakram stacks are lost if the Crescendum projectile is destroyed (i.e  Wind Wall,  Unbreakable)."
    }
  },
  "skill_q": {
    "Weapons of the Faithful": {
      "name": "Weapons of the Faithful",
      "champion": "Aphelios",
      "skill": "Q",
      "icon": "Weapons of the Faithful.png",
      "description": "The active effect of Aphelios'  varies based on his current main hand weapon.",
      "description2": "The individual actives do not share a cooldown."
    },
    "Moonshot": {
      "name": "Moonshot",
      "champion": "Aphelios",
      "skill": "Q",
      "target range": "1450",
      "width": "90",
      "speed": "1850",
      "cost": "10 Moonlight + 60",
      "costtype": "Mana",
      "cooldown": "10 / 9.5 / 9 / 8.5 / 8 (based on level)",
      "icon": "Moonshot.png",
      "description": "Calibrum - Active: Aphelios fires a bolt of energy in a line, dealing 60 / 85 / 110 / 135 / 160 (based on level) (+ 60% bonus AD) (+ 100% AP) physical damage to the first enemy hit.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "spell",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Moonshot's name is modified based on Aphelios' off-hand weapon:\n  Resurgent Moonshot\n  Binding Moonshot\n  Incendiary Moonshot\n  Arcing Moonshot"
    },
    "Onslaught": {
      "name": "Onslaught",
      "champion": "Aphelios",
      "skill": "Q",
      "cost": "10 Moonlight + 60",
      "costtype": "Mana",
      "cooldown": "10 / 9 / 8 (based on level)",
      "icon": "Onslaught.png",
      "description": "Severum - Active: For 1.75 seconds, Aphelios gains 20% (+ 10% per 100 AP)  bonus movement speed and autonomously performs up to 6 (+ 3 per 100% bonus attack speed) attacks over the duration to the nearest enemy, prioritizing enemy  champions.",
      "description2": "Attacks alternate between Severum and his current off-hand weapon, each dealing 10 / 15 / 20 / 25 / 30 (based on level) (+ 30% bonus AD) physical damage, 25% on-hit damage and can  critically strike.",
      "targeting": "Auto-targeted",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "attack",
      "onhiteffects": "True",
      "projectile": "Special",
      "notes": "* Severum's attacks are not  intercepted, but the attacks from the off-hand weapon are during Onslaught.\n Onslaught's name is modified based on Aphelios' off-hand weapon:\n  Precision Onslaught\n  Binding Onslaught\n  Incendiary Onslaught\n  Arcing Onslaught\n\n Onslaught doesn't apply on-attack effects.\n  Crescendum will not deal damage if blocked by  Wind Wall, but the stacks will still be gained.\n Cosmetically, the Moonlight cost is consumed through the duration."
    },
    "Binding Eclipse": {
      "name": "Binding Eclipse",
      "champion": "Aphelios",
      "skill": "Q",
      "effect radius": "Global",
      "cost": "10 Moonlight + 60",
      "costtype": "Mana",
      "cooldown": "12 / 11.5 / 11 / 10.5 / 10 (based on level)",
      "icon": "Binding Eclipse.png",
      "description": "Gravitum - Active: Aphelios expunges all enemies affected by Gravitum's  slow, dealing 50 / 65 / 80 / 95 / 110 (based on level) (+ 35% bonus AD) (+ 70% AP)  magic damage and  rooting them for 1 second.",
      "targeting": "Auto-targeted",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Spell",
      "spellshield": "True"
    },
    "Duskwave": {
      "name": "Duskwave",
      "champion": "Aphelios",
      "skill": "Q",
      "target range": "650",
      "width": "200",
      "cost": "10 Moonlight + 60",
      "costtype": "Mana",
      "cooldown": "9 / 8 / 7 / 6 (based on level)",
      "icon": "Duskwave.png",
      "description": "Infernum - Active: Aphelios unleashes a wave of energy in a cone, dealing 25 / 35 / 45 / 55 / 65 (based on level) (+ 80% bonus AD) (+ 70% AP) physical damage to all enemies hit and locking on to each of them. After a delay, Aphelios then fires a volley of attacks from his current off-hand weapon, one at each locked-on enemy, applying on-hit effects. There is no  range limit for locked-on targets.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "special",
      "onhiteffects": "true",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* The volley applies  area damage and the follow up attacks from the off-hand weapon deal  basic damage.\nThe hitbox also includes a very small portion behind Aphelios's character model\n Duskwave's name is modified based on Aphelios' off-hand weapon:\n  Precision Duskwave\n  Resurgent Duskwave\n  Binding Duskwave\n  Arcing Duskwave\n\n Aphelios is  locked-out of performing basic attacks until Duskwave resolves.\n The automatic attacks do no trigger on-attack effects."
    },
    "Sentry": {
      "name": "Sentry",
      "champion": "Aphelios",
      "skill": "Q",
      "target range": "475",
      "effect radius": "575",
      "cost": "10 Moonlight + 60",
      "costtype": "Mana",
      "cooldown": "9 / 8.25 / 7.5 / 6.75 / 6 (based on level)",
      "icon": "Sentry.png",
      "description": "Crescendum - Active: Aphelios deploys an  untargetable lunar sentry for up to 20 seconds. The sentry attacks if an enemy gets in range, reducing its duration to 4 seconds and becoming targetable. Deploying a new sentry reduces the eldest's duration to 4 seconds. A sentry has 3 health, enemies can attack the sentry with basic attacks, dealing 1 damage per hit.",
      "description2": "The sentry autonomously attacks the nearest enemy in range with a clone of Aphelios current off-hand weapon, dealing 25 / 40 / 55 / 70 / 85 (based on level) (+ 50% bonus AD) (+ 50% AP) physical damage. The sentry can  critically strike and benefits from Aphelios'  attack speed and  critical strike chance.",
      "targeting": "Auto-targeted",
      "affects": "Enemies",
      "damagetype": "physical",
      "spelleffects": "Pet",
      "projectile": "Special",
      "notes": "* Sentry's name is modified based on Aphelios' off-hand weapon:\n  Precision Sentry\n  Resurgent Sentry\n  Heals Aphelios for any damage it deals.\n\n  Binding Sentry\n  Incendiary Sentry"
    }
  },
  "skill_w": {
    "Phase": {
      "name": "Phase",
      "champion": "Aphelios",
      "skill": "W",
      "cast time": "false",
      "static": "0.8",
      "icon": "Phase.png",
      "description": "Active: Aphelios switches between his main weapon and off-hand weapon."
    }
  },
  "skill_e": {
    "Weapon Queue System": {
      "name": "Weapon Queue System",
      "champion": "Aphelios",
      "skill": "E",
      "icon": "false",
      "description": "The icon of this ability reflects the next weapon that is in reserve.",
      "description2": "Active: Aphelios receives a text prompt of the weapon Alune will create next.",
      "targeting": "None",
      "notes": "* This ability also includes the icon of the off-hand."
    }
  },
  "skill_r": {
    "Moonlight Vigil": {
      "name": "Moonlight Vigil",
      "champion": "Aphelios",
      "skill": "R",
      "target range": "1575",
      "effect radius": "300",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "120 / 110 / 100 (based on level)",
      "icon": "Moonlight Vigil.png",
      "description": "Active: Aphelios casts forth a lunar spotlight that stops upon illuminating an  enemy champion. Alune smites the area centered on the illuminated enemy, dealing 125 / 175 / 225 (based on level) (+ 20% bonus AD) (+ 100% AP)  physical damage and locking-on to each enemy hit.",
      "description2": "After a delay, attacks will begin raining from the sky based on Aphelios' current main weapon, one upon each enemy locked-on by Moonlight Vigil, applying on-hit effects. These attacks can  critically strike for (50% +  18.75%) AD bonus physical damage. There is no  range limit for locked-on targets.\n Calibrum: Applies an empowered mark that deals 20 / 45 / 70 (based on level)  additional physical damage per mark.\n\n Severum: If at least one enemy is hit, Aphelios  heals for 200 / 300 / 400 (based on level) health.\n\n Gravitum: The initial  slow is increased to 99%.\n\n Infernum: The initial blast deals an additional 50 / 100 / 150 (based on level) (+ 25% bonus AD) physical damage. Attacks  splash in a 400 unit circle instead of a cone, dealing 75% of that damage. Enemies will take damage from overlapping areas.\n\n Crescendum: 3 additional spectral chakrams return to Aphelios from the first enemy hit, for a total of 4, on top of those from other enemies hit.",
      "targeting": "Direction",
      "affects": "Enemies",
      "spelleffects": "aoe",
      "projectile": "Special",
      "notes": "* The basic attack do not use projectiles no matter what main weapon is in play.\n Aphelios will resume his attack order after the ability is cast, and the basic attack from Moonlight Vigil does not require his input.\n The basic attacks from Moonlight Vigil critically strike independently from each other. Targets further away from the center of the blast are hit after a slightly longer delay. These attacks do not apply on-attack effects.\nChanging weapons while Moonlight Vigil is in flight does not change the effect it has when it hits.\nWith  Calibrum, the extra damage from consuming the mark is a bonus damage on top of  Calibrum's normal mark consumption damage.\n With  Infernum, 14 fire bolts splash from each target hit. For critical strikes, 18 fire bolts are launched instead. This does not occur if the initial damage of Moonlight Vigil kills the target.\n With  Crescendum, 1 spectral chakram is gained for every target hit by the blast, meaning it is possible to gain up to 8 spectral chakrams with one use of Moonlight Vigil if it hits 5 enemy champions.\n With  Severum, the extra flat heal is given only once, not per target. However, all damage done by Moonlight Vigil with it also heals him from  Severum's own passive effect."
    }
  }
}