{
  "id": 22,
  "apiname": "Ashe",
  "title": "the Frost Archer",
  "attack": 7,
  "defense": 3,
  "magic": 2,
  "difficulty": 1,
  "herotype": "Marksman",
  "alttype": "Support",
  "resource": "Mana",
  "stats": {
    "hp_base": 539,
    "hp_lvl": 85,
    "mp_base": 280,
    "mp_lvl": 32,
    "arm_base": 26,
    "arm_lvl": 3.4,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 3.5,
    "hp5_lvl": 0.55,
    "mp5_base": 6.972,
    "mp5_lvl": 0.4,
    "dam_base": 61,
    "dam_lvl": 2.96,
    "as_base": 0.658,
    "as_lvl": 3.33,
    "range": 600,
    "ms": 325,
    "acquisition_radius": 600,
    "selection_radius": 120,
    "pathing_radius": 35,
    "crit_base": 100,
    "as_ratio": 0.657999992370605,
    "attack_delay_offset": -0.0807017534971237,
    "aram_dmg_dealt": 0.95
  },
  "rangetype": "Ranged",
  "date": "2009-02-21",
  "patch": "Alpha Week 2",
  "changes": "V9.22",
  "role": [
    "Marksman"
  ],
  "damage": 2,
  "toughness": 1,
  "control": 3,
  "mobility": 1,
  "utility": 2,
  "style": 20,
  "adaptivetype": "physical",
  "be": 450,
  "rp": 260,
  "skill_i": {
    "Frost Shot": {
      "name": "Frost Shot",
      "champion": "Ashe",
      "skill": "I",
      "icon": "Frost Shot.png",
      "blurb": "Ashe's attacks slow their target, causing her to deal increased damage to these targets. Ashe's critical strikes deal no bonus damage but apply an empowered slow to the target.",
      "description": "Innate - Frost Shot: Ashe's basic attacks and abilities apply Frost to enemies,  slowing them by 20% −  30% (based on level) for 2 seconds and causing subsequent basic attacks against them to deal 10% (+ (100% +  25%) critical strike chance) AD  bonus physical damage while they remain  slowed.",
      "icon2": "Frost Shot 2.png",
      "description2": "Innate - Critical Slow: Ashe's  critical strikes double Frost's slow strength to 40% −  60% (based on level), decaying over 1 second to its normal strength.",
      "targeting": "Passive / Unit",
      "affects": "Enemies",
      "damagetype": "Physical",
      "occurrence": "On-hit",
      "spellshield": "True",
      "notes": "* Frost Shot's damage is reduced by  Randuin's Omen.\n Frost Shot's base 10% bonus damage is not affected by critical strike modifiers.\n  Runaan's Hurricane's bolts will deal increased damage from Frost Shot.\n  Runaan's Hurricane's additional bolts will also not deal additional damage on  critical strikes.\n After slowing an enemy champion she will be able to trigger  Cheap Shot on that enemy champion without slowing them for the entire game."
    }
  },
  "skill_q": {
    "Ranger's Focus": {
      "name": "Ranger's Focus",
      "champion": "Ashe",
      "skill": "Q",
      "cost": "50",
      "costtype": "Mana + 4 Focus",
      "icon": "Focus.png",
      "blurb": "Ashe builds up Focus by attacking. At maximum Focus, Ashe can cast Ranger's Focus to consume all stacks of Focus, temporarily increasing her Attack Speed and transforming her basic attack into a powerful flurry attack for the duration.",
      "description": "Passive - Focus: While Ranger's Focus is inactive, Ashe's basic attacks on-attack against  non-structures grant Focus for 4 seconds, stacking up to 4 times, with the duration also refreshing on structure attacks. After 4 seconds, each stack thereafter will fall off every second.",
      "icon2": "Ranger's Focus.png",
      "description2": "Active: Ashe gains  bonus attack speed for 4 seconds and causes each of her basic attacks to fire a flurry of five arrows.",
      "leveling2": "Bonus Attack Speed:\n20 / 25 / 30 / 35 / 40%",
      "icon3": "Ranger's Focus 2.png",
      "description3": "Flurries trigger on-hit effects only once, and each arrow deals modified physical damage that benefits from  Frost Shots and  life steal.",
      "leveling3": "Damage Per Arrow:\n21 / 22 / 23 / 24 / 25% AD\nTotal Damage Per Flurry:\n105 / 110 / 115 / 120 / 125% AD",
      "description4": "Ranger's Focus resets Ashe's basic attack timer.",
      "targeting": "No Target",
      "affects": "Self",
      "damagetype": "Physical",
      "spelleffects": "spellpersist",
      "occurrence": "On-hit",
      "projectile": "True",
      "notes": "* Although Ranger's Focus has no actual cooldown, 4 stacks of focus are needed before Ranger's Focus can be reactivated. The time before being able to reactivate Ranger's Focus is 6.08 − 1.6 (based on attack speed) seconds.\n The multi-attack effect is similar to  Lightslinger and  Double Strike, except that on-hit effects aren't applied by the extra attacks.\n Each arrow from a flurry applies  Frost and the bonus damage from  Frost Shot is calculated individually per arrow.\n Similarly, since a flurry is 5 instances of physical damage,  The Black Cleaver allows her to cleave the enemy target 5 times per flurry.\n  Amumu's  Tantrum will reduce each arrow's damage, for a total of 10 − 50 (based on E Rank) per flurry.\n\n Each additional arrow from  Runaan's Hurricane will also split into 5 arrows.\n The arrows are evenly distributed among secondary enemies but one enemy cannot be hit by more than 5 arrows.\n The flurry will trigger on-hit effects once to each enemy hit.\n Wind's Fury's splash damage is affected by the damage modifier of Ranger's Focus Rank 1 and doesn't increase based on its Rank - always dealing  (8.4% AD) damage per arrow    (42% AD) damage per flurry  to each secondary target.\n\n The Flurry attack can be used on structures.\n Each Flurry attack is considered a spell for the purpose of  Maokai's  Sap Magic."
    }
  },
  "skill_w": {
    "Volley": {
      "name": "Volley",
      "champion": "Ashe",
      "skill": "W",
      "collision radius": "10",
      "effect radius": "1200",
      "angle": "57.5°",
      "speed": "2000",
      "cost": "70",
      "costtype": "Mana",
      "cooldown": "14 / 11.5 / 9 / 6.5 / 4",
      "icon": "Volley.png",
      "blurb": "Ashe fires 9 arrows in a cone for increased damage. Also applies Frost Shot.",
      "description": "Active: Ashe fires 9 arrows in a cone in the target direction, each dealing physical damage to the first enemy struck, and applying  Critical Slow to enemy  champions.",
      "leveling": "Physical Damage:\n20 / 35 / 50 / 65 / 80 (+ 100% AD)",
      "description2": "Enemies do not take damage from arrows beyond the first.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "special",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* This ability applies  spell damage in an  area of effect range."
    }
  },
  "skill_e": {
    "Hawkshot": {
      "name": "Hawkshot",
      "champion": "Ashe",
      "skill": "E",
      "target range": "Global",
      "effect radius": "1000",
      "speed": "1400",
      "cost": "1",
      "costtype": "Charge",
      "cooldown": "5",
      "recharge": "90 / 80 / 70 / 60 / 50",
      "icon": "Hawkshot.png",
      "blurb": "Ashe sends her Hawk Spirit on a scouting mission anywhere on the map.",
      "description": "Passive: Ashe periodically stocks a Hawkshot charge, up to a maximum of 2.",
      "description2": "Active: Ashe sends a hawk spirit toward the target location,  exposing the area along its path for 2 seconds and in a large radius at its destination for 5 seconds.",
      "targeting": "Ground",
      "affects": "Enemies",
      "projectile": "True",
      "notes": "* Hawkshot grants standard  sight, which does not reveal stealthed units.\n Hawkshot's recharge timer seems to start at the beginning of the game, even prior to ranking the ability, but when you actually rank the ability, you start with one charge and the recharge timer starts from 0.\n Hawkshot will ping enemies it spots if your team didn't already have vision of them.\n Hawkshot will grant assist credit if a previously-unseen enemy is killed within 10 seconds of being revealed by Hawkshot."
    }
  },
  "skill_r": {
    "Enchanted Crystal Arrow": {
      "name": "Enchanted Crystal Arrow",
      "champion": "Ashe",
      "skill": "R",
      "target range": "Global",
      "effect radius": "125",
      "speed": "1600",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "100 / 95 / 90 / 85 / 80",
      "icon": "Enchanted Crystal Arrow.png",
      "blurb": "Ashe fires a missile of ice in a straight line. If the arrow collides with an enemy Champion, it deals damage and stuns the Champion, stunning for longer the farther arrow has traveled. In addition, surrounding enemy units take damage and are slowed.",
      "description": "Active: Ashe fires a  missile of ice in the target direction, granting brief  sight of its surroundings. The arrow shatters upon hitting a  enemy champion, dealing  magic damage and  stunning them for 1 − 3.5 (based on distance traveled) seconds.",
      "leveling": "Magic Damage:\n200 / 300 / 400 / 500 / 600 (+ 100% AP)",
      "description2": "Enemies surrounding the main target also take 50% damage.",
      "leveling2": "Secondary Magic Damage:\n100 / 150 / 200 / 250 / 300 (+ 50% AP)",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "special",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* The arrow applies  spell damage to the primary target and  area damage to secondary targets.\n The target hit is also revealed corresponding to the duration of the stun."
    }
  }
}