{
  "id": 432,
  "apiname": "Bard",
  "title": "the Wandering Caretaker",
  "attack": 4,
  "defense": 4,
  "magic": 5,
  "difficulty": 3,
  "herotype": "Support",
  "alttype": "Mage",
  "resource": "Mana",
  "stats": {
    "hp_base": 575,
    "hp_lvl": 89,
    "mp_base": 350,
    "mp_lvl": 50,
    "arm_base": 34,
    "arm_lvl": 4,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 5.5,
    "hp5_lvl": 0.55,
    "mp5_base": 6,
    "mp5_lvl": 0.45,
    "dam_base": 52,
    "dam_lvl": 3,
    "as_base": 0.625,
    "as_lvl": 2,
    "range": 500,
    "ms": 330,
    "acquisition_radius": 600,
    "selection_radius": 88.8889007568359,
    "pathing_radius": 35,
    "gameplay_radius": 80,
    "as_ratio": 0.625,
    "attack_cast_time": 0.300000011920928,
    "attack_total_time": 1.60000002384185,
    "attack_delay_offset": -0.100000001490116,
    "aram_dmg_dealt": 1.08,
    "aram_dmg_taken": 0.95,
    "urf_dmg_dealt": 1.2,
    "urf_dmg_taken": 0.9
  },
  "fullname": "Bard",
  "rangetype": "Ranged",
  "date": "2015-03-12",
  "patch": "V5.5",
  "changes": "V9.18",
  "role": [
    "Catcher"
  ],
  "damage": 1,
  "toughness": 1,
  "control": 3,
  "mobility": 2,
  "utility": 3,
  "style": 65,
  "adaptivetype": "magic",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "Traveler's Call": {
      "name": "Traveler's Call",
      "champion": "Bard",
      "skill": "I",
      "icon": "Traveler's Call.png",
      "blurb": "Bard's presence causes magical chimes to appear, which grant Bard experience, mana, and a burst of speed. Additionally, lesser spirits follow Bard and aid in his attacks - collecting chimes causes these meeps to gain power over the course of the game.",
      "description": "Innate - Ancient Chimes: Bard's presence causes sacred chimes to appear at random locations and linger for up to 10 minutes. Collecting a chime grants Bard  24% bonus movement speed out of combat for 7 seconds, stacking up to 5 times, with every other chime collected beyond the first granting an additional 14% bonus movement speed, up to a total of 80% bonus movement speed,  20 + (1 per minute after 5 minutes) experience, and  12% maximum mana. Bard empowers his  Meeps each time he collects 5 chimes.",
      "icon2": "Traveler's Call 2.png",
      "description2": "Innate - Meeps: Bard's presence attracts small spirits known as Meeps to his side. On-attack he consumes a Meep, dealing 40 (+ 15 per 5 chimes collected) (+ 30% AP)  bonus magic damage. At 5 chimes, Meeps start  slowing damaged enemies by 25% − 75% (based on number of Chimes) for 1 second, and at 15 chimes they deal splash damage to enemies within 150 units of his target as well as those in a cone behind them, with the cone's size increasing at 35 chimes. Meeps spawn every 8 − 4 (based on number of Chimes) seconds and Bard can keep up to 1 − 9 (based on number of Chimes) of them at a time.",
      "targeting": "Passive",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "Special",
      "projectile": "True",
      "notes": "* Chime spawns are weighted towards the areas of the map that Bard is currently present in, and spawn every 50 seconds in pairs, with the only exception being the second and third spawns on Summoner's Rift, which spawn only one.\n Chimes will not spawn in either team's base and will not spawn in the enemy team's jungle before the 5 minute mark.\n\n Only Bard can see a chime that is in the fog of war. All other players must have  sight of a chime for it to be visible to them.\n Only Bard can see a minimap icon for uncollected chimes, regardless of whether other players have vision on it or not. The minimap icon will turn red when the chime is one minute away from expiration.\n Bard cannot see chimes while  nearsighted.\n\n Only Meep cone attacks break spell shields. Those that deal damage together with the basic attack don't.\n\n\n\n Minimum Time\n Chimes\n Effects\n Base Damage\n\n\n3:20  5   Meeps now  Slow by 25%.  55\n\n\n5:00  10  Meep limit increased to 2.  70\n\n\n7:30  15   Meeps now deal splash damage.  85\n\n\n9:10  20  Recharge time reduced to 7 seconds.  100\n\n\n11:40  25   Slow increased to 35%.  115\n\n\n13:20  30  Meep limit increased to 3.  130\n\n\n15:50  35  Splash damage area increased.  145\n\n\n17:30  40  Recharge time reduced to 6 seconds.  160\n\n\n20:00  45   Slow increased to 45%.  175\n\n\n21:40  50  Meep limit increased to 4.  190\n\n\n24:10  55  Recharge time reduced to 5 seconds.  205\n\n\n25:50  60   Slow increased to 55%.  20\n\n\n28:20  65  Meep limit increased to 5.  235\n\n\n30:00  70  Recharge time reduced to 4 seconds.  250\n\n\n32:30  75   Slow increased to 65%.  265\n\n\n34:10  80  Meep limit increased to 6.  280\n\n\n36:40  85   Slow increased to 75%. 295\n\n\n38:20  90  Meep limit increased to 7.  310\n\n\n40:50  95  Meep limit increased to 8.  325\n\n\n42:30  100  Meep limit increased to 9.  340\n\n\n Every 5 thereafter only grants 15 bonus damage.",
      "Chimes": "Effects",
      "3:20": "5",
      "55": "5:00",
      "Meep limit increased to 2.": "70",
      "15": "Meeps now deal splash damage.",
      "9:10": "20",
      "100": "11:40",
      "Slow increased to 35%.": "115",
      "30": "Meep limit increased to 3.",
      "15:50": "35",
      "145": "17:30",
      "Recharge time reduced to 6 seconds.": "160",
      "45": "Slow increased to 45%.",
      "21:40": "50",
      "190": "24:10",
      "Recharge time reduced to 5 seconds.": "205",
      "60": "Slow increased to 55%.",
      "28:20": "65",
      "235": "30:00",
      "Recharge time reduced to 4 seconds.": "250",
      "75": "Slow increased to 65%.",
      "34:10": "80",
      "280": "36:40",
      "Slow increased to 75%.": "295",
      "90": "Meep limit increased to 7.",
      "40:50": "95",
      "325": "42:30",
      "Meep limit increased to 9.": "340",
      "Displays additional information with effect table to the right.": "flavorsound",
      "flavor sound": "video",
      "video 2": "yvideo",
      "YouTube video": "yvideo2"
    }
  },
  "skill_q": {
    "Cosmic Binding": {
      "name": "Cosmic Binding",
      "champion": "Bard",
      "skill": "Q",
      "target range": "850",
      "speed": "1500",
      "cost": "60",
      "costtype": "Mana",
      "cooldown": "11 / 10 / 9 / 8 / 7",
      "icon": "Cosmic Binding.png",
      "blurb": "Bard fires a missile which will slow the first enemy struck, and continue onward. If it strikes a wall, it will stun the initial target; if it strikes another enemy, it will stun them both.",
      "description": "Active: Bard fires a burst of spirit energy in the target direction, dealing magic damage to the first enemy struck and briefly  slowing them by 60%.",
      "leveling": "Magic Damage:\n80 / 125 / 170 / 215 / 260 (+ 65% AP)\nDisable Duration:\n1 / 1.2 / 1.4 / 1.6 / 1.8",
      "description2": "After Cosmic Binding hits an enemy, the energy continues behind them for 300 units. If the burst hits a wall or a second enemy, it  stuns both targets for the same duration, dealing the same magic damage to the second target as well.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Spell",
      "spellshield": "Special",
      "projectile": "True",
      "notes": "* For the first target hit,  Spell shield will only block the damage and slow component from Cosmic Binding. However, the ability will still consider to have hit a target and will trigger the secondary portion of the effect. If a second target is hit, the first target will still be stunned.\n For the second target hit,  Spell shield will block the damage and prevent the stun from affecting them, but they will still be considered as being hit and will cause the first target to become stunned. PENDING FOR TEST Can the first target block the stun separately?\n\n Cosmic Binding will take into account player-created terrain such as  Cataclysm and  Crystallize.\n The stun is still applied even if the first or second target dies to the ability itself or before the projectile can bind them.\n Base Gates may only be used as a wall if they are not for Bard's team.\n Cosmic Binding does not grant vision of enemies hit, but a hit can be seen and heard to indicate that at least one enemy is there."
    }
  },
  "skill_w": {
    "Caretaker's Shrine": {
      "name": "Caretaker's Shrine",
      "champion": "Bard",
      "skill": "W",
      "target range": "800",
      "cost": "70",
      "costtype": "Mana",
      "cooldown": "12",
      "icon": "Caretaker's Shrine.png",
      "blurb": "Reveals a healing shrine which powers up over a short time, disappearing after healing the first ally that touches it.",
      "description": "Active: Bard conjures a shrine at the target location that builds up in power over 10 seconds, up to 3 shrines active at once, which remains until consumed when a champion steps on it.",
      "description2": "If the champion was an ally or Bard himself, they are  healed for an amount based on the shrine's power and gain  50% bonus movement speed that decays over 1.5 seconds.",
      "leveling2": "Minimum Heal:\n30 / 60 / 90 / 120 / 150 (+ 30% AP)\nMaximum Heal:\n70 / 110 / 150 / 190 / 230 (+ 60% AP)",
      "targeting": "Ground",
      "affects": "Allies",
      "spelleffects": "Heal",
      "notes": "* If Bard has 3 shrines on the map and creates a new that is immediately consumed, the oldest shrine will not be destroyed. This is because the Shrine is used as an actual targeted heal on himself or someone else, and not a permanent shrine, so the other 3 stay.\n Leveling up Caretaker's Shrine will affect the healing of existing shrines.\n Placing a new Caretaker's Shrine grants vision of a small area around it for ~1.8 seconds.\n The target indicator of Caretaker's Shrine shows the area in which it can be used as a targeted heal. After a shrine has been placed on the ground its activation area becomes smaller: allies or enemies have to step directly on the shrine to use it or destroy it."
    }
  },
  "skill_e": {
    "Magical Journey": {
      "name": "Magical Journey",
      "champion": "Bard",
      "skill": "E",
      "target range": "900",
      "speed": "900 / 1200",
      "cost": "30",
      "costtype": "Mana",
      "cooldown": "18 / 17 / 16 / 15 / 14",
      "icon": "Magical Journey.png",
      "blurb": "Bard opens a portal in nearby terrain. Allies and enemies alike can take a one-way trip through that terrain by moving into the portal.",
      "description": "Active: Bard opens a one-way magical corridor through a piece of terrain in the target direction for 10 seconds. Magical Journey will not cast unless it can open a corridor.",
      "description2": "Both allies and enemies can  pass through the corridor by right-clicking on it or its exit, with allies and Bard travelling at 33.3% increased speed.",
      "targeting": "Unit-targeted (Terrain)",
      "affects": "Self, Allies, Enemies",
      "projectile": "False",
      "notes": "* Magical Journey's tunnel has a max range of 2600 units (about two screens long)[3].\n Magical Journey will score assists for Bard if an ally that uses it scores a kill or assist shortly after.\n There is no limit to how many times a given instance of Magical Journey may be used.\n Units using Magical Journey are targetable whilst en route.\n Allies are granted vision of enemies for the duration they use Magical Journey.\n Magical Journey cannot interact with player-created terrain due to its short lifespan.[4]\n Magical Journey cannot be used to exit the map.\n Any abilities that continue during normal movement, such as point blank area of effects and various forms of stealth, will continue during the travel within Magical Journey.\n Unlike  Dark Passage, Magical Journey can still be utilized if a champion is  silenced.\n Since it's considered a dash, champions travelling are affected by effects that interact with dashes (i.e  Sudden Impact,  Steadfast Presence)."
    }
  },
  "skill_r": {
    "Tempered Fate": {
      "name": "Tempered Fate",
      "champion": "Bard",
      "skill": "R",
      "target range": "3400",
      "effect radius": "350",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "110 / 95 / 80",
      "icon": "Tempered Fate.png",
      "blurb": "Bard sends spirit energy arcing to a location, putting all champions, minions, monsters, and turrets hit into stasis for a brief time.",
      "description": "Active: Bard sends magical energy arcing to the target location, putting all units and structures in the target area into  stasis for 2.5 seconds upon impact.",
      "description2": "Despite normally being immune to crowd control,  epic monsters and  turrets (excluding the  Nexus Obelisk) also enter  stasis.",
      "targeting": "Ground",
      "spellshield": "Special",
      "projectile": "False",
      "notes": "* All  champions (including allies) during the  stasis are prohibited from activating  cleansing effects for its duration.\n  Quicksilver Sash (or  Mercurial Scimitar) is put on cooldown during the stasis and instantly becomes available once it has ended.\n\n Tempered Fate triggers in-combat effects such as drawing turret aggro, applying  Elixir of Sorcery and  Sudden Impact.\n  Elixir of Sorcery deals damage before the target is put into stasis.\n\n Tempered Fate has no effect on  untargetable turrets (those protected by another tower or the inhibitors), untargetable units, or enemy champions that are  unstoppable or immune to disables (such as  Olaf under the effects of  Ragnarok or a  Black Shielded enemy).\n If Bard dies while Tempered Fate is still casting, it will go on  cooldown but will have no effect.\n Tempered Fate cannot affect the enemy team's Nexus and inhibitors. This behavior is intended, as accidentally putting it into  stasis would be extremely punishing for Bard's team.\n Tempered Fate has a cast time of ~0.55 seconds. It's travel time varies between ~0.65 at point blank and ~1.8 at max range, resulting in an overall delay of ~1.2-2.4 seconds depending on distance covered.\n This ability can only be blocked by an enemy's  spell shield. Allies will be put in  stasis no matter what they do."
    }
  }
}