{
  "id": 63,
  "apiname": "Brand",
  "title": "the Burning Vengeance",
  "attack": 2,
  "defense": 2,
  "magic": 9,
  "difficulty": 2,
  "herotype": "Mage",
  "resource": "Mana",
  "stats": {
    "hp_base": 519.68,
    "hp_lvl": 88,
    "mp_base": 469,
    "mp_lvl": 21,
    "arm_base": 21.88,
    "arm_lvl": 3.5,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 5.5,
    "hp5_lvl": 0.55,
    "mp5_base": 10.665,
    "mp5_lvl": 0.6,
    "dam_base": 57.04,
    "dam_lvl": 3,
    "as_base": 0.625,
    "as_lvl": 1.36,
    "range": 550,
    "ms": 340,
    "acquisition_radius": 600,
    "selection_radius": 88.8889007568359,
    "pathing_radius": 35,
    "as_ratio": 0.625,
    "attack_delay_offset": -0.112499997019767,
    "aram_dmg_dealt": 0.95
  },
  "fullname": "Kegan Rodhe",
  "rangetype": "Ranged",
  "date": "2011-04-12",
  "patch": "V1.0.0.115",
  "changes": "V9.10",
  "role": [
    "Burst"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 1,
  "utility": 1,
  "style": 100,
  "adaptivetype": "magic",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Blaze": {
      "name": "Blaze",
      "champion": "Brand",
      "skill": "I",
      "effect radius": "475",
      "icon": "Blaze.png",
      "blurb": "Brand's spells light his targets ablaze, dealing 4% of their maximum Health in magic damage over 4 seconds, stacking up to 3 times. If Brand kills an enemy while it is ablaze he regains mana. When Blaze reaches max stacks on a Champion or monster, it becomes unstable. It detonates in 2 seconds, applying spell effects and dealing massive damage in an area around the victim.",
      "description": "Innate: Brand's abilities set his targets  ablaze for 4 seconds, damaging them for   3% of their maximum health over 3.25 seconds    1% of their maximum health every 1.083 seconds   as  magic damage. Abilities used on an ablazed target are empowered and apply other stacks of blaze while also refreshing the duration of the previous ones. A target can have up to 3 blaze stacks at the same time and the damage per tick against monsters is capped at 80.",
      "description2": "Killing an enemy that is ablazed restores  6 − 18 (based on level) mana.",
      "icon3": "Blaze 2.png",
      "description3": "After reaching 3 stacks on large monsters and enemy champions, an area is marked around them which explodes after 2 seconds, consuming all the stacks. All enemies struck are dealt 12% − 16% (based on level)  (+ 1.5% per 100 AP)    (+ 1% per 66 AP)   of their maximum health as magic damage and are applied a stack of blaze. The explosion will still trigger if the target dies to the third ability or during the delay.",
      "description4": "Brand cannot stack Blaze more than once on enemies who have exploded in the past 4 seconds.",
      "targeting": "Passive",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Special",
      "spellshield": "True",
      "notes": "* The explosion is not considered a tether effect and will not affect  untargetable targets, even if the explosion originated from them.\n Each stack deals the damage individually and will always consider the time it was applied for deciding when the ticks will be applied, even when the duration refreshes.\n At sub-optimal applied times, 2 stacks will do a minimum of 6% maximum health damage over 4 seconds, but will deal 7% maximum health at optimal applied times.\n Against small-medium units 3 stacks will do a minimum of 9% maximum health at sub-optimal times, but 11% maximum health at optimal times. If these stacks are further refreshed at optimal times they can do up to 12% maximum health over 4 seconds.\n\n The burn is  persistent damage and the explosion is  area damage."
    }
  },
  "skill_q": {
    "Sear": {
      "name": "Sear",
      "champion": "Brand",
      "skill": "Q",
      "target range": "1100",
      "speed": "1600",
      "cost": "50",
      "costtype": "mana",
      "cooldown": "8 / 7.5 / 7 / 6.5 / 6",
      "icon": "Sear.png",
      "blurb": "Brand launches a ball of fire forward that deals magic damage. If the target is ablaze, Sear will stun the target for 1.5 seconds.",
      "description": "Active: Brand launches a fireball in the target direction that deals magic damage to the first enemy it hits.",
      "leveling": "Magic Damage:\n80 / 110 / 140 / 170 / 200 (+ 55% AP)",
      "description2": "Blaze: The target is also  stunned for 1.5 seconds.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spell",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* With about  35% cooldown reduction and Sear at maximum rank, it is possible to apply the  stun without having to use other abilities. The  cooldown of Sear will be lower than the duration of the applied  Blaze.\n Note the cooldown of Sear is reduced to 3.9 seconds while the Blaze burn only lasts for 4 seconds.\n This, however, is not reliable as you only have a 0.1 second time-window to apply the empowered effect of Sear."
    }
  },
  "skill_w": {
    "Pillar of Flame": {
      "name": "Pillar of Flame",
      "champion": "Brand",
      "skill": "W",
      "target range": "900",
      "effect radius": "260",
      "cost": "60 / 70 / 80 / 90 / 100",
      "costtype": "mana",
      "cooldown": "10 / 9.5 / 9 / 8.5 / 8",
      "icon": "Pillar of Flame.png",
      "blurb": "After a short delay, Brand creates a Pillar of Flame at a target area, dealing magic damage to enemy units within the area. Units that are ablaze take an additional 25% damage.",
      "description": "Active: After a 0.625-second delay, Brand erupts the target area in flames, dealing magic damage to enemies within.",
      "leveling": "Magic Damage:\n75 / 120 / 165 / 210 / 255 (+ 60% AP)",
      "description2": "Blaze: Pillar of Flame deals 25% bonus damage.",
      "leveling2": "Increased Damage:\n93.75 / 150 / 206.25 / 262.5 / 318.75 (+ 75% AP)",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "True",
      "notes": "* No additional details."
    }
  },
  "skill_e": {
    "Conflagration": {
      "name": "Conflagration",
      "champion": "Brand",
      "skill": "E",
      "target range": "675",
      "effect radius": "375",
      "cost": "70 / 75 / 80 / 85 / 90",
      "costtype": "mana",
      "cooldown": "10 / 9 / 8 / 7 / 6",
      "icon": "Conflagration.png",
      "blurb": "Brand conjures a powerful blast at his target, dealing magic damage to them. If the target is ablaze, Conflagration spreads to nearby enemies.",
      "description": "Active: Brand sets the target enemy aflame, dealing magic damage.",
      "leveling": "Magic Damage:\n70 / 95 / 120 / 145 / 170 (+ 45% AP)",
      "description2": "Blaze: Conflagration also spreads to enemies around the target.",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "True",
      "projectile": "False",
      "notes": "* Conflagration's can spread to stealthed enemies or those hidden in fog of war and/or in brush but does not grant  sight."
    }
  },
  "skill_r": {
    "Pyroclasm": {
      "name": "Pyroclasm",
      "champion": "Brand",
      "skill": "R",
      "target range": "750",
      "effect radius": "600",
      "cost": "100",
      "costtype": "mana",
      "cooldown": "105 / 90 / 75",
      "icon": "Pyroclasm.png",
      "blurb": "Brand unleashes a devastating torrent of fire, dealing magic damage each time it bounces, up to 5 bounces. Bounces prioritize stacking Blaze to max on Champions. If a target is ablaze, Pyroclasm will briefly slow them.",
      "description": "Active: Brand launches a fireball at the target enemy that bounces between nearby enemies up to four times, dealing magic damage each time.",
      "leveling": "Magic Damage:\n100 / 200 / 300 (+ 25% AP)\nTotal Single-Target Damage:\n300 / 600 / 900 (+ 75% AP)",
      "description2": "If Pyroclasm's current target becomes invalid, it selects a new enemy at no cost to its remaining bounces. If its initial target becomes invalid and there are no other valid targets, Pyroclasm refunds its cost and resets its  cooldown.",
      "description3": "Pyroclasm prioritizes getting 3  Blaze stacks on an enemy.",
      "description4": "Blaze: Pyroclasm briefly  slows enemies hit.",
      "leveling4": "Slow:\n30 / 45 / 60%",
      "targeting": "Unit / Auto",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "special",
      "spellshield": "special",
      "projectile": "True",
      "notes": "* This ability applies  spell damage and hits multiple targets in an  area of effect range.\n If the initial cast target uses  spell shield, Pyroclasm will not bounce. If the bounce is spell shielded it will not deal any damage, but it will keep on bouncing.\n Pyroclasm can bounce to  stealthed and enemies hidden from view but does not grant  sight of them.\n There is a recurring bug with bouncing abilities where if the target is  dashing when the missile strikes them, it will repeatedly bounce back to them inflicting multiple ticks of damage near-instantly."
    }
  }
}