{
  "id": 164,
  "apiname": "Camille",
  "title": "the Steel Shadow",
  "attack": 8,
  "defense": 6,
  "magic": 3,
  "difficulty": 3,
  "herotype": "Fighter",
  "alttype": "Tank",
  "resource": "Mana",
  "stats": {
    "hp_base": 575.6,
    "hp_lvl": 85,
    "mp_base": 338.8,
    "mp_lvl": 32,
    "arm_base": 35,
    "arm_lvl": 3.8,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 8.5,
    "hp5_lvl": 0.8,
    "mp5_base": 8.15,
    "mp5_lvl": 0.75,
    "dam_base": 68,
    "dam_lvl": 3.5,
    "as_base": 0.644,
    "as_lvl": 2.5,
    "range": 125,
    "ms": 340,
    "acquisition_radius": 550,
    "selection_radius": 100,
    "pathing_radius": 35,
    "as_ratio": 0.643999993801116,
    "attack_cast_time": 0.300000011920928,
    "attack_total_time": 1.55200004577636,
    "aram_dmg_dealt": 1.06,
    "aram_dmg_taken": 0.94,
    "urf_dmg_dealt": 1.05,
    "urf_dmg_taken": 0.95
  },
  "fullname": "Camille Ferros",
  "rangetype": "Melee",
  "date": "2016-12-07",
  "patch": "V6.24",
  "changes": "V9.17",
  "role": [
    "Diver"
  ],
  "damage": 3,
  "toughness": 2,
  "control": 2,
  "mobility": 3,
  "utility": 1,
  "style": 40,
  "adaptivetype": "physical",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "Adaptive Defenses": {
      "name": "Adaptive Defenses",
      "champion": "Camille",
      "skill": "I",
      "static": "16 / 13 / 10 (based on level)",
      "icon": "Adaptive Defenses.png",
      "blurb": "Basic attacks on champions grant a shield equal to 20% of Camille's maximum health against their damage type (Physical or Magic) for 1.5-2.5 seconds. This effect has a 20-10 second cooldown.",
      "description": "Innate: Periodically, Camille's next basic attack against enemy champions is enhanced to  shield her for 20% of her maximum health for 2 seconds from either exclusively  physical damage or  magic damage, based on which type would mitigate the most damage from her target.",
      "targeting": "Passive",
      "affects": "Self",
      "spelleffects": "Shield",
      "occurrence": "On-hit",
      "notes": "* The shield-typing is determined based on the total damage the target has dealt to champions that game (as a percentage) versus Camille's current armor and magic resistance.\n For example, with little bonus resistances Camille would likely gain the most obvious shield-typing - i.e. physical versus marksmen and magical versus mages. However, with a full-armor build - she may gain a magic damage shield versus a target like  Kog'Maw, as his physical threat is already mitigated by the armor.\n\n What shield she will gain is displayed as an icon beneath an enemy's health bar: Orange for Physical or Blue for Magical."
    }
  },
  "skill_q": {
    "Precision Protocol": {
      "name": "Precision Protocol",
      "champion": "Camille",
      "skill": "Q",
      "cost": "25",
      "costtype": "Mana",
      "cooldown": "9 / 8.25 / 7.5 / 6.75 / 6",
      "icon": "Precision Protocol.png",
      "blurb": "Camille's next attack deals bonus damage and grants bonus movement speed. This spell can be recast for a short period of time, doing significantly increased bonus damage if Camille delays a period of time between the two attacks.",
      "description": "First cast - Active: Camille's next basic attack has  50 bonus range, deals bonus physical damage and grants  bonus movement speed for 1 second.",
      "leveling": "Bonus Physical Damage:\n20 / 25 / 30 / 35 / 40% AD\nBonus Movement Speed:\n20 / 25 / 30 / 35 / 40%",
      "icon2": "Precision Protocol 2.png",
      "description2": "Precision Protocol can then be recast within the next 3.5 seconds at no extra cost.",
      "icon3": "Precision Protocol 3.png",
      "description3": "Second cast - Active: If recast at least 1.5 seconds after the first attack, Precision Protocol's damage is doubled and 40% − 100% (based on level) of the total damage is dealt as  true damage.",
      "leveling3": "Increased Mixed Damage:\n40 / 50 / 60 / 70 / 80% AD",
      "description4": "Both casts of Precision Protocol reset Camille's basic attack timer. The attacks' animations can be cancelled by casting other abilities, but the attacks will still land.",
      "targeting": "Buff",
      "affects": "Self",
      "damagetype": "Physical damage /  True damage",
      "spelleffects": "Proc",
      "occurrence": "On-hit",
      "spellshield": "false",
      "notes": "* Both enhanced attacks cannot  critically strike.\n  On-hit effects do not interact with the true damage conversion, however life steal does.\n\n The basic attacks are  unstoppable, meaning no effect can interrupt them other than death, Camille's or the target's. Using  Flash or going into  stasis (i.e  Zhonya's Hourglass,  Guardian Angel) will cancel the animation but the attack will still land."
    }
  },
  "skill_w": {
    "Tactical Sweep": {
      "name": "Tactical Sweep",
      "champion": "Camille",
      "skill": "W",
      "effect radius": "650",
      "angle": "70°",
      "cast time": "false",
      "cost": "50 / 55 / 60 / 65 / 70",
      "costtype": "Mana",
      "cooldown": "15 / 13.5 / 12 / 10.5 / 9",
      "icon": "Tactical Sweep.png",
      "blurb": "Camille blasts in a cone after a delay, dealing damage. Enemies in the outer half are slowed and take extra damage, while also healing Camille.",
      "description": "Active: After a 1.1 second delay, Camille sweeps her leg to deal physical damage to all enemies in a cone in the target direction,  disarming herself for the duration.",
      "leveling": "Physical Damage:\n70 / 100 / 130 / 160 / 190 (+ 60% bonus AD)\nNon-Epic Monster Damage:\n35 / 50 / 65 / 80 / 95 (+ 30% bonus AD)",
      "description2": "Enemies hit by the outer half of the cone take bonus physical damage and are  slowed by 80% that decays over 2 seconds, capped at 300 damage against  monsters. Camille is  healed for the bonus damage dealt against enemy  champions.",
      "leveling2": "Outer Cone Bonus Damage:\n6 / 6.5 / 7 / 7.5 / 8% (+ 3.3% per 100 bonus AD) of target's maximum health\nBonus Non-Epic Monster Damage:\n3 / 3.25 / 3.5 / 3.75 / 4% (+ 1.6% per 100 bonus AD) of target's maximum health",
      "description3": "Non-epic monsters take 50% damage from Tactical Sweep.",
      "description4": "Other abilities can be cast during the animation without cancelling it.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "spellaoe",
      "spellshield": "true",
      "projectile": "False",
      "notes": "* Camille can move during the delay, but the hitbox and Camille's model are fixed to the initial target direction.\n Camille's facing-direction, for effects such as  Petrifying Gaze, is the direction she is moving, and not the direction the model is facing.\n\n The 50% damage reduction against non-epic monsters applies after the cap. Because of this the actual cap against non-epic monsters is 150 damage.\n Using  Tiamat will cancel the animation, but the sweep will still strike and Camille will still be unable to basic attack."
    }
  },
  "skill_e": {
    "Hookshot": {
      "name": "Hookshot",
      "champion": "Camille",
      "skill": "E",
      "target range": "800",
      "width": "100",
      "cast time": "false",
      "cost": "70",
      "costtype": "Mana",
      "cooldown": "16 / 14.5 / 13 / 11.5 / 10",
      "icon": "Hookshot.png",
      "blurb": "Camille pulls herself to a wall, leaping off and knocking up enemies upon landing.",
      "description": "Active: Camille fires a grapple toward the target location. If the grapple collides with terrain, Camille will  dash toward and bind to the terrain for 0.75 seconds. While bound, she gains the ability to cast  Wall Dive.",
      "description2": "Other abilities can be cast during the ability. Casting  The Hextech Ultimatum will cancel the grapple.",
      "targeting": "Direction",
      "affects": "Terrain, Self",
      "projectile": "true",
      "notes": "* Hookshot can be cast while  rooted but not while  grounded."
    },
    "Wall Dive": {
      "name": "Wall Dive",
      "champion": "Camille",
      "skill": "E",
      "target range": "400 / 800",
      "effect radius": "130",
      "cast time": "false",
      "icon": "Wall Dive.png",
      "blurb": "Camille pulls herself to a wall, leaping off and knocking up enemies upon landing.",
      "description": "Active: Camille  dashes in the target direction, dealing physical damage to enemies near the landing location. The range is doubled towards enemy  champions.",
      "leveling": "Physical Damage:\n60 / 95 / 130 / 165 / 200 (+ 75% bonus AD)",
      "description2": "She prematurely stops upon colliding with an enemy champion,  knocking back and  stunning them and all nearby enemy champions for 0.75 seconds, while also gaining  bonus attack speed for 5 seconds.",
      "leveling2": "Bonus Attack Speed:\n40 / 50 / 60 / 70 / 80%",
      "description3": "Other abilities besides  The Hextech Ultimatum can be cast while grappled or during the dash.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "spellaoe",
      "spellshield": "true",
      "notes": "* Despite what one might assume from a wall-jumping ability, Wall Dive can be used to go through terrain (including the terrain she is bound to).\n  Summoner spells besides  Flash cannot be cast.\n Wall Dive is disabled while  grounded or  rooted but Camille is allowed to move if grounded while attached to a wall. She may still dash away from her current location once the grounding finishes.\n Camille will gain a range indicator for each valid champion to dash to."
    }
  },
  "skill_r": {
    "The Hextech Ultimatum": {
      "name": "The Hextech Ultimatum",
      "champion": "Camille",
      "skill": "R",
      "target range": "475",
      "effect radius": "425",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "140 / 115 / 90",
      "icon": "The Hextech Ultimatum.png",
      "blurb": "Camille dashes to target champion, anchoring them to the area. She also deals bonus magic damage to the target with her basic attacks.",
      "description": "Active: Camille becomes  untargetable and  leaps  unstoppably towards the target  enemy champion.",
      "description2": "When she lands, she creates a hexagonal zone around the target's current location for a duration,  interrupting them and  knocking away all other nearby enemies on impact.",
      "leveling2": "Zone Duration:\n2.5 / 3.25 / 4",
      "description3": "The target cannot escape the zone through any means. While within the zone, Camille's basic attacks deal bonus magic damage.",
      "leveling3": "Bonus Magic Damage:\n5 / 10 / 15 (+ 4 / 6 / 8% of target's current health)",
      "description4": "The Hextech Ultimatum ends automatically within 1 second if Camille leaves the area or dies.",
      "targeting": "Unit / Buff",
      "affects": "Enemies, Self",
      "damagetype": "Magic",
      "spelleffects": "Proc",
      "spellshield": "true",
      "notes": "* Camille will attempt to basic attack the target.\n The trapped victim is  grounded from casting  Flash until the duration of Hextech Ultimatum ends or if Camille leaves the hexagonal zone.\n The ability will be cancelled and go on cooldown if the target dies or becomes untargetable during the cast time.\n Knockaway speed is 1000.\n The boundaries are not considered terrain ( exception), and enemies that try to move out of the area will be displaced back inside.\n Abilities such as  Comet of Legend and  Keeper's Verdict will cap their effect range to the boundary. Targets will stop at the boundary even after it expired.\n  Ekko's  Chronobreak will still deal damage at the hologram's location.\n  Tahm Kench's  Devour can carry Camille's target outside of the area, but they will be displaced back inside once  Regurgitated. \n An active  Assault and Battery on a target outside the perimeter will cause  Vi to continue her charge until The Hextech Ultimatum ends. She can knockback and damage secondary targets multiple times.\n  Shadows placed outside of the hexagonal zone by  Zed can be swapped with but he will only  blink to the nearest position towards his  Shadow while still being unable to escape in The Hextech Ultimatum."
    }
  }
}