{
  "id": 114,
  "apiname": "Fiora",
  "title": "the Grand Duelist",
  "attack": 10,
  "defense": 4,
  "magic": 2,
  "difficulty": 3,
  "herotype": "Fighter",
  "alttype": "Assassin",
  "resource": "Mana",
  "stats": {
    "hp_base": 550,
    "hp_lvl": 85,
    "mp_base": 300,
    "mp_lvl": 40,
    "arm_base": 33,
    "arm_lvl": 3.5,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 8.5,
    "hp5_lvl": 0.55,
    "mp5_base": 8,
    "mp5_lvl": 0.7,
    "dam_base": 68,
    "dam_lvl": 3.3,
    "as_base": 0.69,
    "as_lvl": 3.2,
    "range": 150,
    "ms": 345,
    "acquisition_radius": 600,
    "selection_radius": 100,
    "pathing_radius": 35,
    "as_ratio": 0.689999997615814,
    "attack_cast_time": 0.200000002980232,
    "attack_total_time": 1.45000004768371,
    "urf_dmg_dealt": 0.9,
    "urf_healing": 0.95
  },
  "fullname": "Fiora Laurent",
  "rangetype": "Melee",
  "date": "2012-02-29",
  "patch": "V1.0.0.135",
  "changes": "V9.19",
  "role": [
    "Skirmisher"
  ],
  "damage": 3,
  "toughness": 2,
  "control": 2,
  "mobility": 2,
  "utility": 2,
  "style": 20,
  "adaptivetype": "physical",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Duelist's Dance": {
      "name": "Duelist's Dance",
      "champion": "Fiora",
      "skill": "I",
      "effect radius": "1200 / 400",
      "angle": "90°",
      "icon": "Duelist's Dance.png",
      "blurb": "Fiora challenges nearby enemy Champions to dodge her. She calls out a direction from which she will try to strike. If she can complete her own challenge, she receives a small bonus and calls out a new direction.",
      "description": "Innate: Fiora identifies the Vitals of nearby  visible enemy champions, marked as an arc around themselves. Vitals take 1.75 seconds to become targetable and linger for 13.25 seconds while Fiora remains near the target. After a Vital is triggered or times out, Fiora identifies a new one on her target.",
      "icon2": "Duelist's Dance 2.png",
      "description2": "Successful basic attacks and damaging abilities against a Vital trigger it to deal 2.5% (+ 4.5% per 100 bonus AD) of target's maximum health  bonus true damage,  heal Fiora for  40 − 115 (based on level) and grant her 20 / 30 / 40 / 50% (based on  Grand Challenge's Rank)  bonus movement speed that decays over 1.5 seconds.",
      "targeting": "Passive",
      "affects": "Enemies",
      "damagetype": "True",
      "spelleffects": "Heal",
      "spellshield": "False",
      "notes": "* A Vital's angle is fixed to the champion's model and doesn't interact with its orientation."
    }
  },
  "skill_q": {
    "Lunge": {
      "name": "Lunge",
      "champion": "Fiora",
      "skill": "Q",
      "target range": "400",
      "cost": "20 / 25 / 30 / 35 / 40",
      "costtype": "Mana",
      "cooldown": "16 / 14 / 12 / 10 / 8",
      "icon": "Lunge.png",
      "blurb": "Fiora lunges in a direction and stabs a nearby enemy, dealing physical damage and applying on-hit effects.",
      "description": "Active: Fiora  dashes a short distance in the target direction then stabs a nearby enemy if one is present. Lunge can damage structures and  wards. Stabbing an enemy reduces Lunge's  cooldown instantly by 60%.",
      "description2": "The stab deals  physical damage and applies on-hit effects.",
      "leveling2": "Physical Damage:\n70 / 80 / 90 / 100 / 110 (+ 95 / 100 / 105 / 110 / 115% bonus AD)",
      "description3": "Other abilities can be cast during the dash without cancelling it.",
      "targeting": "Direction / Ground / Auto",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "attack",
      "onhiteffects": "True",
      "spellshield": "True",
      "notes": "* The stab prioritizes in order of:\n Enemy champion affected by  Grand Challenge.\n Vitals facing Fiora.\n Champions who would die to the strike.\n The nearest champion.\n Enemies that would die to the strike.\n The closest enemy.\n Structures.\n Wards.\n\n Lunge can target stealthed units and those hidden in the fog of war.\n The dash can pass through walls.\n Cannot be cancelled by  stasis or  displacement effects.\n Will land (priority order unchanged) even if Fiora dies.\n Will be disabled if Fiora is  grounded.\n Lunges dash speed is affected by movement speed."
    }
  },
  "skill_w": {
    "Riposte": {
      "name": "Riposte",
      "champion": "Fiora",
      "skill": "W",
      "target range": "750",
      "cost": "50",
      "costtype": "Mana",
      "cooldown": "24 / 22 / 20 / 18 / 16",
      "icon": "Riposte.png",
      "blurb": "Fiora parries all incoming damage and disables for a short time, then stabs in a direction. This stab slows the first enemy champion hit, or stuns them if Fiora blocked an immobilizing effect with this ability.",
      "description": "Active: Fiora poises to strike in the target direction, becoming  invulnerable to non-turret damage as well as gaining  crowd control and debuff immunity for the next 0.75 seconds. Fiora is  pacified while poised.",
      "description2": "After the duration, Fiora stabs her sword forward, dealing  magic damage to enemies in a line.",
      "leveling2": "Magic Damage:\n110 / 150 / 190 / 230 / 270 (+ 100% AP)",
      "description3": "The first enemy champion struck is also  slowed and  crippled by 50% for 2 seconds. If Fiora parries at least one  immobilizing effect, Riposte  stuns the target for the same duration instead.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "special",
      "projectile": "True",
      "notes": "* While the in-game tooltip mentions \"parrying\", and many players refer to the effect as a parry, the functionality of the ability is identical to invulnerability. It will even prevent the damage being dealt by applied damage over times that were already active.\n Crowd control effects from epic monsters will be blocked and still count toward the  stun effect against champions.\n Debuff immunity includes summoner spells, such as  Exhaust, as well as damage over times and other effects.\n  Spell shielding the ability will not prevent Vitals from being triggered."
    }
  },
  "skill_e": {
    "Bladework": {
      "name": "Bladework",
      "champion": "Fiora",
      "skill": "E",
      "cost": "40",
      "costtype": "Mana",
      "cooldown": "11 / 9.5 / 8 / 6.5 / 5",
      "icon": "Bladework.png",
      "blurb": "Fiora has increased attack speed for the next two attacks. The first attack slows the target, and the second attack will critically strike.",
      "description": "Active: Fiora's next two basic attacks on-attack within 4 seconds gain  25 bonus range and  bonus attack speed.",
      "leveling": "Bonus Attack Speed:\n50 / 60 / 70 / 80 / 90%",
      "description2": "The first attack  slows the target by 30% for 1 second but cannot critically strike. The second attack will  critically strike for  reduced critical damage (including to  structures).",
      "leveling2": "Critical damage:\n160 / 170 / 180 / 190 / 200%",
      "description3": "Bladework resets Fiora's basic attack timer.",
      "targeting": "Buff",
      "affects": "Self",
      "damagetype": "Physical",
      "spelleffects": "Proc",
      "occurrence": "On-hit",
      "spellshield": "special",
      "notes": "*  Infinity Edge is not affected by the critical damage reduction and will increase the damage as normally.\n Bladework will go on cooldown after either its buff wears off or both basic attacks are consumed.\n  Spell shield will only block the slow from the first hit."
    }
  },
  "skill_r": {
    "Grand Challenge": {
      "name": "Grand Challenge",
      "champion": "Fiora",
      "skill": "R",
      "target range": "500",
      "effect radius": "600",
      "cast time": "false",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "110 / 100 / 90 / 80 / 70",
      "icon": "false",
      "blurb": "Fiora reveals all four Vitals on an enemy champion and gains movement speed while near them. If Fiora hits all 4 Vitals or if the target dies after she has hit at least one, Fiora and her allies in the area are healed over the next few seconds.",
      "description": "Passive:  Duelist's Dance's  bonus movement speed is increased.",
      "leveling": "Bonus Movement Speed:\n10 / 15 / 20 / 25 / 30%",
      "icon2": "Grand Challenge.png",
      "description2": "Active: Fiora challenges the target enemy champion for 8 seconds, highlighting their four Vitals after a 0.5 second delay. While in effect,  Duelist's Dance does not identify new Vitals on Fiora's target.",
      "description3": "While near the target, Fiora gains  Duelist's Dance's  bonus movement speed.",
      "icon4": "Grand Challenge 2.png",
      "description4": "If she triggers at least one Vital before her target dies, or triggers all four, she creates a  Victory Zone that  heals all allied champions within it for 2 − 5 (based on Vitals hit) seconds.",
      "leveling4": "Heal Per Second:\n80 / 95 / 110 / 125 / 140 (+ 60% bonus AD)\nMaximum Heal:\n400 / 475 / 550 / 625 / 700 (+ 300% bonus AD)",
      "description5": "Unlike  Duelist's Dance, the Vitals will keep on lingering even if Fiora is not nearby.",
      "targeting": "Unit",
      "affects": "Self, Enemies",
      "damagetype": "True",
      "spelleffects": "Heal",
      "spellshield": "True",
      "notes": "* Grand Challenge is dispelled instantly if targeting a decoy.\n The damage of this ability scales with  Duelist's Dance.\n Even if Fiora dies, the  Victory Zone will trigger so long as she hit at least one Vital and they die before the Vitals wear off.\n When triggering the  Victory Zone the target is considered dead even if they are being revived (for example:  Guardian Angel,  Chronoshift).\n\n Ally units in  stasis will not be  healed by the  Victory Zone.\n The  Victory Zone can  heal the summoned  Rift Herald."
    }
  }
}