{
  "id": 86,
  "apiname": "Garen",
  "title": "The Might of Demacia",
  "attack": 7,
  "defense": 7,
  "magic": 1,
  "difficulty": 1,
  "herotype": "Fighter",
  "alttype": "Tank",
  "resource": "None",
  "stats": {
    "hp_base": 620,
    "hp_lvl": 84,
    "mp_base": 0,
    "mp_lvl": 0,
    "arm_base": 36,
    "arm_lvl": 3,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 8,
    "hp5_lvl": 0.5,
    "mp5_base": 0,
    "mp5_lvl": 0,
    "dam_base": 66,
    "dam_lvl": 4.5,
    "as_base": 0.625,
    "as_lvl": 3.65,
    "range": 175,
    "ms": 340,
    "acquisition_radius": 600,
    "selection_radius": 75,
    "pathing_radius": 35,
    "as_ratio": 0.625,
    "windup_modifier": 0.5,
    "attack_delay_offset": -0.11999999731779,
    "urf_dmg_taken": 1.1
  },
  "fullname": "Garen Crownguard",
  "rangetype": "Melee",
  "date": "2010-04-27",
  "patch": "V1.0.0.83",
  "changes": "V10.2",
  "role": [
    "Juggernaut"
  ],
  "damage": 2,
  "toughness": 3,
  "control": 1,
  "mobility": 1,
  "utility": 1,
  "style": 75,
  "adaptivetype": "physical",
  "be": 450,
  "rp": 260,
  "skill_i": {
    "Perseverance": {
      "name": "Perseverance",
      "champion": "Garen",
      "skill": "I",
      "icon": "Perseverance.png",
      "blurb": "If Garen has not recently been struck by damage or enemy abilities, he regenerates a percentage of his total health each second. Minion damage does not stop Perseverance.",
      "description": "Innate: Garen  restores  1.5% −  10.1% (based on level) of his maximum health every 5 seconds    0.15% −  1.01% (based on level) of his maximum health every 0.5 seconds  .",
      "description2": "Perseverance is  interrupted for 7 seconds if Garen takes damage from epic  monsters,  turrets, or  champions, or if he is hit by an enemy ability.",
      "targeting": "Passive",
      "affects": "Self",
      "spelleffects": "Heal",
      "notes": "* No additional details."
    }
  },
  "skill_q": {
    "Decisive Strike": {
      "name": "Decisive Strike",
      "champion": "Garen",
      "skill": "Q",
      "cast time": "false",
      "cooldown": "8",
      "icon": "Decisive Strike.png",
      "blurb": "Garen gains a burst of movement speed, breaking free of all slows affecting him. His next attack strikes a vital area of his foe, dealing bonus damage and silencing them.",
      "description": "Active: Garen  cleanses himself of all  slows and gains  30% bonus movement speed for a few seconds.",
      "leveling": "Movement Speed Duration:\n1.5 / 2 / 2.5 / 3 / 3.5",
      "description2": "Additionally, Garen's next basic attack within 4.5 seconds  lunges him towards the target, dealing  bonus physical damage and  silencing the target for 1.5 seconds.",
      "leveling2": "Bonus Physical Damage:\n30 / 60 / 90 / 120 / 150 (+ 40% AD)",
      "description3": "Decisive Strike resets Garen's basic attack timer.",
      "targeting": "Buff",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "Proc",
      "spellshield": "False",
      "notes": "* Decisive Strike does not interrupt Garen's previous orders.\n The enhanced attack will apply other on-hit effects and can  critically strike as normal (the bonus damage does not).\n The bonus damage will also apply  life steal.\n The bonus damage is applied to structures.\n\n If the  slow has a  cripple effect within it, it will also be removed together with the slow.\n For example, it will remove  cripple from  Nasus'  Wither, but not from  Malphite's  Ground Slam.\n Decisive Strike will remove  slow from  Exhaust, but not the damage reduction, for it being two separate effects within one summoner spell.\n It will remove the slow from  Red Buff, but not the damage over time.\n\n Decisive Strike does not protect Garen from re-application of  slows on him.\n Area of effect  slows (like  Trundle's  Pillar of Ice) are re-applied immediately after removing if Garen stays in the corresponding area."
    }
  },
  "skill_w": {
    "Courage": {
      "name": "Courage",
      "champion": "Garen",
      "skill": "W",
      "cast time": "false",
      "cooldown": "23 / 21 / 19 / 17 / 15",
      "icon": "Courage.png",
      "blurb": "Garen passively increases his armor and magic resist by killing enemies. He may also activate this ability to give him a huge burst of Tenacity and damage reduction for a brief moment followed by a lesser amount of damage reduction for a longer duration.",
      "description": "Passive: Garen permanently gains  0.25 bonus armor and  0.25 bonus magic resistance every time he kills an enemy, up to a maximum of 30 bonus resistances at 120 unit kills.",
      "description2": "Active: Garen reduces incoming damage by 30% for a few seconds. For the first 0.75 seconds, Garen is additionally  shielded for 10% of his maximum health and gains 60%  tenacity.",
      "leveling2": "Duration:\n2 / 2.75 / 3.5 / 4.25 / 5",
      "targeting": "Self / Buff",
      "affects": "Self",
      "notes": "* Courage does not interrupt Garen's previous orders.\n Courage's bonus resistances are only gained when it is ranked up at least once, but Courage's passive is retroactive.\n Any enemy unit counts towards Courage's bonus resistances: champions, minions, monsters (including epic ones), summoned units and turrets. The bonus is equal in all these cases.\n Courage will only grant bonus resistances from units killed by Garen himself.  Eye of the Herald and  Spoils of War of allies do not count."
    }
  },
  "skill_e": {
    "Judgment": {
      "name": "Judgment",
      "champion": "Garen",
      "skill": "E",
      "effect radius": "325",
      "cooldown": "9",
      "icon": "Judgment.png",
      "blurb": "Garen performs a dance of death with his sword, dealing damage around him for the duration and shredding the armor of enemy champions hit.",
      "description": "Active: Garen becomes  ghosted and rapidly spins his sword around his body 7 −  ∞ (based on bonus attack speed) times over 3 seconds, dealing physical damage with each spin to nearby enemies. Judgment can  critically strike for (50% +  25%) bonus physical damage.",
      "leveling": "Physical Damage Per Spin:\n4 / 8 / 12 / 16 / 20 (+ 0 −  8.2 (based on level)) (+ 32 / 34 / 36 / 38 / 40% AD)\nNearest Enemy Damage Per Spin:\n5 / 10 / 15 / 20 / 25 (+ 0 −  10.25 (based on level)) (+ 40 / 42.5 / 45 / 47.5 / 50% AD)",
      "icon2": "Judgment 3.png",
      "description2": "The nearest enemy is dealt 25% bonus damage per spin. Enemy champions hit 6 times have their  armor reduced by 25% for 6 seconds. Hits after the 6th refresh the duration of the debuff.",
      "icon3": "Judgment 2.png",
      "description3": "After 1 second, Garen can reactivate to cancel it immediately, reducing its  cooldown by its remaining duration.",
      "targeting": "Auto",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "aoedot",
      "notes": "* Each spin triggers a stack of  Conqueror.\n Silencing Garen will prevent him from deactivating the ability early.\n Judgment cancels Garen's last movement command upon ending.\n Each spin deals damage simultaneously to all enemies within its range when the spin is completed.\n The spin animation is capped at once per 0.2 seconds, but the amount of ticks will keep on scaling.\n The armor reduction stacks multiplicatively with other percentage armor penetration effects."
    }
  },
  "skill_r": {
    "Demacian Justice": {
      "name": "Demacian Justice",
      "champion": "Garen",
      "skill": "R",
      "target range": "400",
      "cooldown": "120 / 110 / 100 / 90 / 80",
      "icon": "Demacian Justice.png",
      "blurb": "The enemy champion with the most recent kills is the Villain. Garen's attacks deal additional true damage to that champion. Garen can call upon the might of Demacia to deal a finishing blow to an enemy champion that deals damage based upon how much health his target has missing. This damage is true damage against the Villain.",
      "description": "Active: Garen gains  true sight of the target champion for 1 second, dealing them  true damage after a 0.5 second delay.",
      "leveling": "True Damage:\n150 / 225 / 300 / 375 / 450 (+ 20 / 22.5 / 25 / 27.5 / 30% of target's missing health)",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "True",
      "spelleffects": "spell",
      "spellshield": "True",
      "notes": "* Demacian Justice is cancelled and does not go on  cooldown under the following circumstances:\n The target becomes  untargetable.\n The target leaves  sight range while Garen is  nearsighted.\n The target is killed.\n\n Garen can  Flash during the cast time without cancelling the ability."
    }
  }
}