{
  "id": 104,
  "apiname": "Graves",
  "title": "the Outlaw",
  "attack": 8,
  "defense": 5,
  "magic": 3,
  "difficulty": 2,
  "herotype": "Marksman",
  "resource": "Mana",
  "stats": {
    "hp_base": 555,
    "hp_lvl": 92,
    "mp_base": 325,
    "mp_lvl": 40,
    "arm_base": 33,
    "arm_lvl": 3.4,
    "mr_base": 30,
    "mr_lvl": 1,
    "hp5_base": 8,
    "hp5_lvl": 0.7,
    "mp5_base": 8,
    "mp5_lvl": 0.7,
    "dam_base": 68,
    "dam_lvl": 3,
    "as_base": 0.475,
    "as_lvl": 2.6,
    "range": 425,
    "ms": 340,
    "selection_radius": 110,
    "pathing_radius": 10,
    "as_ratio": 0.490000009536743,
    "windup_modifier": 0.100000001490116,
    "attack_delay_offset": -0.294999986886978
  },
  "fullname": "Malcolm Graves",
  "rangetype": "Ranged",
  "date": "2011-10-19",
  "patch": "V1.0.0.127",
  "changes": "V9.24b",
  "role": [
    "Specialist"
  ],
  "damage": 3,
  "toughness": 2,
  "control": 1,
  "mobility": 2,
  "utility": 2,
  "style": 20,
  "adaptivetype": "physical",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "New Destiny": {
      "name": "New Destiny",
      "champion": "Graves",
      "skill": "I",
      "angle": "35° / 52.5°",
      "icon": "New Destiny.png",
      "blurb": "Graves's shotgun holds two shells. After firing them he must reload. Each attack fires several bullets in a cone. Hitting an enemy with multiple bullets does bonus damage. These bullets cannot pass through units.",
      "description": "Innate - Double Barrel: Graves' basic attacks consume ammunition for 2 shells. He will  reload over a few seconds after expending all shells or withholding leftover shells for a while, with the time being reduced by Graves' level and  bonus attack speed.",
      "description2": "Innate - 12-Gauge: A shell sprays 4 pellets in a cone, one dealing 70% − 100% (based on level) AD  physical damage plus  a third of the damage    23.33% − 33.33% (based on level) AD damage  for each pellet beyond the first, up to a maximum of 140% − 200% (based on level) AD physical damage. Pellets deal 25% reduced damage against  turrets.",
      "description3": "Critical strikes spray 6 pellets over a 50% wider cone with each one dealing (40% +  10%) bonus physical damage.",
      "description4": "Innate - Buckshot: Pellets collide into the first enemy unit or structure they hit. Non-champion units hit by more than one pellet are  knocked back. Each pellet applies on-hit effects, but enemies are affected by them once per shell.",
      "targeting": "Passive",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "Special",
      "onhiteffects": "True",
      "occurrence": "On-hit",
      "spellshield": "False",
      "projectile": "True",
      "notes": "* Applies  basic damage to primary target and  area damage to all other targets hit by subsequent pellets.\n The in-game HUD displays Graves' reload speed in place of his attack speed. This is a visual bug, and his attack speed behaves normally.\n His reload speed is in the form of reloads per second:\n Graves' bonus attack speed growth and the cap affect his reload speed, making his bonus attack speed more worth after each level.\n Reload speed: Scales less the more attack speed you have until 150% bonus attack speed (not included growth). Going over that will decrease the reload speed until capping at 200% bonus attack speed.\n The  reload time after firing both shells and the time before reloading while sitting on one shell are the same, of 2.08 seconds. They're then reduced by bonus attack speed, to a minimum of 1.54 − 1.12 (based on level) seconds.\n Reload speed at 150% bonus attack speed: 0.651 −  0.891 (based on level).\n\n\n The reload time with one shell is 1.3 seconds.\n On-hit effects have a variety of interactions with New Destiny:\n Charge based on-hit effects like Energized or cooldown based on-hit effects like Spellblade will apply to the first target hit, and are not guaranteed to affect his attack target.\n On-Action Effects such as  Help, Pix! and  Runaan's Hurricane will be triggered, and still obey their standard target-acquisition rules. Wind's Fury can select secondary targets that are also damaged by Graves' attacks.\n  Guinsoo's Rageblade will affect all enemies hit, applying on-hit effects twice to each of them.\n  The Black Cleaver will apply 1 stack to the enemy each individual pellet hits, stacking multiple times if multiple pellets hit the same target.\n\n  Randuin's Omen's critical damage reduction will apply to every pellet.\n Given the right circumstances pellets can go around and beyond the intended target thus damaging other enemies.\n If Graves is  blinded pellets will fly (still in a cone) in a random direction (excluding his target's) but he can still damage nearby enemy units hit by pellets.\n\n Structures will intercept and be hit by multiple pellets, as with other valid targets.\n Units that take modified damage ( wards) can only be damaged by one pellet per attack and will not intercept additional ones."
    }
  },
  "skill_q": {
    "End of the Line": {
      "name": "End of the Line",
      "champion": "Graves",
      "skill": "Q",
      "target range": "925",
      "cost": "60 / 65 / 70 / 75 / 80",
      "costtype": "Mana",
      "cooldown": "13 / 12 / 11 / 10 / 9",
      "icon": "End of the Line.png",
      "blurb": "Graves fires an explosive shell that detonates after 2 seconds, or 0.2 seconds if it strikes terrain.",
      "description": "Active: Graves fires a round in the target direction that deals physical damage to all enemies it passes through and leaves behind a powder trail.",
      "leveling": "Initial Physical Damage:\n45 / 60 / 75 / 90 / 105 (+ 100% bonus AD)",
      "description2": "After 2 seconds or after 0.25 upon impacting with a structure or terrain, the round detonates dealing physical damage to all enemies in a wide perpendicular area and in a reverse wave along the powder trail.",
      "leveling2": "Detonation Damage:\n85 / 120 / 155 / 190 / 225 (+ 40 / 70 / 100 / 130 / 160% bonus AD)\nTotal Damage:\n130 / 180 / 230 / 280 / 330 (+ 140 / 170 / 200 / 230 / 260% bonus AD)",
      "targeting": "Ground / Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "spellaoe",
      "spellshield": "Special",
      "projectile": "Special",
      "notes": "*  Spell shields can only block one instance of the ability's damage.\n  Wind Wall will destroy the projectile entirely and mitigate all effects, including the trail on the ground. \n  Unbreakable is considered to be terrain for the purposes of the projectile, triggering its second effect."
    }
  },
  "skill_w": {
    "Smoke Screen": {
      "name": "Smoke Screen",
      "champion": "Graves",
      "skill": "W",
      "target range": "950",
      "effect radius": "250",
      "cost": "70 / 75 / 80 / 85 / 90",
      "costtype": "Mana",
      "cooldown": "26 / 24 / 22 / 20 / 18",
      "icon": "Smoke Screen.png",
      "blurb": "Graves fires a smoke canister at the target area creating a cloud of smoke. Enemies inside the smoke cloud have reduced sight range and Movement Speed.",
      "description": "Active: After a 0.15-second delay, Graves fires a smoke canister at the target area, dealing magic damage and  slowing enemies upon impact by 50% for 0.5 seconds.",
      "leveling": "Magic Damage:\n60 / 110 / 160 / 210 / 260 (+ 60% AP)",
      "description2": "The canister creates a cloud of smoke for 4 seconds that applies  nearsight of outside the area to all enemies within.",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "Special",
      "projectile": "true",
      "notes": "*  Spell shields will block the instance of damage, but will not mitigate the persistent  area of effect.\n Despite being classified as crowd control for the purposes of Quicksilver, crowd control immunity will not resist  nearsight."
    }
  },
  "skill_e": {
    "Quickdraw": {
      "name": "Quickdraw",
      "champion": "Graves",
      "skill": "E",
      "target range": "425",
      "cost": "40",
      "costtype": "Mana",
      "cooldown": "16 / 15 / 14 / 13 / 12",
      "icon": "Quickdraw.png",
      "blurb": "Graves dashes forward gaining an Armor boost for several seconds. If Graves dashes towards an enemy champion, gain two stacks of True Grit instead. Hitting enemies with basic attacks lowers the cooldown of this skill and refreshes the resistance boost.",
      "description": "Active: Graves  dashes in the target direction, resetting his basic attack timer and reloading one shell while gaining a stack of True Grit for 4 seconds, stacking up to 8 times. Dashing towards an enemy grants 2 stacks of True Grit.",
      "description2": "Quickdraw's  cooldown is reduced by 0.5 seconds for every pellet impacting an enemy.",
      "description3": "True Grit: Graves gains  bonus armor. Attacks versus non-minions will refresh the duration of True Grit.",
      "leveling3": "Bonus Armor:\n8 / 11 / 14 / 17 / 20\nMaximum Armor:\n64 / 88 / 112 / 136 / 160",
      "targeting": "Direction",
      "affects": "Self",
      "notes": "* No additional details."
    }
  },
  "skill_r": {
    "Collateral Damage": {
      "name": "Collateral Damage",
      "champion": "Graves",
      "skill": "R",
      "target range": "1000",
      "effect radius": "800",
      "angle": "80°",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "120 / 105 / 90 / 75 / 60",
      "icon": "Collateral Damage.png",
      "blurb": "Graves fires an explosive shell dealing heavy damage to the first champion it hits. After hitting a champion or reaching the end of its range, the shell explodes dealing damage in a cone.",
      "description": "Active: Graves fires an explosive shell in the target direction which deals physical damage while also  recoiling in the opposite direction.",
      "leveling": "Physical Damage:\n250 / 325 / 400 / 475 / 550 (+ 150% bonus AD)\nExplosion Physical Damage:\n200 / 260 / 320 / 380 / 440 (+ 120% bonus AD)",
      "description2": "After hitting a champion or reaching the end of its range, the shell explodes to deal 80% of its original damage in a cone. The same unit cannot be damaged by both the shell and the explosion.",
      "targeting": "Direction",
      "affects": "Enemies / Self",
      "damagetype": "Physical",
      "spelleffects": "Special",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Applies  spell damage to the target hit by the shell and  area damage to targets within the explosion."
    }
  }
}