{
  "id": 420,
  "key": "Illaoi",
  "name": "Illaoi",
  "title": "the Kraken Priestess",
  "fullName": "",
  "resource": "MANA",
  "attackType": "MELEE",
  "adaptiveType": "PHYSICAL_DAMAGE",
  "stats": {
    "healthBase": 585.6,
    "healthPerLevel": 95,
    "healthPer5SecondsBase": 9.5,
    "healthPer5SecondsPerLevel": 0.8,
    "manaBase": 300,
    "manaPerLevel": 40,
    "manaPer5SecondsBase": 7.5,
    "manaPer5SecondsPerLevel": 0.75,
    "armorBase": 35,
    "armorPerLevel": 3.8,
    "magicResistanceBase": 32.1,
    "magicResistancePerLevel": 1.25,
    "attackDamageBase": 68,
    "attackDamagePerLevel": 5,
    "movespeed": 340,
    "acquisitionRadius": 600,
    "selectionRadius": 100,
    "pathingRadius": 35,
    "gameplayRadius": 65,
    "criticalStrikeBase": 200,
    "criticalStrikeModifier": 1.0,
    "attackSpeedBase": 0.571,
    "attackSpeedPerLevel": 2.5,
    "attackSpeedRatio": 0.570999979972839,
    "attackCastTime": 0.375,
    "attackTotalTime": 1.75,
    "attackDelayOffset": 0,
    "attackRangeBase": 125,
    "attackRangePerLevel": 0,
    "aramDamageTaken": 1.05,
    "aramDamageDealt": 0.95,
    "aramHealing": 1.0,
    "aramShielding": 1.0,
    "urfDamageTaken": 1.0,
    "urfDamageDealt": 1.05,
    "urfHealing": 1.0,
    "urfShielding": 1.0
  },
  "roles": [
    "TANK",
    "FIGHTER",
    "JUGGERNAUT"
  ],
  "attributeRatings": {
    "damage": 3,
    "toughness": 2,
    "control": 1,
    "mobility": 1,
    "utility": 1,
    "abilityReliance": 65,
    "attack": 8,
    "defense": 6,
    "magic": 3,
    "difficulty": 2
  },
  "abilities": {
    "I": [
      {
        "name": "Prophet of an Elder God",
        "effects": [
          {
            "description": "Innate: Periodically, Illaoi spawns a Tentacle on a nearby impassable terrain if no other Tentacles are nearby. Tentacles fully spawn after a 2 second delay and are  untargetable in the meantime.",
            "icon": "Prophet of an Elder God.png",
            "leveling": []
          },
          {
            "description": "Tentacles deal 10 − 180 (based on level) (+ 120% AD) (+ 40% AP)  physical damage to all enemies struck when commanded to attack by her abilities. Each Tentacle also  heals Illaoi for 5% missing health if it hits at least one enemy  champion. See Pet Details for more details.",
            "icon": null,
            "leveling": []
          }
        ],
        "cost": null,
        "cooldown": {
          "modifiers": [
            {
              "values": [
                20.0,
                19.529411764705884,
                19.058823529411764,
                18.58823529411765,
                18.11764705882353,
                17.647058823529413,
                17.176470588235293,
                16.705882352941178,
                16.235294117647058,
                15.764705882352942,
                15.294117647058822,
                14.823529411764707,
                14.352941176470589,
                13.882352941176471,
                13.411764705882353,
                12.941176470588236,
                12.470588235294118,
                12.0
              ],
              "units": [
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": true
        },
        "targeting": "Passive",
        "affects": "Enemies",
        "spellshieldable": "Special",
        "resource": null,
        "damageType": "PHYSICAL_DAMAGE",
        "spellEffects": "Area of effect",
        "projectile": "FALSE",
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Tentacles do not spawn in the Nexus Obelisk's attack range and on ally invulnerable  structures.\n Impassable terrain also includes player-made terrain and terrain that is passable by a team but not by the other, for example base gates.\n The Tentacle will continue its spawn animation and be able to start an attack, after the animation ends, even if Illaoi or a Vessel are not nearby.\n If Illaoi uses  Harsh Lesson during Tentacles' spawn animation, they won't attack but the SFX of the attack will still be heard.\n If this happens, after the Tentacle finishes its spawn animation, it will be unable to start an attack for its remaining attack SFX.",
        "blurb": "Illaoi and the Vessels she creates spawn Tentacles on nearby impassible terrain. Tentacles swing at spirits, Vessels, and victims of Illaoi's Harsh lesson. Tentacles deal physical damage to enemies hit, and will heal Illaoi if they damage a champion.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": null,
        "angle": null,
        "castTime": null,
        "effectRadius": "1000",
        "targetRange": null
      }
    ],
    "Q": [
      {
        "name": "Tentacle Smash",
        "effects": [
          {
            "description": "Passive: Tentacles deal increased damage.",
            "icon": "false",
            "leveling": [
              {
                "attribute": "Damage Increase",
                "modifiers": [
                  {
                    "values": [
                      10,
                      15,
                      20,
                      25,
                      30
                    ],
                    "units": [
                      "%",
                      "%",
                      "%",
                      "%",
                      "%"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "Active: Illaoi slams her idol into the ground, summoning a Tentacle that slams down in the target direction, dealing physical damage before disappearing.",
            "icon": "Tentacle Smash.png",
            "leveling": []
          }
        ],
        "cost": {
          "modifiers": [
            {
              "values": [
                40,
                45,
                50,
                55,
                60
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        },
        "cooldown": {
          "modifiers": [
            {
              "values": [
                10,
                9,
                8,
                7,
                6
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": false
        },
        "targeting": "Direction",
        "affects": "Enemies",
        "spellshieldable": "True",
        "resource": "MANA",
        "damageType": "PHYSICAL_DAMAGE",
        "spellEffects": "Area of effect",
        "projectile": "FALSE",
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Getting  displaced during the cast time will not change the indicator on the ground, but it will change the damaged area, while still being directed towards the previous pointed location.\n If Illaoi is not  visible, the slam will be seen but it will not be heard.",
        "blurb": "Increases the damage dealt by Tentacles. When activated, Illaoi smashes down a Tentacle that deals physical damage.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": "210",
        "angle": null,
        "castTime": "0.75",
        "effectRadius": null,
        "targetRange": "825"
      }
    ],
    "W": [
      {
        "name": "Harsh Lesson",
        "effects": [
          {
            "description": "Active: Illaoi's next basic attack within 6 seconds gains  225 bonus range and causes her to  leap to her target if they're beyond her normal basic attack range.",
            "icon": "Harsh Lesson.png",
            "leveling": []
          },
          {
            "description": "The attack deals bonus physical damage, with a minimum threshold, and capped at 300 against non-champions, and commands all Tentacles in range to attack her target. The minimum bonus damage can also be applied against  turrets.",
            "icon": null,
            "leveling": [
              {
                "attribute": "Bonus Physical Damage",
                "modifiers": [
                  {
                    "values": [
                      3,
                      3.5,
                      4,
                      4.5,
                      5
                    ],
                    "units": [
                      "%  of target's maximum health",
                      "%  of target's maximum health",
                      "%  of target's maximum health",
                      "%  of target's maximum health",
                      "%  of target's maximum health"
                    ]
                  },
                  {
                    "values": [
                      2,
                      2,
                      2,
                      2,
                      2
                    ],
                    "units": [
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD"
                    ]
                  }
                ]
              },
              {
                "attribute": "Minimum Physical Damage",
                "modifiers": [
                  {
                    "values": [
                      20,
                      30,
                      40,
                      50,
                      60
                    ],
                    "units": [
                      "",
                      "",
                      "",
                      "",
                      ""
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "Harsh Lesson resets Illaoi's basic attack timer.",
            "icon": null,
            "leveling": []
          }
        ],
        "cost": {
          "modifiers": [
            {
              "values": [
                30,
                30,
                30,
                30,
                30
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        },
        "cooldown": {
          "modifiers": [
            {
              "values": [
                4,
                4,
                4,
                4,
                4
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": false
        },
        "targeting": "none",
        "affects": null,
        "spellshieldable": "Special",
        "resource": "MANA",
        "damageType": "PHYSICAL_DAMAGE",
        "spellEffects": "spell",
        "projectile": null,
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Since the attack applies both on-hit effects and spell effects it will trigger  Muramana twice.\n The bonus damage doesn't apply lifesteal healing but it does apply  spell vamp.\n Harsh Lesson is made of two different abilities which are decided by Illaoi's range to the target, being either melee or within dash range.\n The close range ability:\n Is  unstoppable, meaning no effect can interrupt it other than death - either Illaoi's or the target's. Using  Flash or going into  stasis (i.e  Zhonya's Hourglass,  Guardian Angel) will cancel the animation but the attack will still land.\n Can be used while  grounded or  rooted. If Illaoi attack commands and then casts Harsh Lesson, she will use the close range Harsh Lesson even if the target is beyond her melee range.\n Starting the attack before triggering  Guardian Angel's passive and hitting while she's in it will not cause the Tentacles to slam.\n Starting the attack before the target becomes  untargetable will still cause the Tentacles to slam the target.\n Does trigger  Hail of Blades.\n Triggers  Energized effects on-hit.\n Using it at the same time with  Ravenous Hydra will perform an unusual dunk.\n If the empowered attack duration ends during the attack animation, the attack won't be empowered.\n\n The dash range ability:\n Is not unstoppable, meaning that effects can interrupt it during the dash and put it cooldown.  Flash and  Zhonya's Hourglass cannot be used during the dash.\n Cannot be used while  grounded or  rooted.\n Starting the attack before the target becomes  untargetable will not make Tentacles slam.\n Does not trigger  Hail of Blades.\n Triggers  Energized effects on-jump.\n Having enough attack speed will perform an unusual dunk.\n Having increased size will increase the range of her Harsh Lesson but the indicator range will not change.\n If the empowered attack duration ends during the dash, the buff will linger until the attack has finished.\n\n  Spell shields will block the bonus damage but will not prevent the Tentacle slam, unless a dash range Harsh Lesson has been used, in which case the bonus damage is not blocked but the spell shield is still consumed.\n Parries ( Counter Strike,  Spirit's Refuge,  Blinding Dart) will block the damage and will not trigger  Tentacle slams, with the exception of:\n  Spirit's Refuge when using a close range Harsh Lesson, which triggers  Tentacle slams.\n  Blinding Dart when using a dash range Harsh Lesson, which triggers  Tentacle slams.\n\n If the target dies at the moment Harsh Lesson hits the target, it will be consumed and put on cooldown, without making Tentacles slam.\n The Tentacle attacking because of Harsh Lesson is considered to be part of it, and thus will not grant additional stacks of  Conqueror,  Electrocute,  Phase Rush and Tribute.\n Using it together with  Dead Man's Plate will grant an additional stack of  Conqueror.\n Harsh Lesson's bonus damage applies before  Blade of the Ruined King's damage.\n Harsh Lesson triggers  Bone Plating and one of its plates with the same attack.\n Attack moving while charging  Hexflash will delay the attack.",
        "blurb": "Illaoi leaps to her target, dealing physical damage and causing nearby Tentacles to also swing at the target.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": null,
        "angle": null,
        "castTime": null,
        "effectRadius": null,
        "targetRange": null
      }
    ],
    "E": [
      {
        "name": "Test of Spirit",
        "effects": [
          {
            "description": "Active: Illaoi fires a projectile in the target direction, stopping at the first enemy hit. If the enemy is a  champion, their Spirit is pulled in front of Illaoi over 0.75 seconds. The target is tethered to the Spirit for 7 seconds, and is  revealed while the tether remains.",
            "icon": "Test of Spirit.png",
            "leveling": []
          },
          {
            "description": "The Spirit has the target's  current health,  armor and  magic resist, and redirects a portion of the pre-mitigation damage received to the tethered champion.",
            "icon": null,
            "leveling": [
              {
                "attribute": "Damage Transmission",
                "modifiers": [
                  {
                    "values": [
                      25,
                      30,
                      35,
                      40,
                      45
                    ],
                    "units": [
                      "%",
                      "%",
                      "%",
                      "%",
                      "%"
                    ]
                  },
                  {
                    "values": [
                      8,
                      8,
                      8,
                      8,
                      8
                    ],
                    "units": [
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "When the Spirit is killed or the target moves too far away, the tether is severed, marking the target as a Vessel for 10 seconds,  revealing the area around them for a few seconds, and  slowing them by 80% for 1.5 seconds once the tether returns back to them. Each Tentacle autonomously attacks the closest Vessel or Spirit once every 5.5 / 4.5 / 3.5 (based on level) seconds.",
            "icon": null,
            "leveling": []
          },
          {
            "description": "Vessel: Enemies made a Vessel spawn a Tentacle near themselves every 5 / 4 / 3 (based on level) seconds, They can rid themselves of the the debuff by  taking down Illaoi. Tentacles can spawn exceptionally closer to each other than when spawned by Illaoi.",
            "icon": "Vessel.png",
            "leveling": []
          }
        ],
        "cost": {
          "modifiers": [
            {
              "values": [
                35,
                40,
                45,
                50,
                55
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        },
        "cooldown": {
          "modifiers": [
            {
              "values": [
                16,
                15,
                14,
                13,
                12
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": false
        },
        "targeting": "Direction",
        "affects": "Enemies",
        "spellshieldable": "Special",
        "resource": "MANA",
        "damageType": "MIXED_DAMAGE",
        "spellEffects": null,
        "projectile": "TRUE",
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Spirits are classified as Decoys.\n Spirits can only be targeted by Illaoi's team and neutral monsters. The Spirit's allies cannot target it.\n Spirits take 50% damage from turrets and do not cause turrets to  Warm Up their attacks.\n Spirits cannot be  healed or  shielded ( Summon Aery excluded).\n The Spirit levels up when the Vessel does. Doing so will increase the Spirit's health, armor, and magic resist, and additionally extend its lifetime by 1 second.\n Killing the Spirit awards  25 and  44.\n\n Redirected damage is calculated by taking the premitigation damage, applying Test of Spirit's damage modifier, and then capping it to the Spirit's current health. This damage will then be affected by damage modifiers (resistances and other effects) of the Vessel.\n If the Spirit's damage modifier is lower than Test of Spirit's, it will cause a reduction in total redirected damage, else it will cause an increase.\n If the Spirit's damage modifier is lower than the Vessel's, it will cause an increase in total redirected damage, else it will cause a decrease.\n Illaoi needs 937.5 / 875 / 812.5 / 750 / 687.5 total AD to reach 100% redirected damage. As per above, the damage is still dependent on the Spirit's and Vessel's damage modifiers and may not always be able to deal 100% of the target's current health as total redirected damage.\n The damage displayed as being received by the Spirit is not representative of the damage redirected to the Vessel, as the combat text shown adjacent to the Spirit uses the Spirit's resistances.\n\n  Spell shields may only prevent the initial spirit grab and the slow upon becoming a Vessel. Spell shields will not prevent becoming a Vessel or Tentacles from attacking.\n The spirit pull is not considered a  crowd control effect and will not be blocked by cc-immune effects, with the exception of  Morgana's  Black Shield.\n If the target becomes a Vessel within range of a dormant Tentacle, that Tentacle will skip its first attack.\n The tentacle model of the first cast is connected to Illaoi's body and will stop moving when Illaoi does (e.g  stasis,  sleep,  airborne). However, the projectile will not, and will be able to hit enemies away from its model position. It will also not be seen by enemies if Illaoi is not  visible, but it will be heard if the tentacle passes through their vision. \n Using  Flash during the cast time will change Illaoi's position but the tentacle will still be directed towards the previous pointed location.\n Grabbing the Spirit of a champion that has their resource bar white (i.e  Flow) will make the Spirit's lifetime (the white bar below the lifebar) disappear.\n Grabbing the Spirit of a target that is  camouflaged while there’s a control ward revealing them will make the Spirit invisible.\n Only Illaoi can see who's been Vesseled, with their model covered in watery effects. The Vessel itself will instead have its screen covered in watery effects.\n If the enemy champion is reviving when the conditions for becoming a Vessel are met, then they will not revive as a Vessel.\n Runes consider the Spirit as a champion for their effects and stat-tracking.\n  Predator only reflects double bonus damage, not taking into account actual damage done to the Spirit (e.g if  Predator would deal 60 bonus damage, what would get reflected is 120 damage).\n\n Transferred damage will apply on-damage effects, such as  The Black Cleaver,  Morellonomicon,  Executioner's Calling,  Aspect of the Dragon burn damage and the healing from  Death's Dance or  Hextech Gunblade.\n Transferred damage will not doubly apply on-hit or on-spell effects versus the target (e.g.  Liandry's Torment,  Phase Rush stacks). These effects are only applied versus the Spirit.\n Attacking the Vessel and its Spirit simultaneously will only apply one  The Black Cleaver to the Vessel.\n\n Once the Spirit vanishes, whether defeated or not, Illaoi will get  Rage's full movement speed bonus and 1 creep score in-game (not included in the post-game counter).\n The Spirit is immune to  stasis (i.e.  Bard's  Tempered Fate).\n  Fiora's  Riposte can be used to prevent becoming a Vessel if used before the Spirit is killed or while leaving the tether's range.\n  Sion's Spirit cannot be spawned during  Glory in Death. Spirits created before Sion's undeath will remain active.",
        "blurb": "Illaoi rips the spirit from a foe's body, forcing it to stand before her. Spirits echo a percentage of the damage they take to the original target. If killed, or if the target gets too far from the spirit, the target will become a Vessel and begin spawning Tentacles.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": "1500",
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": "1900",
        "width": "100",
        "angle": null,
        "castTime": "0.25",
        "effectRadius": null,
        "targetRange": "900"
      },
      {
        "name": "Test of Spirit",
        "effects": [
          {
            "description": "Active: Illaoi fires a projectile in the target direction, stopping at the first enemy hit. If the enemy is a  champion, their Spirit is pulled in front of Illaoi over 0.75 seconds. The target is tethered to the Spirit for 7 seconds, and is  revealed while the tether remains.",
            "icon": "Test of Spirit.png",
            "leveling": []
          },
          {
            "description": "The Spirit has the target's  current health,  armor and  magic resist, and redirects a portion of the pre-mitigation damage received to the tethered champion.",
            "icon": null,
            "leveling": [
              {
                "attribute": "Damage Transmission",
                "modifiers": [
                  {
                    "values": [
                      25,
                      30,
                      35,
                      40,
                      45
                    ],
                    "units": [
                      "%",
                      "%",
                      "%",
                      "%",
                      "%"
                    ]
                  },
                  {
                    "values": [
                      8,
                      8,
                      8,
                      8,
                      8
                    ],
                    "units": [
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD",
                      "% per 100 AD"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "When the Spirit is killed or the target moves too far away, the tether is severed, marking the target as a Vessel for 10 seconds,  revealing the area around them for a few seconds, and  slowing them by 80% for 1.5 seconds once the tether returns back to them. Each Tentacle autonomously attacks the closest Vessel or Spirit once every 5.5 / 4.5 / 3.5 (based on level) seconds.",
            "icon": null,
            "leveling": []
          },
          {
            "description": "Vessel: Enemies made a Vessel spawn a Tentacle near themselves every 5 / 4 / 3 (based on level) seconds, They can rid themselves of the the debuff by  taking down Illaoi. Tentacles can spawn exceptionally closer to each other than when spawned by Illaoi.",
            "icon": "Vessel.png",
            "leveling": []
          }
        ],
        "cost": {
          "modifiers": [
            {
              "values": [
                35,
                40,
                45,
                50,
                55
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        },
        "cooldown": {
          "modifiers": [
            {
              "values": [
                16,
                15,
                14,
                13,
                12
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": false
        },
        "targeting": "Direction",
        "affects": "Enemies",
        "spellshieldable": "Special",
        "resource": "MANA",
        "damageType": "MIXED_DAMAGE",
        "spellEffects": null,
        "projectile": "TRUE",
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Spirits are classified as Decoys.\n Spirits can only be targeted by Illaoi's team and neutral monsters. The Spirit's allies cannot target it.\n Spirits take 50% damage from turrets and do not cause turrets to  Warm Up their attacks.\n Spirits cannot be  healed or  shielded ( Summon Aery excluded).\n The Spirit levels up when the Vessel does. Doing so will increase the Spirit's health, armor, and magic resist, and additionally extend its lifetime by 1 second.\n Killing the Spirit awards  25 and  44.\n\n Redirected damage is calculated by taking the premitigation damage, applying Test of Spirit's damage modifier, and then capping it to the Spirit's current health. This damage will then be affected by damage modifiers (resistances and other effects) of the Vessel.\n If the Spirit's damage modifier is lower than Test of Spirit's, it will cause a reduction in total redirected damage, else it will cause an increase.\n If the Spirit's damage modifier is lower than the Vessel's, it will cause an increase in total redirected damage, else it will cause a decrease.\n Illaoi needs 937.5 / 875 / 812.5 / 750 / 687.5 total AD to reach 100% redirected damage. As per above, the damage is still dependent on the Spirit's and Vessel's damage modifiers and may not always be able to deal 100% of the target's current health as total redirected damage.\n The damage displayed as being received by the Spirit is not representative of the damage redirected to the Vessel, as the combat text shown adjacent to the Spirit uses the Spirit's resistances.\n\n  Spell shields may only prevent the initial spirit grab and the slow upon becoming a Vessel. Spell shields will not prevent becoming a Vessel or Tentacles from attacking.\n The spirit pull is not considered a  crowd control effect and will not be blocked by cc-immune effects, with the exception of  Morgana's  Black Shield.\n If the target becomes a Vessel within range of a dormant Tentacle, that Tentacle will skip its first attack.\n The tentacle model of the first cast is connected to Illaoi's body and will stop moving when Illaoi does (e.g  stasis,  sleep,  airborne). However, the projectile will not, and will be able to hit enemies away from its model position. It will also not be seen by enemies if Illaoi is not  visible, but it will be heard if the tentacle passes through their vision. \n Using  Flash during the cast time will change Illaoi's position but the tentacle will still be directed towards the previous pointed location.\n Grabbing the Spirit of a champion that has their resource bar white (i.e  Flow) will make the Spirit's lifetime (the white bar below the lifebar) disappear.\n Grabbing the Spirit of a target that is  camouflaged while there’s a control ward revealing them will make the Spirit invisible.\n Only Illaoi can see who's been Vesseled, with their model covered in watery effects. The Vessel itself will instead have its screen covered in watery effects.\n If the enemy champion is reviving when the conditions for becoming a Vessel are met, then they will not revive as a Vessel.\n Runes consider the Spirit as a champion for their effects and stat-tracking.\n  Predator only reflects double bonus damage, not taking into account actual damage done to the Spirit (e.g if  Predator would deal 60 bonus damage, what would get reflected is 120 damage).\n\n Transferred damage will apply on-damage effects, such as  The Black Cleaver,  Morellonomicon,  Executioner's Calling,  Aspect of the Dragon burn damage and the healing from  Death's Dance or  Hextech Gunblade.\n Transferred damage will not doubly apply on-hit or on-spell effects versus the target (e.g.  Liandry's Torment,  Phase Rush stacks). These effects are only applied versus the Spirit.\n Attacking the Vessel and its Spirit simultaneously will only apply one  The Black Cleaver to the Vessel.\n\n Once the Spirit vanishes, whether defeated or not, Illaoi will get  Rage's full movement speed bonus and 1 creep score in-game (not included in the post-game counter).\n The Spirit is immune to  stasis (i.e.  Bard's  Tempered Fate).\n  Fiora's  Riposte can be used to prevent becoming a Vessel if used before the Spirit is killed or while leaving the tether's range.\n  Sion's Spirit cannot be spawned during  Glory in Death. Spirits created before Sion's undeath will remain active.",
        "blurb": "Illaoi rips the spirit from a foe's body, forcing it to stand before her. Spirits echo a percentage of the damage they take to the original target. If killed, or if the target gets too far from the spirit, the target will become a Vessel and begin spawning Tentacles.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": "1500",
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": "1900",
        "width": "100",
        "angle": null,
        "castTime": "0.25",
        "effectRadius": null,
        "targetRange": "900"
      }
    ],
    "R": [
      {
        "name": "Leap of Faith",
        "effects": [
          {
            "description": "Active: Illaoi leaps into the air  unstoppably before slamming her idol into the ground, dealing physical damage to nearby enemies. For each enemy champion hit, a Tentacle is summoned for 8 seconds (up to a maximum of 6 summons).",
            "icon": "Leap of Faith.png",
            "leveling": [
              {
                "attribute": "Physical Damage",
                "modifiers": [
                  {
                    "values": [
                      150,
                      250,
                      350
                    ],
                    "units": [
                      "",
                      "",
                      ""
                    ]
                  },
                  {
                    "values": [
                      50,
                      50,
                      50
                    ],
                    "units": [
                      "% bonus AD",
                      "% bonus AD",
                      "% bonus AD"
                    ]
                  }
                ]
              }
            ]
          },
          {
            "description": "For the duration,  Harsh Lesson's  cooldown is halved, all Tentacles awakened by Illaoi are  untargetable, will not show their hitboxes, nor go dormant, and will take half the amount of time to make an attack.",
            "icon": null,
            "leveling": []
          }
        ],
        "cost": {
          "modifiers": [
            {
              "values": [
                100,
                100,
                100
              ],
              "units": [
                "",
                "",
                ""
              ]
            }
          ]
        },
        "cooldown": {
          "modifiers": [
            {
              "values": [
                120,
                95,
                70
              ],
              "units": [
                "",
                "",
                ""
              ]
            }
          ],
          "affectedByCdr": false
        },
        "targeting": "Auto",
        "affects": "Enemies",
        "spellshieldable": "Special",
        "resource": "MANA",
        "damageType": "PHYSICAL_DAMAGE",
        "spellEffects": "spellaoe",
        "projectile": null,
        "onHitEffects": null,
        "occurrence": null,
        "notes": "Illaoi is immune to  stasis while in her cast animation.\n  Flash can be used during the cast time, with the ability being used at the new location.\n Decoys also count as champions for the  Tentacle summoning.\n Illaoi spawns the  Tentacle 725 range away from her, unless there's a natural wall blocking the way making the Tentacle spawn on it, based on:\n The direction she's facing.\n She will always face at the nearest  visible enemy champion, in Leap of Faith's range, the instant she leaps.\n If there's no enemy champion nearby, she faces in the direction of the cursor.\n  Flashing mid-animation will change the spawning direction to where the cursor is pointed, regardless of the nearest enemy champion.\n\n How many champions she hits.\n 1+ champions: one  Tentacle at 0 degrees.\n 2+ champions: one  Tentacle at 60 degrees.\n 3+ champions: one  Tentacle at 300 degrees.\n 4+ champions: one  Tentacle at 120 degrees.\n 5+ champions: one  Tentacle at 240 degrees.\n 6+ champions: one  Tentacle at 180 degrees.\n\n If there're no walls nearby, spawning the last  Tentacle will form a perfect hexagon.\n\n  Spell shields will block the ability's damage but will not prevent Tentacles from spawning.\n Activating  Guardian Angel during the leap will not stop the ability from doing damage or spawn Tentacles.\n Using  Harsh Lesson after Illaoi drops down will command Tentacles to instantly attack, regardless if they were already attacking. Their old attack will keep on going and will hit while the second attack is on its animation attack.\n Using  Harsh Lesson an instant before Leap of Faith's buff finishes will delay the Tentacle's attack.",
        "blurb": "Illaoi smashes her idol into the ground, dealing physical damage to nearby enemies. A Tentacle spawns for each enemy champion hit.",
        "missileSpeed": null,
        "rechargeRate": null,
        "collisionRadius": null,
        "tetherRadius": null,
        "onTargetCdStatic": null,
        "innerRadius": null,
        "speed": null,
        "width": null,
        "angle": null,
        "castTime": "0.5",
        "effectRadius": "450",
        "targetRange": null
      }
    ]
  },
  "releaseDate": "2015-11-24",
  "releasePatch": "5.23",
  "patchLastChanged": "10.3",
  "price": {
    "blueEssence": 6300,
    "rp": 975
  }
}