{
  "id": 427,
  "apiname": "Ivern",
  "title": "the Green Father",
  "attack": 3,
  "defense": 5,
  "magic": 7,
  "difficulty": 3,
  "herotype": "Support",
  "alttype": "Mage",
  "resource": "Mana",
  "stats": {
    "hp_base": 585,
    "hp_lvl": 95,
    "mp_base": 450,
    "mp_lvl": 60,
    "arm_base": 27,
    "arm_lvl": 3.5,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 7,
    "hp5_lvl": 0.85,
    "mp5_base": 6,
    "mp5_lvl": 0.75,
    "dam_base": 50,
    "dam_lvl": 3,
    "as_base": 0.644,
    "as_lvl": 3.4,
    "range": 475,
    "ms": 330,
    "selection_radius": 140,
    "pathing_radius": 40,
    "gameplay_radius": 70,
    "as_ratio": 0.643999993801116,
    "attack_delay_offset": -0.0700000002980232,
    "urf_dmg_dealt": 1.1,
    "urf_dmg_taken": 0.9
  },
  "fullname": "Ivern Bramblefoot",
  "rangetype": "Ranged",
  "date": "2016-10-05",
  "patch": "V6.20",
  "changes": "V9.22",
  "role": [
    "Catcher"
  ],
  "damage": 1,
  "toughness": 1,
  "control": 3,
  "mobility": 2,
  "utility": 3,
  "style": 10,
  "adaptivetype": "magic",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "Friend of the Forest": {
      "name": "Friend of the Forest",
      "champion": "Ivern",
      "skill": "I",
      "icon": "Friend of the Forest.png",
      "blurb": "Ivern cannot attack or be attacked by non-epic monsters. Ivern can create magical groves on jungle camps which grow over time. When the grove is fully grown, Ivern may free the monsters to receive gold and experience. After level 5 Ivern can share jungle buffs with allies.",
      "description": "Innate: Ivern cannot attack or damage non-epic monsters. Instead, targeting a jungle camp initiates a 2.5 seconds channel that, upon completion, places the monsters within a grove. Placing a grove costs  131.63 − 121 (based on level) health and  148.5 − 110.25 (based on level) mana, and cannot be cast if Ivern lacks the resources. The channel cannot be cancelled in the first 0.15 seconds and in the last 0.5 seconds.",
      "description2": "The grove matures over 40 − 1 (based on level) seconds. When fully matured, Ivern can interact with the camp again to free the monsters after 0.5 seconds, sending them away while receiving their  full gold and  full experience bounties.  Smiting a large monster within a grove will instantly free the camp's monsters, regardless of its maturity or the monsters' current health.",
      "description3": "If the camp's large monster has already been slain, Ivern will free the camp upon completing the channel at no cost. Similarly, the grove will instantly mature if the large monster is slain.",
      "description4": "Starting at level 5, freeing the  Red Brambleback or the  Blue Sentinel leaves behind a sapling for 1 minute that can be picked up by an allied champion to gain the camp's buff, consuming it in the process. If at least one allied champion is nearby, Ivern can pick up the sapling to transfer it to the nearest one in range. If an ally kills either monster, they also leave behind a sapling that only Ivern can consume.",
      "targeting": "Passive / Unit",
      "affects": "Monsters",
      "damagetype": "Pure",
      "notes": "* Freeing a  Krugs camp will only give the  gold and  experience of the present Krugs, i.e the  Ancient Krug and a Medium  Krug, for a total of  70 − 87.5 (based on monster's level) experience instead of 160 − 200 (based on monster's level), and  75 gold instead of  125.\n Friend of the Forest can be used while Ivern or the camp is in combat and, once the grove is placed,  Smite can be used to instantly claim the camp. Interrupting the channel or killing Ivern is the only way to contest jungle camps, short of killing the camp during the channel time.\n  If the large monster in a camp is still alive, Ivern must gain vision of it to use Friend of the Forest on that camp.\n If the large monster in a camp is still alive, Ivern will walk towards it to use Friend of the Forest. Attempting to use Friend of the Forest on the camp’s smaller monster will not change the total distance that Ivern walks.\n Friend of the Forest will leave Ivern at 1 current health if cast with exactly the required amount. Friend of the Forest cannot be cast with less, unlike other abilities with health costs.\n Non-epic monsters turned hostile by an allied or an enemy champion will still attack Ivern if he is the closest target (he is not immune to monster damage) yet he still cannot return fire if so (despite not being the one turning the monsters hostile)\n  Daisy also cannot attack non-epic monsters.\n Monsters are not hurt nor do they become hostile by Ivern when he is equipped with an item that has the Immolate effect.\n In Nexus Blitz, Friend of the Forest will not affect monsters. Ivern becomes hostile with them."
    }
  },
  "skill_q": {
    "Rootcaller": {
      "name": "Rootcaller",
      "champion": "Ivern",
      "skill": "Q",
      "target range": "1100",
      "width": "150",
      "speed": "1300",
      "cast time": "0.25",
      "cost": "60",
      "costtype": "Mana",
      "cooldown": "14 / 13 / 12 / 11 / 10",
      "icon": "Rootcaller.png",
      "blurb": "Ivern conjures a vine, dealing damage and rooting enemy targets hit. Ivern's allies can dash to the rooted target.",
      "description": "Active: Ivern throws a vine in the target direction, dealing  magic damage to the first enemy hit and  rooting them for a short duration.",
      "leveling": "Magic Damage:\n80 / 125 / 170 / 215 / 260 (+ 70% AP)\nRoot Duration:\n1.2 / 1.4 / 1.6 / 1.8 / 2",
      "description2": "Ivern and his allies can target enemies  rooted by Rootcaller to  dash to them, with allies stopping at  their attack range and Ivern stopping at  125 range from the target.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Single target",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Rootcaller can hit monsters and allow Ivern to dash to them although it won't deal damage.\n Ivern can also recast this ability to dash to targets.\n Ivern's pull/attack range is determined when he dashes to the target -- not from when he initially casts Rootcaller and throws the vine.\n Ivern (and allies?) are not able to dash to the target unless they are within approximately 1200 range."
    }
  },
  "skill_w": {
    "Brushmaker": {
      "name": "Brushmaker",
      "champion": "Ivern",
      "skill": "W",
      "target range": "1000",
      "cost": "30",
      "costtype": "Mana",
      "static": "0.5",
      "recharge": "40 / 36 / 32 / 28 / 24",
      "icon": "Brushmaker.png",
      "blurb": "In brush, Ivern's attacks are ranged and deal bonus magic damage. Ivern can activate this ability to create a patch of brush.",
      "description": "Passive: While in  brush, Ivern's basic attacks deal bonus magic damage. This bonus persists for 3 seconds after leaving brush.",
      "leveling": "Bonus Magic Damage:\n30 / 37.5 / 45 / 52.5 / 60 (+ 30% AP)",
      "description2": "Ivern periodically stocks a Brushmaker charge, up to a maximum of 3.",
      "description3": "Active: Ivern grows a patch of brush at the target location for 30 seconds,  revealing the area within and around it for 3 seconds. Brushmaker spawns more brush if used near terrain or other brush.",
      "targeting": "Ground",
      "affects": "Self, Allies",
      "notes": "* The bonus magic damage affects towers."
    }
  },
  "skill_e": {
    "Triggerseed": {
      "name": "Triggerseed",
      "champion": "Ivern",
      "skill": "E",
      "target range": "750",
      "effect radius": "380",
      "cost": "70",
      "costtype": "Mana",
      "cooldown": "12 / 11 / 10 / 9 / 8",
      "icon": "Triggerseed.png",
      "blurb": "Ivern places a shield on an ally which explodes after a short duration slowing and damaging enemies.",
      "description": "Active: Ivern gifts a Triggerseed to the target allied champion, himself or  Daisy,  shielding them for 2 seconds.",
      "leveling": "Shield:\n80 / 115 / 150 / 185 / 220 (+ 80% AP)",
      "description2": "At the end of its duration, Triggerseed bursts, dealing magic damage to all nearby enemies and  slowing them for 2 seconds.",
      "leveling2": "Magic Damage:\n60 / 80 / 100 / 120 / 140 (+ 80% AP)\nSlow:\n40 / 45 / 50 / 55 / 60%",
      "targeting": "Unit / Self",
      "affects": "Allies, Self, Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "True",
      "notes": "*Triggerseed on allied champions grants them all kill credits it causes."
    }
  },
  "skill_r": {
    "Daisy!": {
      "name": "Daisy!",
      "champion": "Ivern",
      "skill": "R",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "160 / 150 / 140 / 130 / 120",
      "icon": "Daisy!.png",
      "blurb": "Ivern summons his Sentinel friend Daisy to fight with him. Daisy will send out a shockwave if she attacks the same champion three times in a row.",
      "description": "Active: Ivern summons his sentinel friend  Daisy at his side, who remains on the field for 60 seconds as a controllable  pet.",
      "icon2": "Daisy, wait!.png",
      "description2": "Recast: Ivern commands Daisy! to move to the target location. If cast on Ivern,  Daisy will follow him.",
      "targeting": "Ground",
      "affects": "None",
      "spelleffects": "pet",
      "projectile": "False",
      "notes": "* No additional details."
    }
  }
}