{
  "id": 202,
  "apiname": "Jhin",
  "title": "the Virtuoso",
  "attack": 10,
  "defense": 2,
  "magic": 6,
  "difficulty": 2,
  "herotype": "Marksman",
  "alttype": "Mage",
  "resource": "Mana",
  "stats": {
    "hp_base": 556,
    "hp_lvl": 91,
    "mp_base": 300,
    "mp_lvl": 50,
    "arm_base": 24,
    "arm_lvl": 3.5,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 3.75,
    "hp5_lvl": 0.55,
    "mp5_base": 6,
    "mp5_lvl": 0.8,
    "dam_base": 59,
    "dam_lvl": 4.7,
    "as_base": 0.625,
    "as_lvl": 3,
    "range": 550,
    "ms": 330,
    "acquisition_radius": 800,
    "selection_radius": 120,
    "pathing_radius": 35,
    "crit_mod": 0.75,
    "as_ratio": 0,
    "attack_cast_time": 0.25,
    "attack_total_time": 1.60000002384185,
    "aram_dmg_dealt": 0.9,
    "urf_dmg_dealt": 1.2
  },
  "fullname": "Khada Jhin",
  "rangetype": "Ranged",
  "date": "2016-02-01",
  "patch": "V6.2",
  "changes": "V9.18",
  "role": [
    "Marksman",
    "Catcher"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 1,
  "utility": 1,
  "style": 20,
  "adaptivetype": "physical",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "Whisper": {
      "name": "Whisper",
      "champion": "Jhin",
      "skill": "I",
      "icon": "Whisper.png",
      "blurb": "Jhin's hand cannon, Whisper, is a precise instrument designed to deal superior damage. It fires at a fixed rate and carries only four shots. Jhin imbues the final bullet with dark magics to critically strike and deal bonus execute damage. Whenever Whisper crits, it inspires Jhin with a burst of movement speed.",
      "description": "Innate - Death In 4 Acts: Jhin's basic attacks consume ammunition, requiring him to  reload after attacking 4 times, which takes 2.5 seconds. Jhin will also begin reloading after 10 seconds of not being in combat, which can be interrupted by declaring an attack or casting an ability.",
      "description2": "Jhin's fourth attack will  critically strike and deal 15 / 20 / 25% (based on level) of the target's missing health  bonus physical damage. This critical strike will occur versus structures but deals only (20% +  15%) AD bonus physical damage.",
      "description3": "Innate - Every Moment Matters: Jhin gains 4% − 44% (based on level)  (+ 0.4% per 1% critical strike chance) (+ 0.25% per 1% bonus attack speed)    (+ 40% of his critical strike chance) (+ 25% of his bonus attack speed)   bonus  attack damage.",
      "description4": "Additionally,  critical strikes grant Jhin 10% (+ 0.4% per 1% bonus attack speed)  bonus movement speed for 2 seconds.",
      "targeting": "Passive",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "Proc",
      "notes": "* The penalty to Jhin's critical damage also reduces the base damage ((100 + 100) × 0.75 rather than 100 + 100 × 0.75) and stacks with other sources (i.e  Infinity Edge) ((100 + 100 × 1.25) × 0.75).\n This penalty does not affect  Curtain Call.\n\n The 4th attack versus a structure is classified as a critical strike for effects such as  Statikk Shiv.\n The attack damage multiplier stacks additively with  Dragon Slayer's.\n Every Moment Matter's bonus AD will benefit from any amount of bonus attack speed, even in excess of an amount that would usually reach the attacks per second cap (2.5).\n The maximum modifier without attack speed is 84%.\n 44% base modifier at level 18.\n 40% from critical strike chance on account of the 100% cap.\n Attack speed slows will only affect Jhin's bonus attack damage from his passive and will ignore his attack speed as it is fixed.\n\n\n Attack damage reductions apply before the multiplier causing them to be stronger against Jhin than advertised or versus other champions."
    }
  },
  "skill_q": {
    "Dancing Grenade": {
      "name": "Dancing Grenade",
      "champion": "Jhin",
      "skill": "Q",
      "target range": "550",
      "effect radius": "400",
      "cost": "40 / 45 / 50 / 55 / 60",
      "costtype": "Mana",
      "cooldown": "7 / 6.5 / 6 / 5.5 / 5",
      "icon": "Dancing Grenade.png",
      "blurb": "Jhin launches a magical cartridge at an enemy. It can hit up to four targets and gains damage each time it kills.",
      "description": "Active: Jhin launches a canister at the target enemy, dealing physical damage. Dancing Grenade bounces to up to three additional enemies beyond the first, with each kill it performs increasing its total damage by 35%.",
      "leveling": "Minimum Physical Damage:\n45 / 70 / 95 / 120 / 145 (+ 45 / 52.5 / 60 / 67.5 / 75% AD) (+ 60% AP)\nMaximum Damage:\n110.716875 / 172.22625 / 233.735625 / 295.245 / 356.754375 (+ 110.716875 / 129.1696875 / 147.6225 / 166.0753125 / 184.528125% AD) (+ 147.62% AP)",
      "targeting": "Unit / Auto",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "special",
      "spellshield": "Special",
      "projectile": "True",
      "notes": "* Applies  spell damage in an  area of effect range.\n Dancing Grenade will still bounce even if it is  spell shielded."
    }
  },
  "skill_w": {
    "Deadly Flourish": {
      "name": "Deadly Flourish",
      "champion": "Jhin",
      "skill": "W",
      "target range": "3000",
      "cast time": "0.75",
      "cost": "50 / 60 / 70 / 80 / 90",
      "costtype": "Mana",
      "cooldown": "12",
      "icon": "Caught Out.png",
      "blurb": "Jhin brandishes his cane, firing a single shot with incredible range. It pierces through minions and monsters, but stops on the first champion hit. If the target was recently struck by Jhin's allies, lotus traps, or basic attacks, they are rooted.",
      "description": "Passive: Enemy  champions damaged by Jhin, his allies, or caught inside a blooming  Lotus Trap are Caught Out for 4 seconds.",
      "icon2": "Deadly Flourish.png",
      "description2": "Active: Jhin fires a shot in the target direction that deals physical damage to all enemies in a line until colliding with an enemy  champion. Deals 75% damage against non-champions.",
      "leveling2": "Physical Damage:\n50 / 85 / 120 / 155 / 190 (+ 50% AD)\nNon-Champion Damage:\n37.5 / 63.75 / 90 / 116.25 / 142.5 (+ 37.5% AD)",
      "description3": "Caught Out champions are also  rooted, granting Jhin  Every Moment Matters'  bonus movement speed.",
      "leveling3": "Root Duration:\n1 / 1.25 / 1.5 / 1.75 / 2",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Special",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Applies  spell damage to the enemy champion and  area damage to all other enemy units.\n The Caught Out mark only appears if Deadly Flourish can  root the enemy, and will not if the ability's cooldown is longer than 4 seconds or isn't ranked up."
    }
  },
  "skill_e": {
    "Captive Audience": {
      "name": "Captive Audience",
      "champion": "Jhin",
      "skill": "E",
      "target range": "750",
      "cost": "30 / 35 / 40 / 45 / 50",
      "costtype": "Mana + 1 Charge",
      "cooldown": "2",
      "recharge": "28 / 25 / 22 / 19 / 16",
      "icon": "Captive Audience.png",
      "blurb": "Jhin places an invisible lotus trap that blooms when walked over. It slows nearby enemies before dealing damage with an explosion of serrated petals. Beauty in Death - When Jhin kills an enemy champion, a lotus trap will bloom near their corpse.",
      "description": "Passive - Beauty in Death: Jhin summons a blooming Lotus Trap under every enemy champion he kills.",
      "description2": "Additionally, Jhin periodically stocks a Lotus Trap charge, up to a maximum of 2, which are unaffected by Beauty in Death.",
      "description3": "Active: Jhin places a Lotus Trap at the target location which  stealths and arms after a brief delay, lasting up to 180 seconds. The Lotus Trap blooms upon enemy contact,  revealing enemies in the area for 4 seconds.",
      "description4": "Blooming Lotus Traps  slow enemies for 35% for 2 seconds before detonating, dealing magic damage. Lotus Traps deal 65% damage against non-champions and champions recently hit by one.",
      "leveling4": "Magic Damage:\n20 / 80 / 140 / 200 / 260 (+ 120% AD) (+ 100% AP)\nReduced Damage:\n13 / 52 / 91 / 130 / 169 (+ 78% AD) (+ 65% AP)",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "True",
      "projectile": "Special",
      "notes": "* The Lotus Trap is  knocked down when encountering  Wind Wall and  Unbreakable."
    }
  },
  "skill_r": {
    "Curtain Call": {
      "name": "Curtain Call",
      "champion": "Jhin",
      "skill": "R",
      "effect radius": "3500",
      "angle": "60°",
      "speed": "3200",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "120 / 112.5 / 105 / 97.5 / 90",
      "icon": "Curtain Call.png",
      "blurb": "Jhin channels, transforming Whisper into a shoulder-mounted mega-cannon. It is able to fire 4 super shots at extreme range that pierce through minions and monsters, but stop on the first champion impacted. Whisper cripples enemies hit, which slows them and deals execute damage. The 4th shot is perfectly crafted, epically powerful, and guaranteed to critically strike.",
      "description": "Active: Jhin begins channeling, gaining a wider field of view, though not a larger  vision range, during which he has the ability to cancel or recast Curtain Call up to four times. Jhin cannot cancel the channeling or fire the first shot until after 1 second, and has 10 seconds in which to use all casts.",
      "icon2": "Curtain Call 2.png",
      "description2": "Recast: After 0.25 seconds, Jhin fires a round in the target direction that deals physical damage to all enemies hit, increased by 0% − 300% (based on target's missing health), until colliding with an enemy  champion,  revealing the traveled area for 0.5 seconds and all enemies hit for 2 seconds while also  slowing them by 80% for 0.5 seconds.",
      "leveling2": "Minimum Damage:\n50 / 87.5 / 125 / 162.5 / 200 (+ 20% AD)\nMaximum Damage:\n200 / 350 / 500 / 650 / 800 (+ 80% AD)",
      "icon3": "Curtain Call 3.png",
      "description3": "The fourth shot will  critically strike for (100% +  25%) bonus physical damage.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Special",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Applies  spell damage to enemy champions and  area damage to other enemy units.\n The opening sound effect and area of range are audible and visible to both teams.\n There is 1 second preparation time on cast and 1 second static cooldown between each bullet.\n Cooldown starts after 10 seconds or after firing all 4 shots. Leveling up the ability while channeling will change the final cooldown."
    }
  }
}