{
  "id": 141,
  "apiname": "Kayn",
  "title": "the Shadow Reaper",
  "attack": 10,
  "defense": 6,
  "magic": 1,
  "difficulty": 2,
  "herotype": "Fighter",
  "alttype": "Assassin",
  "resource": "Mana",
  "stats": {
    "hp_base": 585,
    "hp_lvl": 85,
    "mp_base": 410,
    "mp_lvl": 50,
    "arm_base": 38,
    "arm_lvl": 3.3,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 8,
    "hp5_lvl": 0.75,
    "mp5_base": 11.5,
    "mp5_lvl": 0.95,
    "dam_base": 68,
    "dam_lvl": 3.3,
    "as_base": 0.669,
    "as_lvl": 2.7,
    "range": 175,
    "ms": 340,
    "acquisition_radius": 400,
    "selection_radius": 135,
    "pathing_radius": 35,
    "as_ratio": 0.669000029563903,
    "attack_cast_time": 0.280000001192092,
    "attack_total_time": 1.49500000476837,
    "attack_delay_offset": -0.100000001490116
  },
  "fullname": "Shieda Kayn",
  "nickname": "Rhaast, Darkin, Shadow Assassin",
  "rangetype": "Melee",
  "date": "2017-07-12",
  "patch": "V7.14",
  "changes": "V9.21",
  "role": [
    "Skirmisher"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 1,
  "mobility": 3,
  "utility": 1,
  "style": 0,
  "adaptivetype": "Physical",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "The Darkin Scythe": {
      "name": "The Darkin Scythe",
      "champion": "Kayn",
      "skill": "I",
      "icon": "The Darkin Scythe.png",
      "blurb": "At one point in the game, Kayn will permanently transform into either a Shadow Assassin or a Darkin.",
      "description": "Innate:  Kayn wields an ancient, sentient weapon, that battles with him for control. Each instance of damage Kayn deals against champions (excluding damage over time) and  takedowns causes them to drop orbs, red by  melee champions and blue by  ranged champions, that are automatically collected upon leaving combat, filling a bar around Kayn's portrait.",
      "description2": "Once the bar is filled, Kayn can return to the summoning platform to interact with his portrait to either be overwhelmed by  Rhaast or expel him to become the  Shadow Assassin, or wait 4 minutes until the other form becomes available, reduced by 5 seconds for each collected orb of their type after that.",
      "description3": "The transformation type is decided based on the highest amount of damage dealt to the respective range type. If the two forms are within 8% of each other, the last champion range type hit will determine the transformation. If both types are hit at the same time the trasformation will default to  Rhaast. The transformation will permanently change Kayn's abilities and grant him Homeguard.",
      "icon4": "The Darkin Scythe A.png",
      "description4": "Shadow Assassin: If Kayn has been out of champion combat for over 8 seconds, or he casts  Umbral Trespass, he deals 12% − 44% (based on level) of post-mitigation damage dealt against champions as  bonus magic damage, lasting for 3 seconds upon entering combat and also applying on the first instance of damage dealt.",
      "icon5": "The Darkin Scythe R.png",
      "description5": "Rhaast: Rhaast  heals for 34.5% − 43% (based on level) of the post-mitigation  physical damage that he deals with abilities against enemy champions.",
      "targeting": "Passive",
      "affects": "Self",
      "notes": "* The bar gets filled up completely at 500 points.\n Melee orbs grant 2 points per hit and 6 points per takedown.\n Ranged orbs grant 3 points per hit and 7 points per takedown.\n Each bar has a bucket system.\n The bucket starts at 60 points.\n Each time an orb is taken the system checks if there's an amount of points in the bucket equal to or higher than the amount received from the orb.If there is, Kayn is given an additional orb of the same type he received, while also subtracting that amount of points from the bucket.\n The bucket fills by 0.8 points per second if out of champion combat for 70 seconds.\n\n The amount of points received per orb is then multiplied by 3 / 6 / 10 (based on minutes).\n\n The orbs will be collected even if Kayn dies."
    }
  },
  "skill_q": {
    "Reaping Slash": {
      "name": "Reaping Slash",
      "champion": "Kayn",
      "skill": "Q",
      "target range": "350",
      "cost": "50",
      "costtype": "Mana",
      "cooldown": "7 / 6.5 / 6 / 5.5 / 5",
      "icon": "Reaping Slash.png",
      "blurb": "Kayn dashes, then slashes. Both deal damage.",
      "description": "Active: Kayn  dashes forward, dealing physical damage to enemies he passes through, before swinging his scythe, dealing the same damage to surrounding enemies.",
      "leveling": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                75,
                95,
                115,
                135,
                155
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                65,
                65,
                65,
                65,
                65
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        },
        {
          "attribute": "Total Non-Monster Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                150,
                190,
                230,
                270,
                310
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                130,
                130,
                130,
                130,
                130
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "description2": "Both instances of Reaping Slash deal 40 bonus damage against monsters.",
      "leveling2": [
        {
          "attribute": "Monster Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                115,
                135,
                155,
                175,
                195
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                65,
                65,
                65,
                65,
                65
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        },
        {
          "attribute": "Total Monster Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                230,
                270,
                310,
                350,
                390
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                130,
                130,
                130,
                130,
                130
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "icon3": "Reaping Slash R.png",
      "description3": "Rhaast: Reaping Slash's damage is modified to deal 55% AD (+ 5% (+ 4% per 100 bonus AD) of the target's maximum health) physical damage for both instances. This damage is capped against monsters.",
      "leveling3": [
        {
          "attribute": "Max. Monster Damage per Hit",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                200,
                250,
                300,
                350,
                400
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        },
        {
          "attribute": "Total Maximum Monster Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                400,
                500,
                600,
                700,
                800
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        }
      ],
      "description4": "The dash's speed scales with Kayn's  total movement speed.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "Special",
      "notes": "*  Spell shields will block only a single instance of damage - either the dash or the slash.\n As  Shadow Assassin, an alternate icon for  Reaping Slash is used but has no modified effect.\n Other abilities can be queued while casting Reaping Slash."
    }
  },
  "skill_w": {
    "Blade's Reach": {
      "name": "Blade's Reach",
      "champion": "Kayn",
      "skill": "W",
      "target range": "700",
      "cast time": "0.55",
      "cost": "60 / 65 / 70 / 75 / 80",
      "costtype": "Mana",
      "cooldown": "13 / 12 / 11 / 10 / 9",
      "icon": "Blade's Reach.png",
      "blurb": "Kayn damages and slows targets in a line.",
      "description": "Active: Kayn performs an upwards sweep with his scythe, dealing physical damage to all enemies in a line in the target direction and  slowing them by 60% decaying over 1.5 seconds.",
      "leveling": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                90,
                135,
                180,
                225,
                270
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                130,
                130,
                130,
                130,
                130
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "icon2": "Blade's Reach A.png",
      "description2": "Shadow Assassin: Blade's Reach's range is increased by 200. Additionally, Kayn conjures a living shadow at the casting position to perform Blade's Reach in his stead, reducing the ability's cast time to 0.",
      "icon3": "Blade's Reach R.png",
      "description3": "Rhaast: Blade's Reach  knocks up enemies for 1 second.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "False",
      "notes": "* The shadow created by the Shadow Assassin is considered a champion for  Turret Plating's  gold sharing."
    }
  },
  "skill_e": {
    "Shadow Step": {
      "name": "Shadow Step",
      "champion": "Kayn",
      "skill": "E",
      "cost": "90",
      "costtype": "Mana",
      "cooldown": "21 / 19 / 17 / 15 / 13",
      "icon": "Shadow Step.png",
      "blurb": "Kayn can walk through terrain.",
      "description": "Active: Kayn gains  40% bonus movement speed, is  ghosted and can ignore terrain collision for 1.5 seconds.  Immobilizing effects will interrupt Shadow Step.",
      "description2": "Kayn  heals himself upon moving through terrain for the first time and, if he's not in combat with enemy champions, Shadow Step's duration is increased. While inside terrain, Kayn has  unobstructed vision.",
      "leveling2": [
        {
          "attribute": "Heal",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                100,
                115,
                130,
                145,
                160
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                40,
                40,
                40,
                40,
                40
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        },
        {
          "attribute": "Empowered Duration",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                7,
                7.5,
                8,
                8.5,
                9
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        }
      ],
      "description3": "Receiving damage from an enemy  champion or dealing ability damage to them after the effect is enhanced reduces the remaining duration to 1.5 seconds. The effect also cannot remain active out of terrain for longer than 1.5 seconds and will cancel completely if Kayn uses a basic attack.",
      "icon4": "Shadow Step A.png",
      "description4": "Shadow Assassin: Shadow Step's cooldown is  reduced to 8 seconds at all ranks. Casting Shadow Step  cleanses Kayn from all  slows and makes him immune to them for the duration. Additionally, entering terrain will increase the  bonus movement speed to 80% for the remaining duration.",
      "targeting": "Self",
      "affects": "Self",
      "spelleffects": "Heal",
      "notes": "* As  Rhaast, an alternate icon for  Shadow Step is used but has no modified effect.\n Effects such as  Vayne's  Condemn and  Poppy's  Heroic Charge apply an  immobilizing effect and so  interrupt Shadow Step.\n Enemies cannot see Kayn while he is inside of terrain unless they have terrain-piercing vision, such as  Heightened Senses,  Hawkshot or  Comet of Legend.\n However, enemies will be notified if nearby terrain is infested if Kayn is within 1000 units - with an indicator being placed on the terrain with a direct line between Kayn and the enemy champion. Slightly less than standard sight radius, but more than the  camouflage detection radius.\n\n Kayn can move up to 550 units beyond the outer-edge of the battlefield.\n While in terrain, Kayn will not be considered unseen for the sake of  Duskblade of Draktharr.\n Kayn's  sight radius is not extended beyond merged terrain while  nearsighted.\n This ability cannot be cast while  Grounded."
    }
  },
  "skill_r": {
    "Umbral Trespass": {
      "name": "Umbral Trespass",
      "champion": "Kayn",
      "skill": "R",
      "target range": "550",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "120 / 110 / 100 / 90 / 80",
      "icon": "Umbral Trespass.png",
      "blurb": "Kayn hides in an enemy's body, dealing massive damage when he bursts out.",
      "description": "Passive: Kayn marks enemy champions he damaged in the last 3.15 seconds.",
      "description2": "Active: Kayn becomes  untargetable and  infests inside a marked enemy  champion for up to 2.5 seconds, gaining  true sight of them for the duration. Reactivating Umbral Trespass ends it earlier.",
      "icon3": "Umbral Trespass 2.png",
      "description3": "Upon reactivation or at the end of the duration, Kayn  dashes out from their body 300-units away in the target direction, dealing physical damage to the target.",
      "leveling3": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                150,
                200,
                250,
                300,
                350
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                175,
                175,
                175,
                175,
                175
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "description4": "Shadow Assassin: Umbral Trespass[ gains up to 200 bonus cast range and emerge range. ][ has a 750 maximum cast range and 500 maximum emerge range. ]Additionally, emerging will reset  The Darkin Scythe's  cooldown.",
      "icon5": "Umbral Trespass 2 R.png",
      "description5": "Rhaast: Umbral Trespass is modified to deal 10% (+ 13% per 100 bonus AD) of target's maximum health physical damage, and  heals him for[ 70% of the pre-mitigation damage. ][ 7% (+ 9.1% per 100 bonus AD) of target's maximum health. ]",
      "targeting": "Unit / Direction",
      "affects": "Enemies, Self",
      "damagetype": "Physical",
      "spelleffects": "spell",
      "spellshield": "Special",
      "notes": "* If the target dies during infestation, Umbral Trespass is not  cancelled.\n As  Rhaast, an alternate icon is used for the initial activation of  Umbral Trespass.\n Until the second cast, the ability will have had no effect on the target for the purposes of  Electrocute or the 'in-combat' status.\n As  Shadow Assassin, the range at which Kayn can emerge from a direction is able to be scaled (even under the minimum range).\n  Spell shields will prevent Kayn from infesting the target, but will do nothing to mitigate the damage once he has already infested them.\n If Kayn targets an enemy with a spell shield, the ability will simply go on cooldown without making him dash to his target.\n This is also true for  Fiora's  Riposte.\n\n The damage is not blocked if the target is  untargetable.\n Kayn can only be  knocked down upon  emerging from the target."
    }
  }
}