{
  "id": 127,
  "apiname": "Lissandra",
  "title": "the Ice Witch",
  "attack": 2,
  "defense": 5,
  "magic": 8,
  "difficulty": 2,
  "herotype": "Mage",
  "resource": "Mana",
  "stats": {
    "hp_base": 550,
    "hp_lvl": 90,
    "mp_base": 475,
    "mp_lvl": 30,
    "arm_base": 22,
    "arm_lvl": 3.7,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 7,
    "hp5_lvl": 0.55,
    "mp5_base": 8,
    "mp5_lvl": 0.4,
    "dam_base": 53,
    "dam_lvl": 2.7,
    "as_base": 0.656,
    "as_lvl": 1.36,
    "range": 550,
    "ms": 325,
    "acquisition_radius": 600,
    "selection_radius": 88.8889007568359,
    "pathing_radius": 35,
    "as_ratio": 0.625,
    "attack_delay_offset": -0.112499997019767
  },
  "rangetype": "Ranged",
  "date": "2013-04-30",
  "patch": "V3.6",
  "changes": "V9.20",
  "role": [
    "Burst"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 3,
  "mobility": 2,
  "utility": 1,
  "style": 100,
  "adaptivetype": "magic",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Iceborn Subjugation": {
      "name": "Iceborn Subjugation",
      "champion": "Lissandra",
      "skill": "I",
      "icon": "Iceborn Subjugation.png",
      "description": "Innate: Whenever an enemy champion dies while Lissandra is near, she spawns a Frozen Thrall from their corpse.",
      "description2": "Frozen Thralls chase nearby enemies, prioritizing champions,  slowing nearby enemies by 25% and shattering after 4 seconds, dealing 120 − 520 (based on level) (+ 50% AP)  magic damage. Frozen Thralls initially have a slow movement speed, which increases over the duration.",
      "targeting": "Passive",
      "affects": "Enemies",
      "damagetype": "Magic",
      "notes": "* Thralls are considered champions for  Turret Plating's  gold sharing."
    }
  },
  "skill_q": {
    "Ice Shard": {
      "name": "Ice Shard",
      "champion": "Lissandra",
      "skill": "Q",
      "target range": "725 / 825",
      "cost": "60 / 65 / 70 / 75 / 80",
      "costtype": "Mana",
      "cooldown": "10 / 8.5 / 7 / 5.5 / 4",
      "icon": "Ice Shard.png",
      "blurb": "Throws a spear of ice that shatters when it hits an enemy, dealing magic damage and slowing Movement Speed. Shards pass through the target, dealing the same damage to other enemies hit.",
      "description": "Active: Lissandra hurls a spear of ice in a line which deals magic damage to the first enemy it hits and  slows them for 1.5 seconds.",
      "leveling": "Magic Damage:\n70 / 100 / 130 / 160 / 190 (+ 70% AP)\n\nSlow:\n16 / 19 / 22 / 25 / 28%",
      "description2": "If the spear damages an enemy, it then shatters, gaining increased range and dealing the same damage to other enemies hit, but applying no slow.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "magic",
      "spelleffects": "aoe",
      "spellshield": "Special",
      "projectile": "true",
      "notes": "* The shattering projectiles travel the remaining distance Ice Shard would plus an extra 100 units.\n Ice Shard sounds like breaking glass when shattering (the projectiles do not produce any sound on contact).\n Ice Shard's slow has particles resembling cold air.\n  Spell shield will block the damage and the slow but will not stop the projectile from shattering."
    }
  },
  "skill_w": {
    "Ring of Frost": {
      "name": "Ring of Frost",
      "champion": "Lissandra",
      "skill": "W",
      "effect radius": "450",
      "cost": "40",
      "costtype": "Mana",
      "cooldown": "14 / 13 / 12 / 11 / 10",
      "icon": "Ring of Frost.png",
      "blurb": "Freezes nearby enemies in ice, dealing magic damage and rooting them.",
      "description": "Active: Lissandra freezes all nearby enemies, dealing them magic damage and briefly  rooting them.",
      "leveling": "Magic Damage:\n70 / 105 / 140 / 175 / 210 (+ 70% AP)\n\nRoot Duration:\n1.1 / 1.2 / 1.3 / 1.4 / 1.5",
      "targeting": "None",
      "affects": "Enemies",
      "damagetype": "magic",
      "spelleffects": "aoe",
      "spellshield": "True",
      "notes": "* Ring of Frost has no cast time and does not interrupt Lissandra's previous orders or animations (meaning she can overlap it with any of her other abilities or even basic attacks)."
    }
  },
  "skill_e": {
    "Glacial Path": {
      "name": "Glacial Path",
      "champion": "Lissandra",
      "skill": "E",
      "target range": "1050",
      "speed": "1200 / 640",
      "cost": "80 / 85 / 90 / 95 / 100",
      "costtype": "Mana",
      "cooldown": "24 / 21 / 18 / 15 / 12",
      "icon": "Glacial Path.png",
      "blurb": "Lissandra creates an ice claw that deals magic damage. Reactivating this ability transports Lissandra to the claw's current location.",
      "description": "Active: Lissandra casts a claw of ice that moves forward in a line, decelerating over 1.25 seconds, dealing magic damage to all enemies it passes through.",
      "leveling": "Magic Damage:\n70 / 105 / 140 / 175 / 210 (+ 60% AP)",
      "description2": "Reactivating Glacial Path consumes the claw and  blinks Lissandra to its current location.",
      "targeting": "Direction",
      "affects": "Enemies, Self",
      "damagetype": "magic",
      "spelleffects": "aoe",
      "spellshield": "True",
      "projectile": "true",
      "notes": "* Lissandra can reactivate Glacial Path for the duration (plus another 0.2-0.3 after the claw 'skins' into the ground).\n Glacial Path allows Lissandra to blink past every single wall in all maps, so long as the claw is at least halfway through them.\n Glacial Path cannot be reactivated if Lissandra is disabled.\n Enemies hit by the claw (stealthed or not) will make a sound and a small visual effect displays.\n Glacial Path's endpoint shows through terrain, fog of war, and brush to enemies within 600 range of it."
    }
  },
  "skill_r": {
    "Frozen Tomb": {
      "name": "Frozen Tomb",
      "champion": "Lissandra",
      "skill": "R",
      "target range": "550",
      "effect radius": "550",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "120 / 110 / 100 / 90 / 80",
      "icon": "Frozen Tomb.png",
      "blurb": "If cast on an enemy champion, the target is frozen solid, stunning it. If cast on Lissandra, she encases herself in dark ice, healing herself while becoming untargetable and invulnerable. Dark ice then emanates from the target dealing magic damage to enemies and slowing Movement Speed.",
      "description": "Enemy Cast: After a 0.5-second delay, Lissandra freezes the target enemy champion,  knocking down and  stunning the target for 1.5 seconds.",
      "description2": "Self Cast: Lissandra instantly entombs herself, placing herself in  stasis for 2.5 seconds while  healing herself over the duration, with the heal increased by 0% − 100% (based on missing health) at time of cast.",
      "leveling2": "Minimum Self-Heal:\n100 / 125 / 150 / 175 / 200 (+ 30% AP)\nMaximum Self-Heal:\n200 / 250 / 300 / 350 / 400 (+ 60% AP)",
      "description3": "Upon cast, after a 0.5-second delay, Black Ice spreads from Frozen Tomb's target and lasts for 3 seconds, dealing magic damage to all unique enemies entering the area, and  slowing them while they remain within.",
      "leveling3": "Magic Damage:\n150 / 200 / 250 / 300 / 350 (+ 75% AP)\n\nSlow:\n30 / 41.25 / 52.5 / 63.75 / 75%",
      "targeting": "Unit, Self",
      "affects": "Enemies, Self",
      "damagetype": "magic",
      "spelleffects": "aoe",
      "spellshield": "Special",
      "notes": "* It takes ~0.4 for Frozen Tomb to stun and damage the enemy target (they may become untargetable during this window to avoid the effects but the ice field will still be formed) and any movement abilities will be immediately canceled if enemies use them to try to get away from Lissandra when she targets them.\n It takes ~1 second for Frozen Tomb's slow field to fully form.\n\n Enemies who come in contact with Frozen Tomb's slow field will be damaged and a small visual and sound effect will play.\n Enemies can only be damaged by the ice field once per cast (if they come in contact with it with an active  spell shield they will consume it to become immune to any damage from that particular cast).\n\n  Spell shield will block the single-targeted portion and the radiating ice damage but will not stop it from spreading."
    }
  }
}