{
  "id": 57,
  "apiname": "Maokai",
  "title": "the Twisted Treant",
  "attack": 3,
  "defense": 8,
  "magic": 6,
  "difficulty": 1,
  "herotype": "Tank",
  "alttype": "Mage",
  "resource": "Mana",
  "stats": {
    "hp_base": 565,
    "hp_lvl": 95,
    "mp_base": 377.28,
    "mp_lvl": 43,
    "arm_base": 39,
    "arm_lvl": 4,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 5,
    "hp5_lvl": 0.75,
    "mp5_base": 7.2,
    "mp5_lvl": 0.6,
    "dam_base": 63.54,
    "dam_lvl": 3.3,
    "as_base": 0.8,
    "as_lvl": 2.125,
    "range": 125,
    "ms": 335,
    "acquisition_radius": 600,
    "selection_radius": 125,
    "pathing_radius": 50,
    "as_ratio": 0.694999992847442,
    "attack_delay_offset": 0,
    "aram_dmg_dealt": 0.88,
    "aram_dmg_taken": 1.12,
    "urf_dmg_taken": 0.95,
    "urf_healing": 0.95
  },
  "rangetype": "Melee",
  "date": "2011-02-16",
  "patch": "V1.0.0.111",
  "changes": "V9.24b",
  "role": [
    "Vanguard"
  ],
  "damage": 1,
  "toughness": 3,
  "control": 3,
  "mobility": 1,
  "utility": 2,
  "style": 75,
  "adaptivetype": "magic",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Sap Magic": {
      "name": "Sap Magic",
      "champion": "Maokai",
      "skill": "I",
      "static": "30 / 25 / 20 (based on level)",
      "icon": "Sap Magic.png",
      "blurb": "Maokai's basic attack also heal him on a moderate cooldown. Each time Maokai casts a spell or is struck by an enemy's spell, this cooldown is reduced.",
      "description": "Innate: Periodically, Maokai's next basic attack, after a 0.25-seconds delay, against a non-structure  heals him for 5 − 65 (based on level) (+ 6% − 13% (based on level) maximum health).",
      "icon2": "Sap Magic 2.png",
      "description2": "Each time Maokai casts an ability or is struck by an enemy's ability, Sap Magic's  cooldown is reduced by 4 seconds.",
      "description3": "Sap Magic will not activate if Maokai is above 95% maximum  health.",
      "targeting": "Passive",
      "affects": "Self",
      "spelleffects": "Heal",
      "spellshield": "False",
      "notes": "* Maokai can gain stacks from nearby enemy champions he has no  sight of.\n The enhanced attack will apply other on-hit effects and can  critically strike as normal.\n Sap Magic can be  dodged and/or miss if Maokai is  blinded (but will not be consumed) but cannot be  blocked (the enhanced attack will be).\n The empowered attack cannot be cancelled.\n Sap Magic cannot be used against turrets, wards, inhibitors or the Nexus.\n If Maokai posses a  Spell Shield and it consumes an enemy ability he still receives the cooldown reduction."
    }
  },
  "skill_q": {
    "Bramble Smash": {
      "name": "Bramble Smash",
      "champion": "Maokai",
      "skill": "Q",
      "target range": "600",
      "effect radius": "300",
      "cost": "50",
      "costtype": "Mana",
      "cooldown": "8 / 7.25 / 6.5 / 5.75 / 5",
      "icon": "Bramble Smash.png",
      "blurb": "Maokai knocks back nearby enemies with a shockwave, dealing magic damage and slowing them.",
      "description": "Active: After a 0.35-seconds delay, Maokai releases an arcane shockwave that travels forth in a line, dealing  magic damage to all enemies it passes through and  slowing them by 99% for 0.25 seconds.",
      "leveling": "Magic Damage:\n70 / 115 / 160 / 205 / 250 (+ 40% AP)",
      "description2": "Enemies near Maokai are also  knocked back up to 300 units based on their proximity to him.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* No additional effect."
    }
  },
  "skill_w": {
    "Twisted Advance": {
      "name": "Twisted Advance",
      "champion": "Maokai",
      "skill": "W",
      "target range": "525",
      "cost": "60",
      "costtype": "Mana",
      "cooldown": "13 / 12 / 11 / 10 / 9",
      "icon": "Twisted Advance.png",
      "blurb": "Maokai contorts into a mass of moving roots, becoming untargetable and dashing to the target. Upon arrival, he roots the target.",
      "description": "Active: Maokai  dashes to the target enemy, becoming  untargetable for the duration, dealing magic damage on arrival and briefly  rooting them.",
      "leveling": "Magic Damage:\n70 / 95 / 120 / 145 / 170 (+ 40% AP)\n\nRoot Duration:\n1 / 1.1 / 1.2 / 1.3 / 1.4",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Single target",
      "spellshield": "True",
      "notes": "* Twisted Advance will cancel mid-dash if Maokai's target dies or becomes untargetable.\n Maokai will continue to chase his target even if he loses sight of them (if he does, sometimes a visual bug will occur where Maokai freezes mid-dash, but he will still reach them and root them).\n Maokai will follow any dash or blink except global Blink or Dash ( Recall,  Teleport,  Paranoia,  Gate,  Stand United,...).\n Becoming untargetable during Twisted Advance will prevent Maokai from being hit by non-targeted abilities ( Flame Chompers!,  Requiem) as well as stop turrets and non-champion units from targeting him.\n Possible Bug: Maokai can interact with  Dark Passage while untargetable, allowing him to root targets near  Thresh."
    }
  },
  "skill_e": {
    "Sapling Toss": {
      "name": "Sapling Toss",
      "champion": "Maokai",
      "skill": "E",
      "target range": "1100",
      "effect radius": "175 / 350",
      "tether radius": "250",
      "speed": "400 - 460",
      "cost": "60 / 65 / 70 / 75 / 80",
      "costtype": "Mana",
      "cooldown": "10",
      "icon": "Sapling Toss.png",
      "blurb": "Maokai flings a sapling to the target area to stand guard. More effective in brush.",
      "description": "Active: Maokai flings a Sapling to the target location, remaining there for 30 seconds and granting  sight around itself.",
      "description2": "Saplings tether to nearby enemies, chasing them for up to 2.5 seconds, exploding upon impact or at the end of its duration, dealing magic damage to all nearby enemies upon detonation, capped at 300 against non-champions, and  slowing them by 35% for 2 seconds.",
      "leveling2": "Magic Damage:\n25 / 50 / 75 / 100 / 125 (+ 7 / 7.25 / 7.5 / 7.75 / 8% (+ 1% per 100 AP) of target's maximum health)",
      "description3": "Saplings placed in bush instead have 30 (+ 2.5% bonus health) duration and deal double damage over 2 seconds to all enemies hit, capped at 600 against non-champions.",
      "leveling3": "Total Magic Damage:\n50 / 100 / 150 / 200 / 250 (+ 14 / 14.5 / 15 / 15.5 / 16% (+ 2% per 100 AP) of target's maximum health)",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "Special",
      "projectile": "Special",
      "notes": "* Saplings have a base movement speed of 400, increased based on Maokai's boots:\n  Boots of Speed: 425\n  Berserker's Greaves,  Ionian Boots of Lucidity,  Mercury's Treads,  Ninja Tabi and  Sorcerer's Shoes: 445\n  Boots of Swiftness and  Boots of Mobility: 460\n\n Sapling Toss grants  sight of the target location even while the Sapling is in flight.\n Unlike  Volatile Spiderling the Saplings will continue to chase their target even if they lose  sight of them (but they do not prioritize champions so they will chase the first target they encounter).\n Saplings will appear on the map as minions despite being untargetable and invulnerable.\n Saplings will stop before  Wind Wall and  Unbreakable when Maokai is throwing.\n However, the Saplings can chase enemies through  Wind Wall and the damage will be blocked / reduced by  Unbreakable.\n\n Saplings cannot stack on top of each other (they will move a short distance away from one another if they are aimed at the same location).\n Saplings attack  Baron Nashor always at the same two points, no matter where they were placed."
    }
  },
  "skill_r": {
    "Nature's Grasp": {
      "name": "Nature's Grasp",
      "champion": "Maokai",
      "skill": "R",
      "target range": "3000",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "120 / 100 / 80",
      "icon": "Nature's Grasp.png",
      "blurb": "Maokai summons a colossal wall of brambles and thorns that slowly advances forwards, damaging and rooting any enemies in the path.",
      "description": "Active: Maokai summons a colossal wall of 5 thorny brambles that slowly advances forward, each stopping at the first enemy champion they collide with.",
      "description2": "Each thorny bramble deals magic damage and  roots for 0.8 −  2.6 (based on distance traveled) seconds.",
      "leveling2": "Magic Damage:\n150 / 225 / 300 (+ 75% AP)",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Enemy champion can be rooted and damaged multiple times by the ability if they manage to \"follow\" the ability."
    }
  }
}