{
  "id": 11,
  "apiname": "MasterYi",
  "title": "the Wuju Bladesman",
  "attack": 10,
  "defense": 4,
  "magic": 2,
  "difficulty": 1,
  "herotype": "Assassin",
  "alttype": "Fighter",
  "resource": "Mana",
  "stats": {
    "hp_base": 598.56,
    "hp_lvl": 92,
    "mp_base": 250.56,
    "mp_lvl": 42,
    "arm_base": 33,
    "arm_lvl": 3,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 7.5,
    "hp5_lvl": 0.65,
    "mp5_base": 7.256,
    "mp5_lvl": 0.45,
    "dam_base": 66,
    "dam_lvl": 3,
    "as_base": 0.679,
    "as_lvl": 2,
    "range": 125,
    "ms": 355,
    "acquisition_radius": 600,
    "selection_radius": 125,
    "pathing_radius": 35,
    "as_ratio": 0.67900002002716,
    "attack_delay_offset": -0.0562499985098838,
    "urf_dmg_taken": 1.1,
    "urf_healing": 0.9
  },
  "rangetype": "Melee",
  "date": "2009-02-21",
  "patch": "Alpha Week 2",
  "changes": "V9.21",
  "role": [
    "Skirmisher"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 1,
  "mobility": 2,
  "utility": 1,
  "style": 10,
  "adaptivetype": "physical",
  "be": 450,
  "rp": 260,
  "skill_i": {
    "Double Strike": {
      "name": "Double Strike",
      "champion": "Master Yi",
      "skill": "I",
      "icon": "Double Strike.png",
      "blurb": "Every few strikes, Master Yi strikes twice.",
      "description": "Innate: Master Yi gains a stack of Double Strike for every basic attack on-hit within 4 seconds of each other. At 3 stacks, Master Yi's next basic attack on-attack within 4 seconds consumes the stacks to strike twice, the second strike dealing 50% AD  physical damage.",
      "description2": "The second strike applies on-attack and on-hit effects at full effect and is affected by  critical strike modifiers.",
      "description3": "If Master Yi's primary target is killed before the second strike, he automatically attacks another enemy within 300 range.",
      "description4": "The second strike can  critically strike  structures.",
      "targeting": "Passive",
      "affects": "Enemies",
      "damagetype": "Physical",
      "occurrence": "On-hit",
      "spellshield": "False",
      "notes": "* Since Double Strike resets the counter on-attack and the second strike applies on-hit effects, the second strike is able to add a stack for the next Double Strike activation.\n Double Strike has been special cased to also trigger  Hail of Blades on-hit.\n Since Double Strike also triggers on-attack effects, this causes the consumption of all Hail of Blades stacks in one attack."
    }
  },
  "skill_q": {
    "Alpha Strike": {
      "name": "Alpha Strike",
      "champion": "Master Yi",
      "skill": "Q",
      "target range": "600",
      "effect radius": "600",
      "cost": "50 / 55 / 60 / 65 / 70",
      "costtype": "Mana",
      "cooldown": "18 / 17 / 16 / 15 / 14",
      "icon": "Alpha Strike.png",
      "blurb": "Master Yi teleports across the battlefield with blinding speed, dealing physical damage to multiple units in his path, while simultaneously becoming untargetable. Alpha Strike can critically strike and deals bonus physical damage to minions and monsters. Basic attacks reduce Alpha Strike's cooldown.",
      "description": "Active: Master Yi  vanishes and, after 0.225 seconds, marks his target and then moves to mark the nearest  visible un-marked enemy within 600 units, recurring up to 3 times, once every 0.225 seconds.",
      "description2": "Upon finishing marking, or if there're no other enemies in range, he  re-appears after a 0.15 second delay in front of his target and deals physical damage to all marked enemies, increased against monsters. If his target dies during the delay, he will reappear at the cast location instead.",
      "leveling2": "Physical Damage:\n25 / 60 / 95 / 130 / 165 (+ 100% AD)\nMonster Damage:\n100 / 160 / 220 / 280 / 340 (+ 100% AD)\nMonster Bonus Damage:\n75 / 100 / 125 / 150 / 175",
      "description3": "If there are no other un-marked enemies in range, he may strike the same enemies again, dealing 25% damage instantly.",
      "leveling3": "Reduced Damage:\n6.25 / 15 / 23.75 / 32.5 / 41.25 (+ 25% AD)\nReduced Monster Damage:\n25 / 40 / 55 / 70 / 85 (+ 25% AD)\n\nMaximum Single-Target Damage:\n43.75 / 105 / 166.25 / 227.5 / 288.75 (+ 175% AD)\nMax Monster Single-Target Damage:\n175 / 280 / 385 / 490 / 595 (+ 175% AD)",
      "description4": "Alpha Strike's primary and lesser damage can  critically strike for (60% +  15%) AD bonus physical damage and (15% +  3.75%) AD bonus physical damage respectively.",
      "description5": "Basic attacks reduce Alpha Strike's  cooldown by 1 second.",
      "targeting": "Unit",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "AoE",
      "spellshield": "True",
      "notes": "* Alpha Strike's cooldown reduction applies on structures but not when Master Yi is  blinded.\n Master Yi can use summoner spells during Alpha Strike.\n When Master Yi bounces from a unit it will grant  vision around it. It will always grant vision around the primary target even if he doesn't bounce off it. This vision will not reveal brushes.\n Alpha Strike's damage is calculated the moment the mark is placed. Because of this it is possible to inflict differing amounts of damage if Master Yi changes his AD in the middle of Alpha Strike.\n If the target becomes  untargetable during Alpha Strike's cast, Alpha Strike will not end, but will instead last as if it had kept bouncing around targets.\n Master Yi will follow his primary target's movement even if it  vanishes or becomes  invisible.\n Alpha Strike's primary damage applies after Master Yi leaves  untargetability and thus can attract turret aggro.\n Alpha Strike counts as movement for the purposes of Energized Strike, Dreadnought and Echo.\n If the primary target is a champion, Master Yi will basic attack that champion when Alpha Strike finishes, but he cannot buffer  Highlander or  Wuju Style.\n If the primary target is a minon or monster, Master Yi can buffer either  Highlander or  Wuju Style, but he will not automatically basic attack the target."
    }
  },
  "skill_w": {
    "Meditate": {
      "name": "Meditate",
      "champion": "Master Yi",
      "skill": "W",
      "cost": "50",
      "costtype": "Mana",
      "cooldown": "28",
      "icon": "Meditate.png",
      "blurb": "Master Yi rejuvenates his body by focus of mind, restoring Health and taking reduced damage for a short time. In addition, Master Yi will gain stacks of Double Strike and pause the remaining duration on Wuju Style and Highlander for each second he channels.",
      "description": "Active: Master Yi  channels for up to 4 seconds,  healing himself every 0.5 seconds, increased by 0% − 100% (based on missing health).",
      "leveling": "Minimum Healing Per Half Second:\n15 / 25 / 35 / 45 / 55 (+ 12.5% AP)\nMaximum Healing Per Half Second:\n30 / 50 / 70 / 90 / 110 (+ 25% AP)\nMinimum Total Healing:\n120 / 200 / 280 / 360 / 440 (+ 100% AP)\nMaximum Total Healing:\n240 / 400 / 560 / 720 / 880 (+ 200% AP)",
      "description2": "While channeling, Master Yi reduces incoming damage, halved against turrets, pauses  Wuju Style's and  Highlander's duration, and grants one stack of  Double Strike per second.",
      "leveling2": "Damage Reduction:\n60 / 62.5 / 65 / 67.5 / 70%\nTurret Damage Reduction:\n30 / 31.25 / 32.5 / 33.75 / 35%",
      "description3": "Meditate resets Master Yi's autoattack timer.",
      "targeting": "None",
      "affects": "Self",
      "spelleffects": "Heal",
      "notes": "* Meditate's healing amount updates dynamically as he heals himself, making Master Yi heal for less as his current health increases."
    }
  },
  "skill_e": {
    "Wuju Style": {
      "name": "Wuju Style",
      "champion": "Master Yi",
      "skill": "E",
      "cooldown": "18 / 17 / 16 / 15 / 14",
      "icon": "Wuju Style.png",
      "blurb": "Master Yi becomes skilled in the art of Wuju, passively increasing his Attack Damage. Activating Wuju Style grants bonus true damage on basic attacks, but the passive bonus is then lost while on cooldown.",
      "description": "Active: Master Yi's basic attacks deal  bonus true damage for 5 seconds.",
      "leveling": "True Damage:\n18 / 26 / 34 / 42 / 50 (+ 35% bonus AD)",
      "targeting": "None",
      "affects": "Self",
      "damagetype": "True",
      "spellshield": "False",
      "notes": "* Wuju Style has no cast time and does not interrupt Master Yi's previous orders.\n Wuju Style's bonus true damage does not interact with  critical strikes nor does it affect structures.\n Wuju Style's bonus true damage cannot be  blocked but can be  dodged and/or miss if Master Yi is  blinded."
    }
  },
  "skill_r": {
    "Highlander": {
      "name": "Highlander",
      "champion": "Master Yi",
      "skill": "R",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "85",
      "icon": "false",
      "blurb": "Master Yi moves with unparalleled agility, temporarily increasing his Movement and Attack Speeds as well as making him immune to all slowing effects. While active, Champion kills or assists extend Highlander's duration. Passively reduces cooldown for his other abilities on a kill or assist.",
      "description": "Passive: Champion  takedowns reduce the current  cooldown of Master Yi's basic abilities by 70%.",
      "icon2": "Highlander.png",
      "description2": "Active: For 7 seconds, Master Yi is  ghosted, gains  bonus attack speed and  bonus movement speed, and becomes immune to  slows and  cripples.",
      "leveling2": "Bonus Attack Speed:\n30 / 42.5 / 55 / 67.5 / 80%\n\nBonus Movement Speed:\n35 / 40 / 45 / 50 / 55%",
      "description3": "While active, champion  takedowns extend the duration of Highlander by 7 seconds.",
      "targeting": "None",
      "affects": "Self",
      "notes": "* Decoys count as champions for the takedown effect.\n Highlander has no cast time and does not interrupt Master Yi's previous orders.\n Highlander's slow immunity extends to all slows including abilities with multiple effects (e.g  fear,  charm) and attack speed slows. The abilities themselves won't be negated, but the slows will.\n There're two situations that can happen if Master Yi uses Highlander while Highlander's buff is active.\n If the buff's duration is under 7 seconds, the buff refreshes to 7 seconds.\n If the buff's duration is above 7 seconds nothing happens."
    }
  }
}