{
  "id": 82,
  "apiname": "Mordekaiser",
  "title": "the Iron Revenant",
  "attack": 4,
  "defense": 6,
  "magic": 7,
  "difficulty": 2,
  "herotype": "Fighter",
  "resource": "Shield",
  "stats": {
    "hp_base": 575,
    "hp_lvl": 90,
    "mp_base": 0,
    "mp_lvl": 0,
    "arm_base": 37,
    "arm_lvl": 3,
    "mr_base": 32,
    "mr_lvl": 1.25,
    "hp5_base": 5,
    "hp5_lvl": 0.75,
    "mp5_base": 0,
    "mp5_lvl": 0,
    "dam_base": 61,
    "dam_lvl": 4,
    "as_base": 0.625,
    "as_lvl": 1,
    "range": 175,
    "ms": 335,
    "acquisition_radius": 400,
    "selection_radius": 125,
    "pathing_radius": 35,
    "gameplay_radius": 80,
    "as_ratio": 0.625,
    "windup_modifier": 0.5,
    "attack_cast_time": 0.5,
    "attack_total_time": 2.36599993705749,
    "attack_delay_offset": -0.100000001490116,
    "urf_dmg_taken": 0.95
  },
  "rangetype": "Melee",
  "date": "2010-02-24",
  "patch": "V1.0.0.75",
  "changes": "V10.1",
  "role": [
    "Juggernaut"
  ],
  "damage": 3,
  "toughness": 2,
  "control": 1,
  "mobility": 1,
  "utility": 2,
  "style": 80,
  "adaptivetype": "magic",
  "be": 1350,
  "rp": 585,
  "skill_i": {
    "Darkness Rise": {
      "name": "Darkness Rise",
      "champion": "Mordekaiser",
      "skill": "I",
      "effect radius": "375",
      "icon": "Darkness Rise.png",
      "description": "Innate: Mordekaiser's basic attacks deal 40% AP  bonus magic damage on-hit.",
      "description2": "Damaging abilities or basic attacks grant 1 stack per enemy champion or large monster hit, up to a maximum of 3. At 3 stacks, Mordekaiser gains Darkness Rise for 4 seconds. Further basic attacks and abilities against enemy champions and large monsters refresh the duration.",
      "description3": "Darkness Rise: Mordekaiser deals [ 5 − 15.2 (based on level) (+ 30% AP) (+ 1% − 5% (based on level) of target's  maximum health) magic damage per second ][ 0.63 − 1.9 (based on level) (+ 3.75% AP) (+ 0.13% − 0.63% (based on level) of target's  maximum health) magic damage every 0.125 seconds ] to all nearby enemies and gains 3%  bonus movement speed.",
      "targeting": "Self",
      "affects": "Self / Enemies",
      "damagetype": "Magic",
      "spelleffects": "dot",
      "notes": "* Mordekaiser has a stack counter under his health-bar that is not visible to other champions.\n Darkness Rise's damage doesn't refresh Darkness Rise's buff.\n  Dead Man's Plate's bonus damage gives one bonus stack for Darkness Rise, even at 0 Momentum stacks."
    }
  },
  "skill_q": {
    "Obliterate": {
      "name": "Obliterate",
      "champion": "Mordekaiser",
      "skill": "Q",
      "target range": "625",
      "width": "160",
      "cast time": "0.5",
      "cooldown": "9 / 7.75 / 6.5 / 5.25 / 4",
      "icon": "Obliterate.png",
      "description": "Active: Mordekaiser smashes the area in the target direction, dealing magic damage to all enemies hit, increased if it hits only one enemy.",
      "leveling": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "values": [
                5.0,
                12.882352941176471,
                20.764705882352942,
                28.647058823529413,
                36.529411764705884,
                44.411764705882355,
                52.294117647058826,
                60.1764705882353,
                68.05882352941177,
                75.94117647058823,
                83.82352941176471,
                91.70588235294119,
                99.58823529411765,
                107.47058823529412,
                115.3529411764706,
                123.23529411764707,
                131.11764705882354,
                139.0
              ],
              "units": [
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level",
                "by level"
              ]
            },
            {
              "modifier": "+",
              "values": [
                75,
                95,
                115,
                135,
                155
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                60,
                60,
                60,
                60,
                60
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        },
        {
          "attribute": "Damage Increase",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                20,
                25,
                30,
                35,
                40
              ],
              "units": [
                "%",
                "%",
                "%",
                "%",
                "%"
              ]
            }
          ]
        }
      ],
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spellaoe",
      "spellshield": "True",
      "projectile": "False",
      "notes": "* When Obliterate hits a single unit, it is considered a single target ability and uses a different metallic SFX."
    }
  },
  "skill_w": {
    "Indestructible": {
      "name": "Indestructible",
      "champion": "Mordekaiser",
      "skill": "W",
      "cooldown": "14 / 13 / 12 / 11 / 10",
      "icon": "Indestructible.png",
      "description": "Passive: Mordekaiser stores 35% of damage he deals and 15% of damage he takes, reduced by 75% against non-champion sources, as Potential Shield on his secondary resource bar, up to  30% of his maximum health. The Potential Shield decays by 8 − 25 (based on level) every second after not dealing or taking damage for 1 second, down to a minimum of 5% of his maximum health.",
      "description2": "Active - First Cast: Mordekaiser consumes all his current Potential Shield to  shield himself for 4 seconds for the same amount. At start the shield decays very slowly but exponentially increases near the end. After 0.25 seconds he can re-cast the ability.",
      "icon3": "Indestructible 2.png",
      "description3": "Active - Second Cast: Mordekaiser consumes the remaining shield,  healing for a percentage of the amount.",
      "leveling3": [
        {
          "attribute": "Healing",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                40,
                42.5,
                45,
                47.5,
                50
              ],
              "units": [
                "%",
                "%",
                "%",
                "%",
                "%"
              ]
            }
          ]
        }
      ],
      "targeting": "Self",
      "affects": "Self",
      "notes": "* No additional details."
    }
  },
  "skill_e": {
    "Death's Grasp": {
      "name": "Death's Grasp",
      "champion": "Mordekaiser",
      "skill": "E",
      "target range": "700 / 900",
      "width": "200",
      "speed": "3000",
      "cast time": "0.25",
      "cooldown": "24 / 21 / 18 / 15 / 12",
      "icon": "Death's Grasp.png",
      "description": "Passive: Mordekaiser gains  magic penetration.",
      "leveling": [
        {
          "attribute": "Magic Penetration",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                5,
                7.5,
                10,
                12.5,
                15
              ],
              "units": [
                "%",
                "%",
                "%",
                "%",
                "%"
              ]
            }
          ]
        }
      ],
      "description2": "Active: After 0.5 seconds, Mordekaiser  pulls enemies in the targeted area for 250 units, dealing magic damage.",
      "leveling2": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                80,
                95,
                110,
                125,
                140
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                60,
                60,
                60,
                60,
                60
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        }
      ],
      "targeting": "Direction/Ground",
      "affects": "Self, Enemies",
      "damagetype": "Magic",
      "spelleffects": "aoe",
      "spellshield": "True",
      "projectile": "false",
      "notes": "* No additional notes."
    }
  },
  "skill_r": {
    "Realm of Death": {
      "name": "Realm of Death",
      "champion": "Mordekaiser",
      "skill": "R",
      "target range": "650",
      "effect radius": "1200",
      "cooldown": "140 / 130 / 120 / 110 / 100",
      "icon": "Realm of Death.png",
      "description": "Active: Mordekaiser  slows the targeted enemy champion by 75% for 0.5 seconds. If the target is still in range and targetable by the end of the duration they're  banished together with Mordekaiser to the Death Realm for 7 seconds.",
      "description2": "Units between realms see each other as spirits, considering each other dead and negating any interactions between the two. Only the target and Mordekaiser will enter the realm; other champions cannot follow them. Everything that occurs inside the Death Realm is hidden, and all non-champion pets still inside are destroyed at the end.",
      "description3": "For the same duration, Mordekaiser also reduces the target's current  attack damage,  ability power,  total attack speed,  maximum health,  armor,  magic resist, and size by 10%, in addition to gaining them for himself. If Mordekaiser kills his target while inside, he keeps their partial stats until they respawn.",
      "description4": "If one of the two affected champions leave the Death Realm, because of having died or having it dispelled, the other will do so as well, but the stats will remain stolen for the full duration.",
      "targeting": "Unit",
      "affects": "Enemies",
      "spellshield": "true",
      "projectile": "false",
      "notes": "* The ability will cancel and go on cooldown after the cast time if:\n The target is  unstoppable, cc-immune or  spell shielded.\n He targets a decoy or  Sion's  Glory in Death.\n\n The ability will cancel but will not go on cooldown if:\n He loses  sight of his target.\n The target is too far away.\n The target becomes  untargetable.\n The target dies.\n\n If the target's health is lower than the amount that should be stolen, they will be brought down to 1 health. Mordekaiser will still get the usual amount of maximum health.\n The boundaries are not considered terrain ( exception), but enemies that try to move out of the area will be displaced back inside. \n Abilities such as  Comet of Legend and  Keeper's Verdict will cap their effect range to the boundary. Targets will stop at the boundary even after it expired.\n\n Multiple Death Realms spawned will exist in the same dimension, allowing champions to see and interact with champions bound to other circles. Champions are only affected by their boundaries and are not able to see the others.\n  Tahm Kench's  Devour can carry a target outside of their circle, but they will be displaced back inside once  Regurgitated. \n An active  Assault and Battery on a target outside the perimeter will cause  Vi to continue her charge until her circle ends. She can knockback and damage secondary targets multiple times.\n\n The transition in and out of the Death Realm doesn't interrupt channels and doesn't affect the target's commands. Being in Death Realm can be dispelled if:\n The target uses  Quicksilver Sash or abilities with cc-removals.\n Mordekaiser or the target cast another Realm of Death. The affected champions will remain stuck for the duration of the new circle.\n\n Tether effects will break upon entering the dimension, unless it is between the two champions entering the dimension.\n Structures exist in all realms at the same time, and  turrets will target normally as if all units were in the same realm.\n Effects interactions:\n  The Hextech Ultimatum, catching a  Spinning Axe,  Timewinder,  Null Zone,  Twisted Advance,  Worked Grounds,  Gravity Field,  Satchel Charge,  Rift Scuttler's  Speed Shrine,  Statikk Shiv and gaining  Zeke's Convergence  area of effect are exceptions and may still take effect between dimensions.\n Effects such as  Requiem,  Absolute Zero,  Grand Starfall and  Final Spark will only deal damage to enemies of the dimension they're in at time of cast. Ending the channel or cast time while inside another dimension will not do damage to nearby enemies.\n  Shuriken Flip may be re-cast inside the Death Realm even if its target is outside it, but  Akali will stop dashing upon colliding with the boundary.\n  Fear Beyond Death may not be re-cast while his victim is not in the same realm as him, but an already chained foe will still continue to be reeled in and executed. The  fear is cast in the realm Urgot is in.\n  Void Shift dispels from Realm of Death's slow, making it vulnerable to the Death Realm.\n  Ball will instantly return back to her if she's in another dimension.\n Controllable pets and decoys are still controllable between realms.\n\n PENDING FOR TEST:\n  Tahm Kench  Devours the target affected by Death Realm before it ends.\n\n The  nearsight from  Nocturne's  Paranoia does not affect a target’s  sight radius while in the Death Realm.\n Unless Mordekaiser and  Nocturne are in the same dimension."
    }
  }
}