{
  "id": 516,
  "apiname": "Ornn",
  "title": "The Fire below the Mountain",
  "attack": 5,
  "defense": 9,
  "magic": 3,
  "difficulty": 2,
  "herotype": "Tank",
  "alttype": "Fighter",
  "resource": "Mana",
  "stats": {
    "hp_base": 590,
    "hp_lvl": 95,
    "mp_base": 340.6,
    "mp_lvl": 45,
    "arm_base": 36,
    "arm_lvl": 4,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 9,
    "hp5_lvl": 0.9,
    "mp5_base": 8.01,
    "mp5_lvl": 0.6,
    "dam_base": 69,
    "dam_lvl": 3.5,
    "as_base": 0.625,
    "as_lvl": 2,
    "range": 175,
    "ms": 335,
    "acquisition_radius": 600,
    "selection_radius": 125,
    "pathing_radius": 25.7665996551513,
    "gameplay_radius": 80,
    "as_ratio": 0.625,
    "attack_cast_time": 0.349999994039535,
    "attack_total_time": 1.60000002384185,
    "urf_dmg_dealt": 1.1,
    "urf_dmg_taken": 0.75
  },
  "rangetype": "Melee",
  "date": "2017-08-23",
  "patch": "V7.17",
  "changes": "V9.22",
  "role": [
    "Vanguard"
  ],
  "damage": 1,
  "toughness": 3,
  "control": 3,
  "mobility": 1,
  "utility": 2,
  "style": 60,
  "adaptivetype": "physical",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "Living Forge": {
      "name": "Living Forge",
      "champion": "Ornn",
      "skill": "I",
      "customlabel": "Disable Time",
      "custominfo": "4",
      "icon": "Living Forge.png",
      "blurb": "Ornn can spend gold to forge non-consumable items anywhere. Additionally, when Ornn reaches level 12 masterwork upgrades for some items become available for Ornn and his team to purchase. Ornn can smith items directly from his forge menu or the shop.",
      "description": "Innate: Ornn gains an additional  10% bonus armor and  10% bonus magic resistance from all sources.",
      "description2": "Living Forge: Ornn can purchase non-consumable items from anywhere on the field by forging them himself, and is also presented a Forge Menu with his recommended items to select to be forged.  Forging takes 4 seconds and the process is interrupted if Ornn enters combat, disabling Living Forge.",
      "description3": "Master Craftman: When Ornn reaches level 12, any upgradable (Masterwork) item Ornn owns or purchases for the rest of the game is upgraded for free, up to a maximum of 2. Additionally, for each level after 12 (level 13, 14, 15 and 16), Ornn can upgrade one of his ally's upgradable items (Masterwork) by getting within 600 range of them and clicking on them, up to a maximum of 1 per ally.\n Masterwork items: \n Attack Damage Items:  Might of the Ruined King,  Molten Edge,  Obsidian Cleaver,  Trinity Fusion,  Youmuu's Wraithblade.\n Ability Power Items:  Luden's Pulse,  Rabadon's Deathcrown,  Zhonya's Paradox.\n Tank Items:  Forgefire Cape,  Frozen Fist,  Infernal Mask.\n Support Items:  Circlet of the Iron Solari,  Salvation.",
      "description4": "Temper: Ornn's basic attacks against  Brittle enemies briefly  knocks them back.",
      "description5": "Enemies made  Brittle by Ornn take 12% − 20.5% (based on Ornn's level) of their maximum health as  bonus magic damage the next time they are  immobilized by Ornn or his allies, consuming Brittle.",
      "targeting": "Passive",
      "affects": "Allies",
      "notes": "*  Gold is only deducted upon completing the channel.\n The reduction in Tenacity will benefit all applicable types of crowd control, not just immobilizes. Effects such as slows, blinds and silences will be empowered without consuming the debuff.\n Despite the in-game tooltip attribute Brittle to  Bellows Breath, it is not required to rank Bellows Breath in order to benefit from the effect. \n PENDING FOR TEST The bonus magic damage inflicted by Brittle is credited to Ornn.\n Mastercraft items and their components are not the same item and so in theory any unnamed passives would stack and any unnamed actives would only put themselves on cooldown upon activated. This is however not true. Actives will always place their counterpart on cooldown, and passives are inconsistent: \n The  Heal and Shield Power from  Redemption and  Salvation stack, granting 20% when having them together.\n  The Black Cleaver and  The Obsidian Cleaver apply each 1 stack (for a total of 2) per instance of physical damage.\n The bonus on-hit damage from  Blade of the Ruined King and  Might of the Ruined King stacks. They however do not apply at the same time. The second on-hit will deal less damage because the target will have less current health because of the first on-hit.\n The auras of  Abyssal Mask and  Infernal Mask do not stack.\n The passive of  Infinity Edge and  Molten Edge do not stack.\n Both passives of  Youmuu's Ghostblade and  Youmuu's Wraithblade do not stack.\n The passive of  Rabadon's Deathcap and  Rabadon's Deathcrown do not stack, and Deathcap's passive will state that it grants 0 AP while using the item."
    }
  },
  "skill_q": {
    "Volcanic Rupture": {
      "name": "Volcanic Rupture",
      "champion": "Ornn",
      "skill": "Q",
      "target range": "800",
      "effect radius": "50",
      "cost": "45",
      "costtype": "Mana",
      "cooldown": "9 / 8.5 / 8 / 7.5 / 7",
      "icon": "Volcanic Rupture.png",
      "blurb": "Ornn slams the ground, sending out a fissure dealing damage and slowing enemies hit. After a small delay, a magma pillar forms at the end location.",
      "description": "Active: Ornn slams the ground, sending a fissure in the target direction that stops at maximum range or 200 units behind a hit enemy champion, dealing  physical damage and  slowing enemies hit by 40% for 2 seconds.",
      "leveling": "Physical Damage:\n20 / 45 / 70 / 95 / 120 (+ 110% AD)",
      "description2": "After a 1.125-second delay, a  magma pillar erupts at maximum range,  knocking aside enemies hit and lingering as impassible terrain for 4 seconds.",
      "description3": "The pillar will not expire while Ornn is  charging.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "Special",
      "notes": "* The fissure will move an 200 units beyond the first champion it hits, not exceeding the maximum range of the ability. It can still damage additional targets.\n The pillar's formation applies brief displacement. Doing so consumes all stacks of brittle on the displaced targets.\n The eruption will occur in front of  Wind Wall.\n If launched in a wall, pillar will try to appear on the other side of the wall, if it cannot the pillar will be destroyed."
    }
  },
  "skill_w": {
    "Bellows Breath": {
      "name": "Bellows Breath",
      "champion": "Ornn",
      "skill": "W",
      "target range": "500",
      "effect radius": "175",
      "cost": "45 / 50 / 55 / 60 / 65",
      "costtype": "Mana",
      "cooldown": "12 / 11.5 / 11 / 10.5 / 10",
      "icon": "Bellows Breath.png",
      "blurb": "Ornn advances unstoppably, breathing fire and shielding himself. Enemies hit by the final gout of flame become Brittle.",
      "description": "Active: Ornn marches  unstoppably in the target direction with 35% reduced movement speed for 0.75 seconds.",
      "description2": "Over the march he belches fire over a cone in front of him, dealing magic damage every 0.15 seconds to enemies hit. The final bout of flame will apply  Brittle for 3 seconds.",
      "leveling2": "Total Magic Damage:\n12 / 13 / 14 / 15 / 16% of target's maximum health\nDamage Per Instance:\n2.4 / 2.6 / 2.8 / 3 / 3.2% of target's maximum health",
      "description3": "Bellows Breath has a minimum damage threshold, which is also the damage dealt to minions. Monsters take modified damage, as well.",
      "leveling3": "Total Minimum/Minion Damage:\n80 / 130 / 180 / 230 / 280\nMinimum/Minion Damage Per Instance:\n16 / 26 / 36 / 46 / 56\n\nTotal Monster Damage:\n155 / 180 / 205 / 230 / 255\nMonster Damage Per Instance:\n31 / 36 / 41 / 46 / 51",
      "targeting": "Self",
      "affects": "Self / Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "Special",
      "projectile": "False",
      "notes": "* The belch deals 5 instances of damage.\n The final instance of damage will be blocked by spell shields and won't apply Brittle."
    }
  },
  "skill_e": {
    "Searing Charge": {
      "name": "Searing Charge",
      "champion": "Ornn",
      "skill": "E",
      "target range": "800",
      "effect radius": "360 / 150",
      "cost": "35 / 40 / 45 / 50 / 55",
      "costtype": "Mana",
      "cooldown": "16 / 15 / 14 / 13 / 12",
      "icon": "Searing Charge.png",
      "blurb": "Ornn charges, dealing damage to enemies he passes through. If Ornn collides with terrain while charging, the impact creates a shockwave around him which deals damage and knocks up enemies.",
      "description": "Active: Ornn  charges forward, dealing physical damage to enemies he passes through, stopping upon colliding with terrain.",
      "leveling": "Physical Damage:\n80 / 125 / 170 / 215 / 260 (+ 40% bonus armor) (+ 40% bonus magic resistance)",
      "description2": "If Ornn collides with terrain while charging he creates a shockwave that deals the same damage and  knocks up enemies within for 1 second. Enemies can only be damaged once by Searing Charge.",
      "description3": "The shockwave destroys  Magma pillars and partially destroys terrain created by enemy champions.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "* Spell shields will block one instance of damage."
    }
  },
  "skill_r": {
    "Call of the Forge God": {
      "name": "Call of the Forge God",
      "champion": "Ornn",
      "skill": "R",
      "target range": "2550",
      "width": "340",
      "speed": "1200 / 100",
      "cast time": "0.5",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "140 / 120 / 100",
      "icon": "Call of the Forge God.png",
      "blurb": "Ornn summons a massive elemental at a location which travels toward him with increasing speed. Enemies run over by the elemental take damage, are slowed and are made Brittle. Ornn can recast the ability to charge into the elemental, redirecting it in the direction he hits it, causing the elemental to affect any enemies it runs over to be knocked up for 1 second, dealing the same damage and re-applying Brittle.",
      "description": "First Cast: Ornn summons an elemental at maximum range in the target direction that stampedes toward him, dealing magic damage and  slowing enemies hit for 2 seconds, as well as applying  Brittle for 3 seconds. The  slow scales with the distance traveled by the elemental, with a minimum of 10%.",
      "leveling": "Magic Damage:\n125 / 175 / 225 (+ 20% AP)\nTotal Magic Damage:\n250 / 350 / 450 (+ 40% AP)\nMaximum Slow:\n40 / 60 / 80%",
      "description2": "While stampeding, Ornn can re-activate Call of the Forge God.",
      "icon3": "Call of the Forge God 2.png",
      "description3": "Second Cast: Ornn  dashes 300 units in the target direction. If Ornn collides with the elemental, he headbutts it, sending it stampeding again in the new direction and empowering it to  knock up enemies hit for 1 second, reduced to 0.5 seconds after the first enemy champion hit. Call of the Forge God can affect enemies twice and applies  Brittle on each hit.",
      "targeting": "Direction / Direction",
      "affects": "Enemies / Elemental",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* The second cast cannot be activated while grounded and will be interrupted by knockdown.\n The dash on the second cast cannot be used to pass through persistent terrain.\n If Ornn does not use or misses the elemental on the second cast, the elemental will continue ~500 units behind the cast location. \n Spell shields will block one instance of damage."
    }
  }
}