{
  "id": 133,
  "apiname": "Quinn",
  "title": "Demacia's Wings",
  "attack": 9,
  "defense": 4,
  "magic": 2,
  "difficulty": 2,
  "herotype": "Marksman",
  "alttype": "Assassin",
  "resource": "Mana",
  "stats": {
    "hp_base": 532.8,
    "hp_lvl": 85,
    "mp_base": 268.8,
    "mp_lvl": 35,
    "arm_base": 28,
    "arm_lvl": 3.5,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 5.5,
    "hp5_lvl": 0.55,
    "mp5_base": 6.972,
    "mp5_lvl": 0.4,
    "dam_base": 59,
    "dam_lvl": 2.4,
    "as_base": 0.668,
    "as_lvl": 3.1,
    "range": 525,
    "ms": 335,
    "selection_radius": 120,
    "pathing_radius": 35,
    "as_ratio": 0.667999982833862,
    "attack_delay_offset": -0.12456139922142,
    "aram_dmg_dealt": 1.08,
    "aram_dmg_taken": 0.92,
    "urf_dmg_dealt": 1.15
  },
  "fullname": "Quinn and Valor",
  "rangetype": "Ranged",
  "date": "2013-03-01",
  "patch": "V3.03",
  "changes": "V9.4",
  "role": [
    "Specialist"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 3,
  "utility": 1,
  "style": 20,
  "adaptivetype": "physical",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Harrier": {
      "name": "Harrier",
      "champion": "Quinn",
      "skill": "I",
      "effect radius": "525",
      "static": "8 −  2.93 (based on critical strike chance)",
      "icon": "Harrier.png",
      "blurb": "Valor periodically marks enemies as Vulnerable. Quinn's first basic attack against Vulnerable targets will deal bonus physical damage.",
      "description": "Innate:  Valor periodically marks a nearby visible unit as Vulnerable,  revealing them for 4 seconds. Units hit by  Blinding Assault,  Vault and  Skystrike will also be marked as Vulnerable.",
      "description2": "Quinn's next basic attack against a Vulnerable target deals 10 − 95 (based on level) (+ 16% − 50% (based on level) AD)  bonus physical damage.",
      "description3": "Harrier is disabled while  Behind Enemy Lines is active and for a few seconds after a target's mark ends.",
      "targeting": "Auto",
      "affects": "Self",
      "damagetype": "Physical",
      "spelleffects": "False",
      "spellshield": "False",
      "notes": "* Harrier's targeting priority:\n Last unit hit (if it was a small minion it appears to select a different target).\n Lowest-health enemy champion.\n Lowest-health enemy minion.\n\n The enhanced attack will apply other on-hit effects and can  critically strike as normal.\n  Critical strikes do not interact with Harrier's bonus damage.\n As with most on-hit physical damage Harrier's bonus damage will apply  life steal.\n Harrier is consumed but does no damage if the enhanced attack is  dodged,  blocked, or if Quinn is  blinded.\n Harrier's bonus damage will not affect structures even if Quinn is seen using its attack animation against them if the ensuing basic attack was the last one prior.\n Basic attacks that are already in-flight will trigger and consume Harrier mark.\n If a mark was originally applied by  Blinding Assault or  Vault, attacking that Vulnerable target will place Harrier's passive application on a 1 second cooldown instead of its full duration."
    }
  },
  "skill_q": {
    "Blinding Assault": {
      "name": "Blinding Assault",
      "champion": "Quinn",
      "skill": "Q",
      "target range": "1025",
      "effect radius": "210",
      "cost": "50 / 55 / 60 / 65 / 70",
      "costtype": "Mana",
      "cooldown": "11 / 10.5 / 10 / 9.5 / 9",
      "icon": "Blinding Assault.png",
      "blurb": "Quinn calls Valor to mark an enemy and hinder its vision before damaging all enemies in the immediate area.",
      "description": "Active: Quinn signals  Valor to fly forward in a line, stopping when he collides with a unit, dealing physical damage to all nearby enemies and applying  nearsight to the target for 1.5 seconds.",
      "leveling": "Physical Damage:\n20 / 45 / 70 / 95 / 120 (+ 80 / 90 / 100 / 110 / 120% AD) (+ 50% AP)",
      "description2": "Non-champion targets are  disarmed instead for the same duration.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "AoE",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* No additional details."
    }
  },
  "skill_w": {
    "Heightened Senses": {
      "name": "Heightened Senses",
      "champion": "Quinn",
      "skill": "W",
      "effect radius": "2100",
      "cooldown": "50 / 45 / 40 / 35 / 30",
      "icon": "Heightened Senses.png",
      "blurb": "Passively grants Quinn Attack Speed and Movement Speed after she attacks a Vulnerable target. Activate to have Valor reveal a large area nearby.",
      "description": "Passive: Attacking a  Vulnerable target grants Quinn  bonus attack speed and  bonus movement speed for 2 seconds.",
      "leveling": "Bonus Attack Speed:\n20 / 35 / 50 / 65 / 80%\nBonus Movement Speed:\n20 / 25 / 30 / 35 / 40%",
      "description2": "Active: Quinn orders  Valor to  reveal the area around her for 2 seconds.",
      "targeting": "None",
      "affects": "Self",
      "spelleffects": "False",
      "spellshield": "False",
      "notes": "* No additional details."
    }
  },
  "skill_e": {
    "Vault": {
      "name": "Vault",
      "champion": "Quinn",
      "skill": "E",
      "target range": "675",
      "cost": "50",
      "costtype": "Mana",
      "cooldown": "12 / 11 / 10 / 9 / 8",
      "icon": "Vault.png",
      "blurb": "Quinn dashes to an enemy, dealing physical damage and slowing the target's Movement Speed. Upon reaching the target, she leaps off the target, briefly interrupting it, and lands near her maximum Attack Range away from the target.",
      "description": "Active: Quinn  dashes to the target unit,  knocking them back, dealing them physical damage, and  slowing them by 50% which decays over 1.5 seconds, before  leaping back and landing 525 units away from them.",
      "leveling": "Physical damage:\n40 / 70 / 100 / 130 / 160 (+ 20% bonus AD)",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Single target",
      "spellshield": "True",
      "notes": "* Quinn will automatically attempt to attack the target once she completes Vault.\n Unlike its constant cast range Vault's bounce's can vary to allow Quinn to close or to make a gap between herself and an enemy unit (depending on casting position) or even to jump through a wall (if there is enough landing room on the other side).\n Quinn will track and follow the target if they move,  dash, or  blink."
    }
  },
  "skill_r": {
    "Behind Enemy Lines": {
      "name": "Behind Enemy Lines",
      "champion": "Quinn",
      "skill": "R",
      "cost": "100 / 75 / 50 / 25 / 0",
      "costtype": "Mana",
      "icon": "Behind Enemy Lines.png",
      "blurb": "Quinn and Valor team up to fly around at great speed.",
      "description": "Active: Quinn  channels for 2 seconds. Upon completing it successfully,  Valor picks her up and they unite, increasing her  total movement speed and gaining the ability to use  Skystrike.",
      "leveling": "Total Movement Speed Increase:\n70 / 85 / 100 / 115 / 130%",
      "description2": "Taking damage from champions, monsters, or  turrets while Behind Enemy Lines is active disables the  bonus movement speed for 3 seconds.",
      "description3": "If you have a least one point in Behind Enemy Lines, respawning or returning to the summoning platform will spawn  Valor.",
      "targeting": "None",
      "affects": "Self",
      "notes": "* If Quinn uses  Vault while Behind Enemy Lines is active then  Skystrike will activate at her target's location after she bounces."
    },
    "Skystrike": {
      "name": "Skystrike",
      "champion": "Quinn",
      "skill": "R",
      "effect radius": "700",
      "cost": "NO",
      "costtype": "Cost",
      "icon": "Skystrike.png",
      "blurb": "Quinn and Valor team up to fly around at great speed.",
      "description": "Active: Quinn detaches from  Valor, ending  Behind Enemy Lines' effects, and deals 40% AD physical damage to all units around her.",
      "description2": "Launching a basic attack,  Blinding Assault, or  Vault during  Behind Enemy Lines automatically activates Skystrike.",
      "targeting": "None",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "* If Quinn uses  Vault while  Behind Enemy Lines is active then Skystrike will activate at her target's location after she bounces."
    }
  }
}