{
  "id": 421,
  "apiname": "RekSai",
  "title": "the Void Burrower",
  "attack": 8,
  "defense": 5,
  "magic": 2,
  "difficulty": 2,
  "herotype": "Fighter",
  "resource": "Rage",
  "stats": {
    "hp_base": 570,
    "hp_lvl": 85,
    "mp_base": 100,
    "mp_lvl": 0,
    "arm_base": 36,
    "arm_lvl": 3.75,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 7.5,
    "hp5_lvl": 0.65,
    "mp5_base": 0,
    "mp5_lvl": 0,
    "dam_base": 64,
    "dam_lvl": 3,
    "as_base": 0.667,
    "as_lvl": 2,
    "range": 175,
    "ms": 335,
    "acquisition_radius": 600,
    "selection_radius": 100,
    "pathing_radius": 30,
    "as_ratio": 0.666999995708465,
    "attack_cast_time": 0.400000005960464,
    "attack_total_time": 1.5,
    "attack_delay_offset": -0.0916666686534881,
    "aram_dmg_dealt": 1.12,
    "aram_dmg_taken": 0.9,
    "urf_dmg_dealt": 1.05,
    "urf_dmg_taken": 0.8
  },
  "rangetype": "Melee",
  "date": "2014-12-11",
  "patch": "V4.21",
  "changes": "V9.22",
  "role": [
    "Diver"
  ],
  "damage": 2,
  "toughness": 2,
  "control": 2,
  "mobility": 2,
  "utility": 2,
  "style": 30,
  "adaptivetype": "physical",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "Fury of the Xer'Sai": {
      "name": "Fury of the Xer'Sai",
      "champion": "Rek'Sai",
      "skill": "I",
      "icon": "Fury of the Xer'Sai.png",
      "blurb": "While unburrowed Rek'Sai generates Fury with her basic attacks and spells. When burrowed Rek'Sai consumes Fury to heal herself.",
      "description": "Innate: Rek'Sai generates  25 Fury upon dealing damage with basic attack,  Prey Seeker,  Unburrow or  Furious Bite, and loses 20 Fury per second if she hasn't generated any in the last 5 seconds.",
      "description2": "While  burrowed, Rek'Sai consumes her current Fury over 3 seconds,  healing up to  20 − 190 (based on level) health at 100 Fury, stopping once she consumes it all or returns to  full health.",
      "targeting": "Passive",
      "affects": "Self",
      "spelleffects": "Heal",
      "notes": "*  Fury bar changes from Yellow to Red when full."
    }
  },
  "skill_q": {
    "Queen's Wrath": {
      "name": "Queen's Wrath",
      "champion": "Rek'Sai",
      "skill": "Q",
      "effect radius": "325",
      "cooldown": "4",
      "icon": "Queen's Wrath.png",
      "blurb": "Rek'Sai's next 3 basic attacks deal bonus Physical Damage to nearby enemies.",
      "description": "Unburrowed - Active: Rek'Sai's next three basic attacks within 5 seconds deal  bonus physical damage to her target and all surrounding enemies. The damage to the primary target is affected by  critical strike modifiers.",
      "leveling": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                20,
                25,
                30,
                35,
                40
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                50,
                50,
                50,
                50,
                50
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        },
        {
          "attribute": "Total Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                60,
                75,
                90,
                105,
                120
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                150,
                150,
                150,
                150,
                150
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "description2": "Queen's Wrath resets Rek'Sai's basic attack timer.",
      "targeting": "Self / Auto",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Proc",
      "notes": "* Queen's Wrath's bonus damage applies against turrets.\n Queen's Wrath ends and goes on cooldown if Rek'Sai is  burrowed for more than 1 second.\n PENDING FOR TEST: Queen's Wrath has a fixed attack animation forbidding Rek'Sai from attacking faster if she has over 2.0 attack speed.\n Queen's Wrath's enhanced attacks apply other on-hit effects, on-attack effects, and life steal but do not affect structures. The damage to additional targets is not affected by these.\n Does not apply  Hunter's Talisman to surrounding targets.\n PENDING FOR TEST: Queen's Wrath interactions with  dodging,  blocking, and  blinding effects."
    },
    "Prey Seeker": {
      "name": "Prey Seeker",
      "champion": "Rek'Sai",
      "skill": "Q",
      "target range": "1650",
      "cooldown": "12 / 11.5 / 11 / 10.5 / 10",
      "icon": "Prey Seeker.png",
      "blurb": "While Burrowed, Rek'Sai launches a burst of void-charged earth that deals Physical Damage and reveals enemies hit.",
      "description": "Burrowed - Active: Rek'Sai fires a void-charged pulse in a target direction, stopping at the first enemy hit, dealing physical damage to enemies in the area and  revealing them for 2.5 seconds.",
      "leveling": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                60,
                90,
                120,
                150,
                180
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                50,
                50,
                50,
                50,
                50
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            },
            {
              "modifier": "+",
              "values": [
                70,
                70,
                70,
                70,
                70
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        }
      ],
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* No additional details."
    }
  },
  "skill_w": {
    "Burrow": {
      "name": "Burrow",
      "champion": "Rek'Sai",
      "skill": "W",
      "effect radius": "1300",
      "cooldown": "4",
      "icon": "Burrow.png",
      "blurb": "Rek'Sai burrows into the ground, gaining new abilities and increased Movement Speed. Her vision range is reduced and she cannot use basic attacks.",
      "description": "Unburrowed - Active: Rek'Sai burrows into the ground,  self-disarming and reducing her sight radius to 250, but gaining 15 / 20 / 25 / 30 (based on level)  bonus movement speed, becoming  ghosted, accessing an alternate set of basic abilities, and activating Tremor Sense.",
      "description2": "Tremor Sense: Rek'Sai gains  obscured vision of nearby enemy and neutral units in fog of war every 1.5 seconds if they are moving.",
      "targeting": "Self / Buff",
      "affects": "Self",
      "notes": "* Rek'Sai immediately burrows on respawn once she has at least one point in Burrow.\n Burrow has no cast time and does not interrupt Rek'Sai's previous orders.\n Enemies detected by Tremor Sense are displayed as rings on the ground (champions display much larger ones and play a sound effect audible to both allies and enemies).\n Enemies standing still while Rek'Sai is nearby are insensible to Tremor Sense.\n\n Burrow briefly  slows  displaced enemies.\n Rek'Sai does not gain  obscured vision while  nearsighted.\n\n \t  \t \t\t \t\t\t \t\t \t\t \t\t \t\t\tRek'Sai sensing a nearby enemy with Tremors Sense."
    },
    "Unburrow": {
      "name": "Unburrow",
      "champion": "Rek'Sai",
      "skill": "W",
      "effect radius": "160",
      "cooldown": "1",
      "customlabel": "On-Target Cooldown",
      "custominfo": "10",
      "icon": "Unburrow.png",
      "blurb": "While Burrowed, Rek'Sai may cast Un-burrow to knock up and damage nearby enemies.",
      "description": "Burrowed - Active: Rek'Sai bursts out of the ground, dealing physical damage to surrounding enemies and  knocking them aside 250 units. The enemy closest to the center is  knocked up for 1 second instead, and cannot be affected again by Unburrow for some time.",
      "leveling": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                55,
                70,
                85,
                100,
                115
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                80,
                80,
                80,
                80,
                80
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "description2": "Rek'Sai can also trigger Unburrow by issuing an attack command, applying the full  knock up against her target.",
      "targeting": "Auto",
      "affects": "Self / Enemies",
      "damagetype": "Physical",
      "spelleffects": "spellaoe",
      "spellshield": "True",
      "notes": "* Unburrow's per-target  cooldown only applies to targets affected by the full  knock-up, but provides immunity to all effects of the ability.\n Unburrow has no cast time and does not interrupt Rek'Sai's previous orders.\n Unburrow is still considered an ability and is thus stopped by  silence. She can basic attack normally during this time, without leaving unburrow."
    }
  },
  "skill_e": {
    "Furious Bite": {
      "name": "Furious Bite",
      "champion": "Rek'Sai",
      "skill": "E",
      "target range": "250",
      "cooldown": "12",
      "icon": "Furious Bite.png",
      "blurb": "Rek'Sai bites her target, dealing double and True Damage if she has max Fury.",
      "description": "Unburrowed - Active: Rek'Sai bites the target enemy, dealing physical damage.",
      "leveling": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                50,
                60,
                70,
                80,
                90
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                85,
                85,
                85,
                85,
                85
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "description2": "At maximum  Fury the damage is doubled and converted to  true damage.",
      "leveling2": [
        {
          "attribute": "True Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                100,
                120,
                140,
                160,
                180
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                170,
                170,
                170,
                170,
                170
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            }
          ]
        }
      ],
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Physical damage /  True damage",
      "spelleffects": "spell",
      "spellshield": "True",
      "notes": "* No additional details."
    },
    "Tunnel": {
      "name": "Tunnel",
      "champion": "Rek'Sai",
      "skill": "E",
      "target range": "850",
      "cooldown": "26 / 23 / 20 / 17 / 14",
      "customlabel": "On-Target Cooldown",
      "custominfo": "10 / 8 / 6 / 4 / 2",
      "icon": "Tunnel.png",
      "blurb": "While Burrowed, Rek'Sai creates a re-usable, long lasting tunnel. Enemies can destroy it by standing on top of either entrance.",
      "description": "Burrowed - Active: Rek'Sai  dashes in the cursor's direction, leaving behind a Tunnel with two interconnected entrances, lasting up to 10 minutes. The Tunnel can be traversed again if Rek'Sai targets either entrance, shutting down the Tunnel for a few seconds.",
      "description2": "Rek'Sai can have up to 8 pairs of entrances active on the map at the same time. Enemy  champions can destroy a Tunnel by standing on either entrance for 1.5 seconds.",
      "targeting": "Direction",
      "affects": "Self",
      "notes": "* Tunnel entrances can be targeted by allied movement abilities ( Leap Strike,  Shunpo,  Safeguard,  Teleport).\n Tunnel entrances are  visible on allied champions' minimaps, while enemies must first gain  sight of one before it becomes visible on theirs (the opposite entrance is not revealed).\n Enemy champions that destroy a Tunnel are each granted  5.\n Destroying a Tunnel while Rek'Sai is traversing it will not prevent her from reaching the opposite entrance.\n\n Rek'Sai exits a Tunnel the same way she entered (either  Unburrowed or  Burrowed, no switching).\n An  Unburrowed Rek'Sai is considered to be  Burrowed while inside a Tunnel. She will gain her  Burrowed abilities (unusable), suffer from the self  nearsight, and activate Tremor Sense, but will not be  healed by  Fury of the Xer'Sai (unless  Burrowed prior to entering the Tunnel).\n If Rek'Sai enters a Tunnel while unburrowed, Rek'Sai will take longer to enter the tunnel because Rek'Sai will initiate the burrow animation before entering the tunnel. Rek'Sai will unburrow immediately after exiting the Tunnel, knocking up the nearest enemy and applying damage. This does not put  Burrow on cooldown.\n\n Rek'Sai can Tunnel through terrain if she dashes close to them and the wall is thin enough to allow the opposite entrance to spawn on the other side.\n Rek'Sai can be blocked from using a tunnel entrance if a ward is placed directly over it, because the cursor's target selection prioritizes wards over tunnel entrances."
    }
  },
  "skill_r": {
    "Void Rush": {
      "name": "Void Rush",
      "champion": "Rek'Sai",
      "skill": "R",
      "target range": "1500",
      "cooldown": "100 / 95 / 90 / 85 / 80",
      "icon": "Void Rush Mark.png",
      "blurb": "Rek'Sai dives underground and leaps towards her target, dealing massive damage.",
      "description": "Passive: Rek'Sai's applies Mark as Prey to enemy champions she damaged in the last 5 seconds.",
      "icon2": "Void Rush.png",
      "description2": "Active:  Rek'Sai selects an enemy champion with Mark as Prey and  vanishes into the ground. After 1.5 seconds, she emerges from the ground near her target and  pounces  unstoppably a fixed distance in their direction to deal physical damage if she hits them.",
      "leveling2": [
        {
          "attribute": "Physical Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                100,
                175,
                250,
                325,
                400
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                175,
                175,
                175,
                175,
                175
              ],
              "units": [
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD",
                "% bonus AD"
              ]
            },
            {
              "modifier": "+",
              "values": [
                20,
                22.5,
                25,
                27.5,
                30
              ],
              "units": [
                "",
                "",
                "",
                "",
                "% of target's missing health"
              ]
            }
          ]
        }
      ],
      "description3": "The damage can be dodged if the target moves 1500 units away.",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "spell",
      "spellshield": "True",
      "notes": "* Void Rush can be dodged if the target becomes  untargetable.\n Rek'Sai will follow the target even if they  dash or  blink, up to the maximum range.\n Rek'Sai can activate Void Rush while  Burrowed or  Unburrowed.\n She will always emerge as Unburrowed.\n\n The target champion will glow once Rek'Sai  Burrows to them, followed by a global screech (will be heard by enemies even if they don't have  sight of Rek'Sai and/or her destination)."
    }
  }
}