{
  "id": 14,
  "apiname": "Sion",
  "title": "The Undead Juggernaut",
  "attack": 5,
  "defense": 9,
  "magic": 3,
  "difficulty": 1,
  "herotype": "Tank",
  "alttype": "Fighter",
  "resource": "Mana",
  "stats": {
    "hp_base": 545,
    "hp_lvl": 73,
    "mp_base": 330,
    "mp_lvl": 42,
    "arm_base": 32,
    "arm_lvl": 3,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 7.5,
    "hp5_lvl": 0.8,
    "mp5_base": 8,
    "mp5_lvl": 0.6,
    "dam_base": 68,
    "dam_lvl": 4,
    "as_base": 0.679,
    "as_lvl": 1.3,
    "range": 175,
    "ms": 345,
    "acquisition_radius": 600,
    "selection_radius": 125,
    "pathing_radius": 25.7665996551513,
    "gameplay_radius": 80,
    "as_ratio": 0.67900002002716,
    "attack_delay_offset": -0.0509057976305484,
    "aram_dmg_dealt": 0.92,
    "aram_dmg_taken": 1.08,
    "urf_dmg_dealt": 1.1,
    "urf_dmg_taken": 0.85
  },
  "rangetype": "Melee",
  "date": "2009-02-21",
  "patch": "Alpha Week 2",
  "changes": "V9.22",
  "role": [
    "Vanguard"
  ],
  "damage": 2,
  "toughness": 3,
  "control": 3,
  "mobility": 1,
  "utility": 1,
  "style": 65,
  "adaptivetype": "physical",
  "be": 1350,
  "rp": 585,
  "skill_i": {
    "Glory in Death": {
      "name": "Glory in Death",
      "champion": "Sion",
      "skill": "I",
      "icon": "Glory in Death.png",
      "blurb": "After being killed, Sion will reanimate with rapidly decaying Health. His attacks become very rapid, gain 100% Lifesteal and deal bonus physical damage equal to 10% of his target's maximum Health (max 75 to monsters). All his abilities are replaced with Death Surge, which grants a burst of Movement Speed.",
      "description": "Innate: Upon taking fatal damage, Sion becomes  untargetable for 1.5 seconds, after which he enters a frenzy, restoring himself to  100% maximum health but losing 2 − 19 (based on level) every 0.265 seconds, increasing by   70% of the base value    1.4 − 13.3 (based on level)   per subsequent tick.",
      "description2": "Sion can freely move and use basic attacks during this time, gaining  100% life steal, attacking at  1.75 attack speed, and dealing 10% of the target’s maximum health bonus physical damage on-hit, capped at 75 against minions and monsters.",
      "description3": "Glory in Death cannot last more than 60 seconds. Reaching the time will cause Sion to instantly die, regardless of his remaining health. While Glory in Death is active Sion's standard abilities are replaced with  Death Surge.",
      "targeting": "Passive",
      "affects": "Self",
      "damagetype": "Health Cost (modified)",
      "notes": "* Glory in Death will still trigger if Sion is killed by the Nexus Obelisk and will always trigger after other revive effects (e.g  Guardian Angel).\n Sion's death timer starts ticking when he first dies and not when Glory in Death's duration ends.\n If Sion lives longer than his death timer lasts for, he will not revive until Glory in Death has ended. When it has ended, he will revive instantly, which can result in some odd interactions and bugs at times.\n\n Glory in Death does not trigger on clones of Sion, such as with  Test of Spirit.\n Upon death, Sion will drop 'most' non-permanent buffs and debuffs before transitioning into Glory in Death. These effects include undisplayed statuses, for example the 'already stunned by this'-flag of  Veigar's  Event Horizon or  Viktor's  Gravity Field.\n Sion's transition will not remove effects that presist through death, such as  Brand's  Blaze.\n\n All projectiles targeting Sion are destroyed at the start of becoming  untargetable.\n Projectiles created after the fact will still travel to Sion, but only affect him if he's no longer untargetable.\n\n If a projectile is targeting Sion at the end of Glory in Death and he revives instantly, it will not be destroyed.\n At the start of Glory in Death, Sion's mana drops to 0, but will still be affected by mana restoration.\n During Glory in Death Sion: \n Has all sources of self-healing other than  life steal and  spell vamp reduced by 100%.\n This includes item passives such as  Hextech Gunblade and  Blade of the Ruined King's special lifesteal-affected on-hit, as well as runes such as  Ravenous Hunter.\n  Spirit Visage's unique passive is unaffected and furthermore 'lowers' this reduction to 70% due to the way it factors in.\n\n Can  critically strike, but will use no special animation and no special sound effect.\n Can use item actives.\n Cannot use summoner spells.\n Cannot take  Dark Passage.\n Cannot be targeted by  Devour.\n Can use  Magical Journey.\n Cannot be  banished to the  Realm of Death.\n\n Sion's attack speed during Glory in Death is fixed at 1.75 and it's unaffected by attack speed slows/buffs for the duration.\n Buffs that allow for the normal 2.5 attack speed cap to be broken, such as  Lethal Tempo and  Hail of Blades, will also break the upper limit of the 1.75 cap, but not the lower one. This means that while these buffs are active, Sion can exceed 1.75 attack speed, but cannot fall below it.\n After the effect ends, the attack speed cap will not revert to 1.75 but to 2.5. However Sion will still not be able to go below 1.75 attack speed.\n\n Buffs from jungle monsters Sion gains during Glory in Death ( Crest of Cinders,  Crest of Insight) will not be lost once the duration ends.\n By surviving for the full duration of 60 seconds, Sion will suffer 36.4k − 345.5k (based on level) self-damage.\n After Glory in Death ends, the corpse of Sion will retain body block despite being dead on the ground.\n Even though its visuals are present,  Dark Harvest can never be gained from Sion under the effect of Glory in Death.\n Sion cannot  Recall while under the effect of Glory in Death.\n The effect that heals Sion back to full health at the start of Glory in Death cannot be modified by  healing reductions and does not count towards the 'Damage Healed' statistic at the end of game lobby."
    },
    "Death Surge": {
      "name": "Death Surge",
      "champion": "Sion",
      "skill": "I",
      "cooldown": "100 (Resets on Death)",
      "icon": "Death Surge.png",
      "blurb": "Grants a burst of Movement Speed.",
      "description": "Active: Sion gains  50% bonus movement speed that decays over 1.5 seconds.",
      "targeting": "None",
      "affects": "Self",
      "notes": "* Death Surge's will always be ready to use when Glory in Death triggers.\n Once at least one ability has been learned, Death Surge can be cast using any ability key, even the unlearned ones.\n\n Death Surge's cooldown is affected by Cooldown reduction and thus the spell is technically able to be used up to twice during Glory in Death, but not in practice.\n Despite showing a shorter cooldown when hovering the ability in the ultimate-slot in the HUD, Death Surge is not actually affected by  Ultimate Hunter.\n\n Casting Death Surge does not add a stack to  Spellbinder."
    }
  },
  "skill_q": {
    "Decimating Smash": {
      "name": "Decimating Smash",
      "champion": "Sion",
      "skill": "Q",
      "target range": "300 − 600 (based on channel time)",
      "effect radius": "300",
      "cost": "45",
      "costtype": "Mana",
      "cooldown": "10 / 9 / 8 / 7 / 6",
      "icon": "Decimating Smash.png",
      "blurb": "Sion charges a powerful swing in an area in front of himself that will deal damage to enemies when released. If he charges for enough time, enemies hit by the swing will also be knocked up and stunned.",
      "description": "First Cast: Sion  channels for up to 2 seconds to swing in the target direction, increasing Decimating Smash's damage every 0.25 seconds, up to a bonus cap for the base damage and up to 200% bonus for the AD ratio.",
      "leveling": "Max. Base Damage Increase:\n133.33 / 150 / 166.67 / 183.33 / 200%\n\nMinimum Damage:\n30 / 50 / 70 / 90 / 110 (+ 45 / 52.5 / 60 / 67.5 / 75% AD)\nMaximum Damage:\n70 / 135 / 200 / 265 / 330 (+ 135 / 157.5 / 180 / 202.5 / 225% AD)",
      "description2": "If the channel is  interrupted, Decimating Smash goes on a reduced  2 seconds cooldown, but no mana is refunded.",
      "description3": "Second Cast: Sion flails his axe, dealing physical damage to all enemies in the target area, and  slowing them by 50% for 0.25 seconds. Decimating Smash deals 60% damage against minions.",
      "leveling3": "Minimum Minion Damage:\n18 / 30 / 42 / 54 / 66 (+ 27 / 31.5 / 36 / 40.5 / 45% AD)\nMaximum Minion Damage:\n42 / 81 / 120 / 159 / 198 (+ 81 / 94.5 / 108 / 121.5 / 135% AD)",
      "description4": "If Decimating Smash was charged for at least 1 second, Sion instead slams his axe down,  knocking up all enemies hit for 0.5 − 1 (based on channel time) seconds and  stunning them for 1.25 − 2.25 (based on channel time) seconds.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "False",
      "notes": "* A flash of the axe and change in brightness of the indicator on the ground indicates when the 1 second time frame is reached.\n The damage of Decimating Smash is calculated when it is released. Gaining AD or upgrading the ability during its channel will update the damage of the coming hit. \n Even though the cooldown starts when the ability is released, it will not be changed by gaining or losing CDR, or upgrading the ability, during the cast time.\n\n The indicator is visible to the enemy only if they  see Sion.\n If Sion is not  visible and Decimating Smash is released before 1 second, enemies may have vision of the resulting effects from the axe swing in front of Sion, if it's in their  vision, however they will not when the ability is released after 1 second. After this, it becomes noticeable only if it hits an enemy, since the visual and sound effects are played on-target. None of the VFX/SFX are noticeable when you do not have  vision of it.\n\n Forced movement without a  stun component like  Spectral Cutlass (or the stun being  cleansed previously) will not stop Sion from starting or continuing to channel. Its direction will not change with Sion's travel, however the location will update with him.\n The location of the indicator updates at the beginning of the ability, at 1 second and at release.\n\n The hitbox of the ability is center-to-center, but goes slightly beyond the indicator at its front. It has a trapezoid shape, expanding towards the front."
    }
  },
  "skill_w": {
    "Soul Furnace": {
      "name": "Soul Furnace",
      "champion": "Sion",
      "skill": "W",
      "effect radius": "550",
      "cost": "65 / 70 / 75 / 80 / 85",
      "costtype": "Mana",
      "cooldown": "15 / 14 / 13 / 12 / 11",
      "icon": "false",
      "blurb": "Sion shields himself and can reactivate after 3 seconds to deal Magic Damage to enemies nearby. When Sion kills enemies, he passively gains maximum Health.",
      "description": "Passive: Sion permanently gains  4 bonus health whenever he kills an enemy, increased to 15 bonus health against large enemies and enemy champion  takedowns.",
      "icon2": "Soul Furnace.png",
      "description2": "First Cast: Sion  shields himself for up to 6 seconds. After 3 seconds, Soul Furnace can be reactivated to detonate the shield, detonating automatically if it persists for the full duration.",
      "leveling2": "Shield Strength:\n50 / 75 / 100 / 125 / 150 (+ 40% AP) (+ 8 / 9 / 10 / 11 / 12% maximum health)",
      "icon3": "Soul Furnace 2.png",
      "description3": "Second Cast: Soul Furnace's shield detonates to deal  magic damage to enemies around Sion, capped at 400 against minions and monsters.",
      "leveling3": "Magic Damage:\n40 / 65 / 90 / 115 / 140 (+ 40% AP) (+ 10 / 11 / 12 / 13 / 14% of target's maximum health)",
      "targeting": "None",
      "affects": "Self, Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "* A buff icon in the HUD will show the current shield strength, so that the player can better calculate the timing of the second cast.\n Soul Furnace has no cast time and does not interrupt Sion's previous orders.\n Both casts of Soul Furnace can be used during any of Sion's other abilities. The only exception to this is the release of  Decimating Smash.\n Soul Furnace's first cast does not break stealth.\n\n Gaining or losing AP or health, or ranking up the skill while the shield is active will not change its shield value but it will change the damage of the  explosion.\n The cooldown of Soul Furnace begins once the shield is removed.\n Gaining or losing CDR between the first cast and breaking of the shield will affect the resuming cooldown accordingly.\n\n Soul Furnace's bonus health can be obtained by any of Sion's damage sources (basic attacks, abilities, summoner spells, item actives).\n This does not include last hits transferred to Sion artificially, through effects such as  Spoils of War,\n If the gold efficiency of a  Ruby Crystal is considered 100%, each last hit or  takedown after Soul Furnace has been learned can be considered worth an extra  10.6 or  40g."
    }
  },
  "skill_e": {
    "Roar of the Slayer": {
      "name": "Roar of the Slayer",
      "champion": "Sion",
      "skill": "E",
      "target range": "800 / 1300",
      "cost": "35 / 40 / 45 / 50 / 55",
      "costtype": "Mana",
      "cooldown": "12 / 11 / 10 / 9 / 8",
      "icon": "Roar of the Slayer.png",
      "blurb": "Sion fires a short range shockwave that damages and slows and reduces the Armor of the first enemy hit. If the shockwave hits a minion or monster, it will be knocked back, damaging and slowing all enemies that it passes through.",
      "description": "Active: Sion bellows in the target direction, dealing magic damage to the first enemy hit,  slowing them for 2.5 seconds as well as  reducing their  armor by 20% for 4 seconds.",
      "leveling": "Magic Damage:\n65 / 100 / 135 / 170 / 205 (+ 55% AP)\nSlow:\n40 / 45 / 50 / 55 / 60%",
      "description2": "If the target is a  minion or non-epic  monster, it is  knocked back, in the same line, up to 1300 units away from Sion, dealing the same damage and applying the same effects to all enemies it passes through. Projectile enemies take their damage once they are stopped, by either colliding with terrain or reaching the end of their trajectory.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "Special",
      "notes": "* Unlike the intial single-target projectile, a thrown minion or monster is not blocked by  Wind Wall or  Unbreakable.\n Minions and monsters targeted by Roar of the Slayer are  invulnerable for the displacement's duration but cannot go through walls.\n A knocked back unit will always travel between 500 and 1300 units, unless colliding with terrain.\n Additionally, the unit will provide a small radius of vision during the travel.\n\n Gaining or losing AP, or upgrading the ability while its projectile is traveling will change its damage for every future hit. This applies to both the intial single-target projectile, as well as the minion-projectile."
    }
  },
  "skill_r": {
    "Unstoppable Onslaught": {
      "name": "Unstoppable Onslaught",
      "champion": "Sion",
      "skill": "R",
      "speed": "950",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "140 / 100 / 60",
      "icon": "Unstoppable Onslaught.png",
      "blurb": "Sion charges in a direction, ramping up speed over time. He can steer his charge slightly with the mouse cursor location. When he collides with an enemy he deals damage and knocks them up based on the distance he has charged.",
      "description": "Active: Sion  charges forward in the target direction for up to 8 seconds during which he is  pacified, immune to crowd control, and can steer at a slow turn rate.",
      "icon2": "Unstoppable Onslaught 2.png",
      "description2": "Upon re-activating the ability or reaching the end of the duration, Sion  leaps forward 200-units, slamming the ground around him upon landing. Colliding with an enemy champion or terrain will stop Unstoppable Onslaught prematurely. Charging into terrain will also  stun Sion for 0.5 seconds.",
      "description3": "Both the charge and slam deal physical damage to all enemies and  turrets struck, with the base damage increasing by 0% − 166.67% (based on charge time), the bonus AD ratio increasing by 0% − 100% (based on charge time), and  slowing them for 3 seconds.",
      "leveling3": "Minimum Physical Damage:\n150 / 300 / 450 (+ 40% bonus AD)\nMaximum Physical Damage:\n400 / 800 / 1200 (+ 80% bonus AD)\n\nSlow:\n40 / 45 / 50%",
      "description4": "When not colliding with terrain Sion will additionally  pull,  knock up and  stun all enemies around him for a combined 0.75 − 1.75 (based on charge time) seconds.",
      "targeting": "Direction",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "* When Sion casts Unstoppable Onslaught a global warning can be heard.\n Unstoppable Onslaught does not remove any active crowd control (e.g nearsight), however, Sion remains fully immune to crowd control through the whole effect including the final leap. For example, striking Sion with  Blinding Dart right before the effect ends will not cause him to be blinded when the charge or leap finishes.\n After starting the charge Sion's movement speed cannot be artificially changed.\n\n After reaching maximum damage and stun duration (at 3 seconds) Sion will transition from using his haste animation to his unique charging one.\n Reaching the threshold on  Mecha Zero Sion changes his particle effects instead, most notably the 'Boosters' behind the train.\n\n PENDING FOR TEST The maximum turning angle (per distance traveled) of the charge is constant. The turning radius is a constant value, estimated at roughly 2500 units.\n This is not true when starting at insanely high values of movement speed; Sion will be facing the direction of the cast in his idle animation and turn at a much lower rate based on the speed he started with until his speed returns to the usual 950 MS limit.\n That the turning angle is not based on time can easily be seen in practice when a Sion charges in-place due to bugs.\n\n Sion does not always crash with terrain immediately upon touching it, enabling the player to turn beyond his maximum turning angle.\n Casting the ability at point blank of a terrain will most often automatically change the charge's direction.\n This is not usually possible with player-generated terrain.\n\n Unstoppable Onslaught cannot charge through but can leap over player-created terrain (i.e  Crystallize).\n The charge will not collide with an allied  Emperor's Divide.\n\n PENDING FOR TEST The distance between Sion's center and the center of the ground slam scales slightly with movement speed. This is suspected because running into a wall within half a second of charge time after starting at multiple thousands of movement speed shows a considerable difference, however this could also be due to a bug.\n PENDING FOR TEST The leap appears to always have the same speed regardless of Sion's, at roughly 750.\n Hovering the cursor on the HUD (e.g minimap / champion portraits) does not affect the cast and steering of Unstoppable Onslaught.\n Even though the ability doesn't have a distance limit, casting the ability outside its cast range (7500 units), will have Sion attempt to walk in range before charging.\n Even though the cooldown of Unstoppable Onslaught starts at the end of the effect, gaining or losing CDR, or upgrading the ability during the effect, will not change the resuming cooldown.\n However, gaining  Presence of Mind's effect during Unstoppable Onslaught does result in a lowered cooldown."
    }
  }
}