{
  "id": 72,
  "apiname": "Skarner",
  "title": "the Crystal Vanguard",
  "attack": 7,
  "defense": 6,
  "magic": 5,
  "difficulty": 1,
  "herotype": "Fighter",
  "alttype": "Tank",
  "resource": "Mana",
  "stats": {
    "hp_base": 601.28,
    "hp_lvl": 90,
    "mp_base": 320,
    "mp_lvl": 40,
    "arm_base": 38,
    "arm_lvl": 3.8,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 9,
    "hp5_lvl": 0.85,
    "mp5_base": 7.206,
    "mp5_lvl": 0.45,
    "dam_base": 65,
    "dam_lvl": 4.5,
    "as_base": 0.625,
    "as_lvl": 2.1,
    "range": 125,
    "ms": 335,
    "acquisition_radius": 600,
    "selection_radius": 130,
    "pathing_radius": 50,
    "gameplay_radius": 80,
    "as_ratio": 0.625,
    "windup_modifier": 0.5,
    "attack_delay_offset": -0.11999999731779
  },
  "rangetype": "Melee",
  "date": "2011-08-09",
  "patch": "V1.0.0.123",
  "changes": "V9.7",
  "role": [
    "Diver"
  ],
  "damage": 1,
  "toughness": 3,
  "control": 3,
  "mobility": 1,
  "utility": 1,
  "style": 45,
  "adaptivetype": "Mixed,Physical",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Crystal Spires": {
      "name": "Crystal Spires",
      "champion": "Skarner",
      "skill": "I",
      "effect radius": "1600",
      "icon": "Crystal Spires.png",
      "blurb": "Skarner's presence causes crystals to spawn in set locations around the map. While near crystals his team owns, Skarner gains tremendous movement speed, attack speed, and mana regeneration.",
      "description": "Crystal Spires: Skarner's presence causes a number of Crystal Spires to appear at set points on the battlefield, which can be captured by  champions who stand near them for 2 seconds. Once captured, Crystal Spires are owned until contested and the defending team can stand on the spire to prevent the opposing team from capturing it.",
      "description2": "Crystal Spires grant  30 split among its captors upon being captured, or  15 if only a single champion participated in its capture, and provide  sight around them for 1.5 seconds upon being captured, becoming impossible to recapture for 15 seconds.",
      "description3": "Crystal Charge: While within range of a Crystal Spire controlled by his team, or while an enemy is  stunned with  Fracture or  suppressed with  Impale, Skarner gains 70 − 120 (based on level)  bonus movement speed, 43% − 160% (based on level)  bonus attack speed and restores  2% maximum mana every second.",
      "targeting": "Passive",
      "affects": "Self",
      "notes": "* Crystal Spire distribution is as follows:\n Six in Summoner's Rift\n One beside  Baron Nashor's pit\n One beside  Dragon's pit\n One nearby each  Red Brambleback\n One nearby each  Blue Sentinel\n\n Five in Twisted Treeline\n One within  Vilemaw's pit\n One nearby each  Golem\n One nearby each  Giant Wolf\n\n Five in Howling Abyss\n One in each brush\n One in each team's base (below each inhibitor)\n\n\n The Crystal Spires near  Baron Nashor,  Dragon,  Vilemaw, and the central brush in Howling Abyss begin the game as neutral and can only be captured after minions spawn (1:30) and onwards.\n All other spires begin as either allied or enemy (depending on position) but can be captured as soon as the game starts.\n\n No additional Crystal Spires are spawned in One for All or mirrored matches\n Every ally Skarner will receive the bonuses so long as the Crystal Spires are in allied control."
    }
  },
  "skill_q": {
    "Crystal Slash": {
      "name": "Crystal Slash",
      "champion": "Skarner",
      "skill": "Q",
      "effect radius": "350",
      "cost": "10 / 11 / 12 / 13 / 14",
      "costtype": "Mana",
      "cooldown": "3.5 / 3.25 / 3 / 2.75 / 2.5",
      "icon": "Crystal Slash.png",
      "blurb": "Skarner lashes out with his claws, dealing physical damage to all nearby enemies and charging himself with Crystal Energy for several seconds if a unit is struck. If he casts Crystal Slash again while powered by Crystal Energy, he deals bonus magic damage.",
      "description": "Active: Skarner deals  physical damage to all enemies in range.",
      "leveling": "Physical Damage:\n33 / 36 / 39 / 42 / 45% AD",
      "description2": "If an enemy is hit, subsequent uses of Crystal Slash within 4 seconds deal  bonus magic damage.",
      "leveling2": "Bonus Magic Damage:\n33 / 36 / 39 / 42 / 45% AD (+ 30% AP)\nTotal Mixed Damage:\n66 / 72 / 78 / 84 / 90% AD (+ 30% AP)",
      "description3": "Basic attacks against non-structures reduce Crystal Slash's  cooldown by 0.25 seconds, quadrupled to 1 against enemy champions.",
      "targeting": "None",
      "affects": "Enemies, Self",
      "damagetype": "magic",
      "spelleffects": "aoe",
      "spellshield": "Special",
      "notes": "* Crystal Slash has no cast time and does not interrupt Skarner's previous orders.\n  Spell shield will block the damage but will not prevent Skarner from triggering the bonus effect."
    }
  },
  "skill_w": {
    "Crystalline Exoskeleton": {
      "name": "Crystalline Exoskeleton",
      "champion": "Skarner",
      "skill": "W",
      "cost": "60",
      "costtype": "Mana",
      "cooldown": "13 / 12.5 / 12 / 11.5 / 11",
      "icon": "Crystalline Exoskeleton.png",
      "blurb": "Skarner gains a shield and has increased Movement Speed while the shield persists.",
      "description": "Active: Skarner  shields himself for up to 6 seconds, gaining initial  bonus movement speed that accelerates by 100% over 3 seconds while the shield holds.",
      "leveling": "Shield Strength:\n10 / 11 / 12 / 13 / 14% maximum health (+ 80% AP)\nInitial Bonus Movement Speed:\n8 / 10 / 12 / 14 / 16%\nMaximum Bonus Movement Speed:\n16 / 20 / 24 / 28 / 32%",
      "targeting": "None",
      "affects": "Self",
      "notes": "* Crystalline Exoskeleton has no cast time and does not interrupt Skarner's previous orders."
    }
  },
  "skill_e": {
    "Fracture": {
      "name": "Fracture",
      "champion": "Skarner",
      "skill": "E",
      "target range": "1000",
      "collision radius": "35",
      "speed": "1500",
      "cost": "55",
      "costtype": "Mana",
      "cooldown": "14 / 13.5 / 13 / 12.5 / 12",
      "icon": "Fracture.png",
      "blurb": "Skarner summons a blast of crystalline energy which deals damage to enemies struck and slows them. Basic attacking these enemies within a short window will stun them.",
      "description": "Active: Skarner launches a blast of energy in the target direction, dealing magic damage to all enemies struck and  slowing them for 2.5 seconds, as well as marking them with  Crystal Venom for 5 seconds. The blast's speed slows down each time it passes through an enemy unit.",
      "leveling": "Magic Damage:\n40 / 65 / 90 / 115 / 140 (+ 20% AP)\n\nSlow:\n30 / 35 / 40 / 45 / 50%",
      "icon2": "Crystal Venom.png",
      "description2": "Skarner's next basic attack against a target marked with  Crystal Venom consumes the mark to deal them bonus physical damage and  stun them for 1.25 seconds.",
      "leveling2": "Bonus Physical Damage:\n30 / 50 / 70 / 90 / 110",
      "description3": "Every time he  stuns a target with Fracture or  suppresses an enemy with  Impale, Fracture's  cooldown is reduced by the corresponding duration of the disable.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic / Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Fracture will be disabled during  Impale.\n POSSIBLE BUG:  Crystal Venom will be consumed but deal no damage or apply the  stun if  Skarner is  blinded / the attack is  dodged or  blocked.\n The attack will be blocked and counted as a  immobilize effect for  Fiora's  Riposte."
    }
  },
  "skill_r": {
    "Impale": {
      "name": "Impale",
      "champion": "Skarner",
      "skill": "R",
      "target range": "350",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "120 / 110 / 100 / 90 / 80",
      "icon": "Impale.png",
      "blurb": "Skarner suppresses an enemy champion and deals damage to it. During this time, Skarner can move freely and will drag his helpless victim around with him. When the effect ends, the target will be dealt additional damage.",
      "description": "Active: Skarner  roots the target enemy for 0.25 seconds, during which he rears his stinger and brings it down, dealing them magic damage, 60% AD physical damage and being able to  drag them for 1.75 seconds. At the end of the duration, the target takes the same damage again.",
      "leveling": "Magic Damage:\n20 / 40 / 60 / 80 / 100 (+ 50% AP)\nTotal Magic Damage:\n40 / 80 / 120 / 160 / 200 (+ 100% AP)\nTotal Mixed Damage:\n40 / 80 / 120 / 160 / 200 (+ 100% AP) (+ 120% AD)",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "magic",
      "spelleffects": "single",
      "spellshield": "True",
      "notes": "* The suppression will break if the target becomes  untargetable ( Tempered Fate,  Realm Warp, Devour).\n The target will not take Impale's secondary damage if the suppression is removed (Quicksilver,  Remove Scurvy).\n Impale is canceled (but does not go on cooldown) if Skarner loses  sight of his target or if they move 800 units away from him (whether by being mid-dash, removing the root and backing away, or Skarner being displaced) during the cast time.\n Skarner's target will follow him around regardless of how they move (walking, dashing,  Buster Shot,  Dark Passage).\n While Impale's suppression is active, and for the purposes of direction-conditioned abilities ( Petrifying Gaze,  Mocking Shout) Skarner is considered to be facing in the direction he is moving and not the one his model is facing."
    }
  }
}