{
  "id": 17,
  "apiname": "Teemo",
  "title": "the Swift Scout",
  "attack": 5,
  "defense": 3,
  "magic": 7,
  "difficulty": 1,
  "herotype": "Marksman",
  "alttype": "Assassin",
  "resource": "Mana",
  "stats": {
    "hp_base": 528,
    "hp_lvl": 90,
    "mp_base": 334,
    "mp_lvl": 20,
    "arm_base": 24.3,
    "arm_lvl": 3.75,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 5.5,
    "hp5_lvl": 0.65,
    "mp5_base": 9.6,
    "mp5_lvl": 0.45,
    "dam_base": 54,
    "dam_lvl": 3,
    "as_base": 0.69,
    "as_lvl": 3.38,
    "range": 500,
    "ms": 330,
    "acquisition_radius": 500,
    "selection_radius": 100,
    "pathing_radius": 30,
    "gameplay_radius": 55,
    "as_ratio": 0.689999997615814,
    "attack_delay_offset": -0.0842565968632698,
    "aram_dmg_dealt": 0.88,
    "urf_dmg_dealt": 0.95
  },
  "rangetype": "Ranged",
  "date": "2009-02-21",
  "patch": "Alpha Week 2",
  "changes": "V9.24",
  "role": [
    "Specialist"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 1,
  "utility": 2,
  "style": 30,
  "adaptivetype": "magic",
  "be": 1350,
  "rp": 585,
  "skill_i": {
    "Guerrilla Warfare": {
      "name": "Guerrilla Warfare",
      "champion": "Teemo",
      "skill": "I",
      "icon": "Guerrilla Warfare.png",
      "blurb": "If Teemo stands still and takes no actions for a short duration, he becomes Invisible indefinitely. If he's in brush, Teemo can enter and maintain his Invisibility while moving. After leaving Invisibility, Teemo gains the Element of Surprise, increasing his Attack Speed for 3 seconds.",
      "description": "Innate: Teemo gains  invisibility if he stands still for 1.5 seconds without acting or being acted upon. He will remain stealthed so long as he doesn't move, doesn't act, or is  displaced. If within a  brush, Teemo gains stealth after 1.5 seconds even while moving and may move freely within its boundaries without breaking stealth.",
      "icon2": "Element of Surprise.png",
      "description2": "Element of Surprise: When Teemo breaks stealth, he gains the Element of Surprise for 3 seconds, granting him  20 / 40 / 60 / 80% (based on level) bonus attack speed.",
      "targeting": "Passive",
      "affects": "Self",
      "notes": "* Guerrilla Warfare will not grant Teemo stealth as long as he is taking damage (damage taken once stealthed will not reveal Teemo).\n Teemo will break Guerrilla Warfare's stealth by using certain summoner spells ( Clarity,  Dash,  Exhaust,  Heal,  Ignite,  Mark,  Recall,  Smite,  Teleport) and certain trinkets ( Oracle Lens) but not when placing wards, when using consumable items, or when using  Flash to get within a brush (while already stealthed beforehand).\n If Teemo triggers Element of Surprise twice in less than 3 seconds he will only refresh the bonus attack speed's duration (it will not stack with itself)."
    }
  },
  "skill_q": {
    "Blinding Dart": {
      "name": "Blinding Dart",
      "champion": "Teemo",
      "skill": "Q",
      "target range": "680",
      "cost": "70 / 75 / 80 / 85 / 90",
      "costtype": "Mana",
      "cooldown": "8",
      "icon": "Blinding Dart.png",
      "blurb": "Obscures an enemy's vision with a powerful venom, dealing damage to the target unit and blinding it for the duration.",
      "description": "Active: Teemo shoots a dart at the target enemy, dealing them  magic damage and  blinding them for a short duration.",
      "leveling": "Magic Damage:\n80 / 125 / 170 / 215 / 260 (+ 80% AP)\nBlind Duration:\n1.5 / 1.75 / 2 / 2.25 / 2.5",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Single target",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Abilities that grant empowered attacks may go through blind, dealing damage and / or applying their effects. The situations where this happens are all case to case.\n Blinding Dart will not make abilities that can trigger on-hit effects ( Parrrley,  Mystic Shot) miss.\n When blinded, enemies have a green tint on their screen."
    }
  },
  "skill_w": {
    "Move Quick": {
      "name": "Move Quick",
      "champion": "Teemo",
      "skill": "W",
      "cost": "40",
      "costtype": "mana",
      "cooldown": "17",
      "icon": "Move Quick.png",
      "blurb": "Teemo scampers around, passively increasing his Movement Speed until he is struck by an enemy champion or turret. Teemo can sprint to gain bonus Movement Speed that isn't stopped by being struck for a short time.",
      "description": "Passive: Teemo gains  bonus movement speed if he hasn't taken damage from enemy champions or turrets for 5 seconds.",
      "leveling": "Bonus Movement Speed:\n10 / 14 / 18 / 22 / 26%",
      "description2": "Active: Teemo doubles his  bonus movement speed for 3 seconds and prevents it from being disabled by damage for the duration.",
      "leveling2": "Active Bonus Movement Speed:\n20 / 28 / 36 / 44 / 52%",
      "targeting": "None",
      "affects": "Self",
      "notes": "* Move Quick's active's cooldown starts when the ability is first cast and not when the duration ends.\n When Move Quick's active bonus movement speed ends Teemo will not regain the passive one if he was damaged during the active's duration.\nMove Quick's passive will be disabled even if the damage is blocked with a spell shield."
    }
  },
  "skill_e": {
    "Toxic Shot": {
      "name": "Toxic Shot",
      "champion": "Teemo",
      "skill": "E",
      "icon": "Toxic Shot.png",
      "blurb": "Each of Teemo's attacks will poison the target, dealing damage on impact and each second after for 4 seconds.",
      "description": "Passive: Teemo's basic attacks deal bonus magic damage and  poison his target.",
      "leveling": "Magic Damage On-Hit:\n10 / 20 / 30 / 40 / 50 (+ 30% AP)",
      "description2": "Poisoned targets suffer magic damage for 4 seconds, with subsequent attacks refreshing the  poison's duration.",
      "leveling2": "Magic Damage per Second:\n6 / 12 / 18 / 24 / 30 (+ 10% AP)\nTotal Magic Damage Over Time:\n24 / 48 / 72 / 96 / 120 (+ 40% AP)\nTotal Magic Damage in a Single Hit:\n34 / 68 / 102 / 136 / 170 (+ 70% AP)",
      "targeting": "Passive",
      "affects": "Self",
      "damagetype": "Magic",
      "spelleffects": "False",
      "notes": "* Toxic Shot's poison will trigger  Twin Fang's bonus effects for  Cassiopeia and will apply  Morellonomicon's  Grievous Wounds.\nEach ticks of damage from Toxic Shot can apply Hunter's Talisman DoT effect."
    }
  },
  "skill_r": {
    "Noxious Trap": {
      "name": "Noxious Trap",
      "champion": "Teemo",
      "skill": "R",
      "target range": "400 / 525 / 650 / 775 / 900",
      "collision radius": "75",
      "effect radius": "450",
      "cost": "75",
      "costtype": "Mana + 1 Charge",
      "cooldown": "0.25",
      "recharge": "30 / 27.5 / 25 / 22.5 / 20",
      "icon": "false",
      "blurb": "Teemo throws an explosive poisonous trap using one of the mushrooms stored in his pack. If an enemy steps on the trap, it will release a poisonous cloud, slowing enemies and damaging them over time. If Teemo throws a mushroom onto another mushroom it will bounce, gaining additional range.",
      "description": "Passive: Teemo stores a Noxious Trap charge periodically, up to a maximum amount at once.",
      "leveling": "Maximum Charges:\n3 / 3.5 / 4 / 4.5 / 5",
      "icon2": "Noxious Trap.png",
      "description2": "Active: Teemo tosses a  mushroom trap on the ground, which stealths and arms after 1 second, lasting up to 5 minutes. While armed, mushrooms grant  sight around them. Mushrooms bounce forward if they land on top of another mushroom. This can happen an infinite amount of times while Teemo is alive. If Teemo dies before the mushroom lands on another mushroom, the mushroom will disappear.",
      "leveling2": "Bounce Range:\n300 / 350 / 400 / 450 / 500",
      "description3": "If an enemy steps on a mushroom, it detonates,  poisoning all nearby enemies,  slowing them, granting  sight of them, and dealing them magic damage over 4 seconds.",
      "leveling3": "Magic Damage per Second:\n50 / 65.625 / 81.25 / 96.875 / 112.5 (+ 12.5% AP)\nTotal Magic Damage:\n200 / 262.5 / 325 / 387.5 / 450 (+ 50% AP)\nSlow:\n30 / 35 / 40 / 45 / 50%",
      "description4": "Noxious Trap have  6 maximum health and can only be damaged by champion basic attacks (2 damage from  ranged and 3 from  melee).",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "AoEDoT",
      "spellshield": "Special",
      "projectile": "Special",
      "notes": "*  Rift Scuttler will not trigger Noxious Trap's explosion if it is not in combat.\n Noxious Trap's poison will trigger  Twin Fang's bonus effects for  Cassiopeia.\n Enemies who step on multiple Noxious Traps will only refresh the poison's duration (their damage does not stack).\n Noxious Trap's damage is determined when it detonates and not when planted, meaning Teemo's ability power gain/loss will apply to all active mushrooms' damage so long as they don't explode.\n Noxious Trap can be targeted by any allied  Teleport. The mushroom will not become invulnerable and its detonation (if the teleportation is already channeling when so) will not be canceled.\n  Spell shield will only block the poison (self and allied) and the slow but will not prevent the detonation itself.\n A thrown Noxious Trap will be destroyed when colliding with  Wind Wall /  Unbreakable."
    }
  }
}