{
  "id": 412,
  "apiname": "Thresh",
  "title": "the Chain Warden",
  "attack": 5,
  "defense": 6,
  "magic": 6,
  "difficulty": 3,
  "herotype": "Support",
  "alttype": "Fighter",
  "resource": "Mana",
  "stats": {
    "hp_base": 560.52,
    "hp_lvl": 93,
    "mp_base": 273.92,
    "mp_lvl": 44,
    "arm_base": 28,
    "arm_lvl": 0,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 7,
    "hp5_lvl": 0.55,
    "mp5_base": 6,
    "mp5_lvl": 0.8,
    "dam_base": 56,
    "dam_lvl": 2.2,
    "as_base": 0.625,
    "as_lvl": 3.5,
    "range": 450,
    "ms": 335,
    "acquisition_radius": 475,
    "selection_radius": 125,
    "pathing_radius": 36,
    "as_ratio": 0.625,
    "windup_modifier": 0.25,
    "attack_delay_offset": -0.0604166686534881,
    "urf_dmg_dealt": 1.1,
    "urf_dmg_taken": 0.9,
    "missile_speed": 0
  },
  "rangetype": "Ranged",
  "date": "2013-01-23",
  "patch": "V1.0.0.154",
  "changes": "V10.2",
  "role": [
    "Catcher"
  ],
  "damage": 1,
  "toughness": 2,
  "control": 3,
  "mobility": 1,
  "utility": 3,
  "style": 75,
  "adaptivetype": "magic",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Damnation": {
      "name": "Damnation",
      "champion": "Thresh",
      "skill": "I",
      "effect radius": "1900",
      "icon": "Damnation.png",
      "blurb": "Thresh can harvest the souls of enemies that die near him, permanently granting him Armor and Ability Power.",
      "description": "Innate: Enemy  champions, large  minions and large  monsters that die near Thresh drop a Soul for 8 seconds. Epic monsters drop 2 Souls instead. Small minions and lesser monsters have a 33.33% chance to drop a Soul.",
      "description2": "Thresh autonomously collects Souls near him or his  lantern. Souls are visible to allies and only become visible to enemies if their team has  sight of Thresh.",
      "description3": "Each collected Soul grants Thresh  0.75 bonus ability power and  0.75 bonus armor.",
      "targeting": "Passive",
      "affects": "Self",
      "notes": "* Souls grants a small amount of  sight around itself.\n The probability for souls dropping from small minions and monster on  Summoner's Rift starts at 33% but adjusts dynamically to match the expected quota of souls dropped (lowers if above, rises if below, remains if even). Souls collected are not considered when adjusting the probability.\n The maximum amount of souls Thresh can collect is 999,999, granting him 749,999 bonus ability power and 749,999 bonus armor (99.99% damage reduction, reduced to 99.98% when hit by  Last Whisper).\n  Nunu & Willump drop a soul each (sometimes the icy ghosts from  Twin Shadows' active will drop one each after reaching their targets)."
    }
  },
  "skill_q": {
    "Death Sentence": {
      "name": "Death Sentence",
      "champion": "Thresh",
      "skill": "Q",
      "target range": "1100",
      "tether radius": "2200",
      "speed": "1900",
      "cast time": "0.5",
      "cost": "70",
      "costtype": "Mana",
      "cooldown": "20 / 18 / 16 / 14 / 12",
      "icon": "Death Sentence.png",
      "blurb": "Thresh binds an enemy in chains and pulls them toward him. Activating this ability a second time pulls Thresh to the enemy.",
      "description": "First Cast - Death Sentence: Thresh throws out his scythe in the target direction. Thresh is  entangled while the scythe is in flight.",
      "description2": "The scythe stops with the first enemy it hits, dealing magic damage and  stunning them for 1.5 seconds, while also forming a tether between Thresh and them for the duration. Hitting an enemy reduces Death Sentence's  cooldown by 3 seconds.",
      "leveling2": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                80,
                120,
                160,
                200,
                240
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                50,
                50,
                50,
                50,
                50
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        }
      ],
      "description3": "While the tether persists, Thresh is  disarmed and periodically tugs at his scythe's chain,  pulling the target a short distance towards himself. After 0.5 seconds, or instantly upon hitting a minion or monster, Thresh can cast  Death Leap.",
      "icon4": "Death Leap.png",
      "description4": "Second Cast - Death Leap: Thresh  dashes to the tethered enemy, removing the  stun but becoming able to attack again.",
      "targeting": "Direction / Auto",
      "affects": "Enemies / Self",
      "damagetype": "Magic",
      "spelleffects": "spell",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* Thresh will not face in the target direction during Death Sentence's cast animation (only after the projectile starts traveling).\n While  grounded only the second cast is disabled.\n Death Sentence's  stun duration is reduced by  tenacity while the tether will persist for the full duration (unless broken by Quicksilver,  Mikael's Crucible,  Cleanse, or certain abilities).\n Targets affected by  Black Shield will not be  stunned or  pulled at when hit (Thresh will not tug at his target even if  Black Shield wears off before Death Sentence ends).\n Death Sentence's tether will not be broken by becoming  untargetable.\n Death Sentence's effects will persist if Thresh dies before the duration ends."
    }
  },
  "skill_w": {
    "Dark Passage": {
      "name": "Dark Passage",
      "champion": "Thresh",
      "skill": "W",
      "target range": "950",
      "effect radius": "150",
      "tether radius": "1500",
      "cost": "50 / 55 / 60 / 65 / 70",
      "costtype": "Mana",
      "cooldown": "22 / 19.5 / 17 / 14.5 / 12",
      "icon": "Dark Passage.png",
      "blurb": "Thresh throws out a lantern that shields nearby allied Champions from damage. Allies can click the lantern to dash to Thresh.",
      "description": "Active: Thresh throws his lantern to the target location for 6 seconds or until he moves too far away from it,  revealing its surroundings.",
      "description2": "Thresh and the first allied champion to come near the lantern is  shielded for 4 seconds. An ally can select the lantern while in proximity of it,  dashing to Thresh's current location and gaining the shield.",
      "leveling2": [
        {
          "attribute": "Shield Strength",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                60,
                100,
                140,
                180,
                220
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                1,
                1,
                1,
                1,
                1
              ],
              "units": [
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected"
              ]
            }
          ]
        }
      ],
      "description3": "An ally cannot select the lantern while  silenced,  grounded or  immobilized.",
      "targeting": "Ground",
      "affects": "Allies",
      "spelleffects": "Shield",
      "projectile": "True",
      "notes": "* Allies can pick up the lantern through small walls if its grab radius allows it.\n Thresh cannot grab the lantern but can shield himself if he walks near it.\n The lantern is considered a unit and can be targeted by  Teleport,  Leap Strike,  Shunpo, and  Safeguard.\n The lantern's duration and maximum leash range are each displayed as a circle on the ground."
    }
  },
  "skill_e": {
    "Flay": {
      "name": "Flay",
      "champion": "Thresh",
      "skill": "E",
      "target range": "400",
      "cost": "60 / 65 / 70 / 75 / 80",
      "costtype": "Mana",
      "cooldown": "9",
      "icon": "false",
      "blurb": "Thresh's attacks wind up, dealing more damage the longer he waits between attacks. When activated, Thresh sweeps his chain, knocking all enemies hit in the direction of the blow.",
      "description": "Passive: Thresh's basic attacks deal bonus magic damage, with the  AD ratio increasing based on the time spent not attacking enemy or neutral units.",
      "leveling": [
        {
          "attribute": "Minimum Bonus Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                1,
                1,
                1,
                1,
                1
              ],
              "units": [
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected"
              ]
            },
            {
              "modifier": "+",
              "values": [
                0,
                0,
                0,
                0,
                0
              ],
              "units": [
                "% AD",
                "% AD",
                "% AD",
                "% AD",
                "% AD"
              ]
            }
          ]
        },
        {
          "attribute": "Maximum Bonus Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                1,
                1,
                1,
                1,
                1
              ],
              "units": [
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected",
                " per  Soul collected"
              ]
            },
            {
              "modifier": "+",
              "values": [
                100,
                125,
                150,
                175,
                200
              ],
              "units": [
                "",
                "",
                "",
                "",
                "% AD"
              ]
            }
          ]
        }
      ],
      "icon2": "Flay.png",
      "description2": "Active: Thresh sweeps his chain around him and in a broad line towards the target direction, dealing magic damage to enemies hit,  knocking them in the chain's direction, and  slowing them afterwards for 1 second.",
      "leveling2": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                65,
                95,
                125,
                155,
                185
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                40,
                40,
                40,
                40,
                40
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        },
        {
          "attribute": "Slow",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                20,
                25,
                30,
                35,
                40
              ],
              "units": [
                "%",
                "%",
                "%",
                "%",
                "%"
              ]
            }
          ]
        }
      ],
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "special",
      "spellshield": "True",
      "notes": "* Applies  area damage on the ability and deals  proc damage on the enhanced basic attack.\nFlay's passive's buff icon changes colors depending on charge level:\n  0 - 25%\n  25 - 50%\n  50 - 75%\n  75 - 100% \n At 100%, Thresh's scythe will glow green and a sound effect will play.\n\n  Runaan's Hurricane's Wind's Fury will apply Flay's passive to each enemy hit, with the secondary targets taking minimum damage (charge resets upon hitting the primary target).\n The enhanced attack applies other on-hit effects and can  critically strike as normal (the bonus damage cannot) but does not affect structures or wards (hitting them does not consume the bonus damage or reset the charge).\n Flay's passive can be  dodged (the enhanced attack is not consumed and the charge is not reset).\n PENDING FOR TEST: Enhanced attack's interactions with  blocking and  blinding effects (regarding both bonus damage and charge reset)."
    }
  },
  "skill_r": {
    "The Box": {
      "name": "The Box",
      "champion": "Thresh",
      "skill": "R",
      "effect radius": "450",
      "cast time": "0.75",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "140 / 120 / 100",
      "icon": "The Box.png",
      "blurb": "A prison of walls that slow and deal damage if broken.",
      "description": "Active: Thresh surrounds himself with 5 spectral walls, each lasting for up to 5 seconds. Walls break upon contact with an enemy champion, dealing magic damage and  slowing by 99% for 2 seconds.",
      "leveling": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                250,
                400,
                550
              ],
              "units": [
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                100,
                100,
                100,
                100,
                100
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        }
      ],
      "description2": "Enemy champions hitting any wall beyond the first take no damage and are  slowed for only 1 second.",
      "targeting": "Auto",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "spell",
      "spellshield": "True",
      "notes": "* No additional details."
    }
  }
}