{
  "id": 67,
  "apiname": "Vayne",
  "title": "the Night Hunter",
  "attack": 10,
  "defense": 1,
  "magic": 1,
  "difficulty": 2,
  "herotype": "Marksman",
  "alttype": "Assassin",
  "resource": "Mana",
  "stats": {
    "hp_base": 515,
    "hp_lvl": 89,
    "mp_base": 231.8,
    "mp_lvl": 35,
    "arm_base": 23,
    "arm_lvl": 3.4,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 3.5,
    "hp5_lvl": 0.55,
    "mp5_base": 6.972,
    "mp5_lvl": 0.4,
    "dam_base": 60,
    "dam_lvl": 2.36,
    "as_base": 0.658,
    "as_lvl": 3.3,
    "range": 550,
    "ms": 330,
    "acquisition_radius": 575,
    "selection_radius": 120,
    "pathing_radius": 35,
    "as_ratio": 0.657999992370605,
    "attack_delay_offset": -0.124561406672
  },
  "fullname": "Shauna Vayne",
  "rangetype": "Ranged",
  "date": "2011-05-10",
  "patch": "v1.0.0.118",
  "changes": "V9.19",
  "role": [
    "Marksman"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 2,
  "utility": 1,
  "style": 0,
  "adaptivetype": "physical",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Night Hunter": {
      "name": "Night Hunter",
      "champion": "Vayne",
      "skill": "I",
      "effect radius": "2000",
      "icon": "Night Hunter.png",
      "blurb": "Vayne ruthlessly hunts evil-doers, gaining 30 movement speed when moving toward nearby enemy champions.",
      "description": "Innate: Vayne gains  30 bonus movement speed when moving towards a nearby  visible enemy champion.",
      "description2": "Final Hour: Night Hunter's bonus movement speed is tripled to 90.",
      "targeting": "Passive",
      "affects": "Self",
      "notes": "* Vayne does not need to be moving to trigger Night Hunter.\n Night Hunter's bonus movement speed persists for 2 seconds after Vayne loses  sight of an enemy champion.\n Night Hunter interacts with movement speed modifiers."
    }
  },
  "skill_q": {
    "Tumble": {
      "name": "Tumble",
      "champion": "Vayne",
      "skill": "Q",
      "target range": "300",
      "cost": "30",
      "costtype": "Mana",
      "cooldown": "4 / 3.5 / 3 / 2.5 / 2",
      "icon": "Tumble.png",
      "blurb": "Vayne tumbles, maneuvering to carefully place her next shot. Her next attack critically strikes.",
      "description": "Active: Vayne  dashes forward, though not through terrain, and her next basic attack within 7 seconds deals  bonus physical damage.",
      "leveling": "Bonus Physical Damage:\n50 / 55 / 60 / 65 / 70% AD",
      "description2": "Tumble resets Vayne's basic attack timer.",
      "targeting": "Self",
      "affects": "Self",
      "damagetype": "physical",
      "onhiteffects": "Special",
      "spellshield": "False",
      "notes": "* The enhanced attack applies on-hit effects,  life steal, affects turrets and can  critically strike as normal. The bonus damage however cannot.\n Although Tumble will reset the basic attack timer, Vayne cannot attack until the animation is complete."
    }
  },
  "skill_w": {
    "Silver Bolts": {
      "name": "Silver Bolts",
      "champion": "Vayne",
      "skill": "W",
      "icon": "Silver Bolts.png",
      "blurb": "Vayne tips her bolts with a rare metal, toxic to evil things. The third consecutive attack or ability against the same target deals a percentage of the target's maximum Health as bonus true damage. (Max: 200 damage vs. Monsters)",
      "description": "Passive: Vayne's basic attacks and  Condemn apply a Silver Bolts stack for 3.5 seconds, up to 3 times. Attacking a new enemy removes all stacks from the previous target.",
      "description2": "The third stack consumes them all to deal  bonus true damage, with a minimum threshold, and capped at 200 against monsters.",
      "leveling2": "Bonus True Damage:\n4 / 6.5 / 9 / 11.5 / 14% of target's maximum health\nMinimum True Damage:\n50 / 65 / 80 / 95 / 110",
      "targeting": "Passive",
      "affects": "Enemies",
      "damagetype": "true",
      "spelleffects": "false",
      "onhiteffects": "Special",
      "spellshield": "False",
      "notes": "* Stacks are not removed if Vayne switches to attacking a target immune to Silver Bolts (structures, wards).\n Silver Bolts do not apply to additional targets with  Runaan's Hurricane.\n The third attack consumes all stacks even if the target is  untargetable."
    }
  },
  "skill_e": {
    "Condemn": {
      "name": "Condemn",
      "champion": "Vayne",
      "skill": "E",
      "target range": "550",
      "cost": "90",
      "costtype": "Mana",
      "cooldown": "20 / 18 / 16 / 14 / 12",
      "icon": "Condemn.png",
      "blurb": "Vayne draws a heavy crossbow from her back, and fires a huge bolt at her target, knocking them back and dealing damage. If they collide with terrain, they are impaled, dealing bonus damage and stunning them.",
      "description": "Active: Vayne fires a heavy bolt at the target unit, dealing physical damage,  knocking them back 475 units, and applying a  Silver Bolts stack.",
      "leveling": "Physical Damage:\n50 / 85 / 120 / 155 / 190 (+ 50% bonus AD)",
      "description2": "If the target collides with a wall, they take bonus physical damage and are  stunned for 1.5 seconds.",
      "leveling2": "Bonus Damage:\n75 / 127.5 / 180 / 232.5 / 285 (+ 75% bonus AD)\nTotal Damage:\n125 / 212.5 / 300 / 387.5 / 475 (+ 125% bonus AD)",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "physical",
      "spelleffects": "single",
      "spellshield": "True",
      "projectile": "true",
      "notes": "* Condemn uses  edge range (same as Vayne's basic attacks).\n Condemn's  displacement direction is determined when the projectile hits (will follow the line both Vayne and her target draw at that specific moment).\n Condemn's  stun duration starts when Vayne's target collides with a wall (they can be disabled for up to 2 seconds depending on  displacement duration based on distance traveled).\n Possible Bug: Condemn will not always interrupt enemy  suppression on Vayne's allies (sometimes they remain affected even if the enemy champion responsible is  displaced as far as outside ability range).\n The secondary damage Condemn's target takes when they collide with a wall is considered critical strike damage.\n Condemn interacts with player-created terrain ( Crystallize,  Emperor's Divide,  Jarvan IV's  Cataclysm,  Pillar of Ice)."
    }
  },
  "skill_r": {
    "Final Hour": {
      "name": "Final Hour",
      "champion": "Vayne",
      "skill": "R",
      "cost": "80",
      "costtype": "Mana",
      "cooldown": "100 / 92.5 / 85 / 77.5 / 70",
      "icon": "Final Hour.png",
      "blurb": "Readying herself for an epic confrontation, Vayne gains increased Attack Damage, Invisibility during Tumble, and triple the bonus Movement Speed from Night Hunter.",
      "description": "Active: For a duration, Vayne gains bonus attack damage and triples  Night Hunter's bonus.",
      "leveling": "Duration:\n8 / 9 / 10 / 11 / 12\n\nBonus AD:\n25 / 32.5 / 40 / 47.5 / 55",
      "description2": "Additionally,  Tumble gains cooldown reduction, and casting it grants  invisibility for 1 second.",
      "leveling2": "Tumble Cooldown Reduction:\n30 / 35 / 40 / 45 / 50%",
      "description3": "While active, whenever a champion damaged by Vayne dies within 3 seconds, Final Hour's duration is extended by 4 seconds, up to a maximum of the original duration.",
      "leveling3": "Maximum Duration:\n16 / 18 / 20 / 22 / 24",
      "targeting": "None",
      "affects": "Self",
      "notes": "* Final Hour has no cast time and does not interrupt Vayne's previous orders.\n Vayne's animations and basic attack projectiles change slightly during Final Hour.\n Tumble's  invisibility during  Final Hour will end prematurely if Vayne performs any action other than movement while stealthed."
    }
  }
}