{
  "id": 101,
  "apiname": "Xerath",
  "title": "the Magus Ascendant",
  "attack": 1,
  "defense": 3,
  "magic": 10,
  "difficulty": 2,
  "herotype": "Mage",
  "resource": "Mana",
  "stats": {
    "hp_base": 526,
    "hp_lvl": 92,
    "mp_base": 459,
    "mp_lvl": 22,
    "arm_base": 21.88,
    "arm_lvl": 3.5,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 5.5,
    "hp5_lvl": 0.55,
    "mp5_base": 8,
    "mp5_lvl": 0.8,
    "dam_base": 54.7,
    "dam_lvl": 3,
    "as_base": 0.625,
    "as_lvl": 1.36,
    "range": 525,
    "ms": 340,
    "acquisition_radius": 600,
    "selection_radius": 88.8889007568359,
    "pathing_radius": 35,
    "as_ratio": 0.625,
    "attack_delay_offset": -0.0492600016295909,
    "aram_dmg_dealt": 0.95
  },
  "rangetype": "Ranged",
  "date": "2011-10-05",
  "patch": "V1.0.0.126",
  "changes": "V9.15",
  "role": [
    "Artillery"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 1,
  "utility": 1,
  "style": 90,
  "adaptivetype": "magic",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Mana Surge": {
      "name": "Mana Surge",
      "champion": "Xerath",
      "skill": "I",
      "static": "12",
      "icon": "Mana Surge.png",
      "blurb": "Xerath's basic attacks periodically restore Mana.",
      "description": "Innate: Xerath periodically empowers his next basic attack to restore 30 − 195 (based on level)  mana, doubled to 60 − 390 (based on level) against enemy champions.",
      "targeting": "Passive",
      "affects": "Self",
      "notes": "* The passive doesn't trigger if the mana restored would cause Xerath to exceed his maximum mana.[2]\n Mana Surge works with jungle plants and monsters."
    }
  },
  "skill_q": {
    "Arcanopulse": {
      "name": "Arcanopulse",
      "champion": "Xerath",
      "skill": "Q",
      "target range": "750 − 1400 (based on channel time)",
      "collision radius": "72.5",
      "cost": "80 / 90 / 100 / 110 / 120",
      "costtype": "mana",
      "cooldown": "9 / 8 / 7 / 6 / 5",
      "icon": "Arcanopulse.png",
      "blurb": "Fires a long-range beam of energy, dealing magic damage to all targets hit.",
      "description": "First Cast: Xerath  charges for up to 3 seconds to increase Arcanopulse's  range over 1.5 seconds, gradually  slowing himself for the duration by up to 50%.",
      "description2": "Arcanopulse is canceled when the charge ends, refunding  half of the mana cost.",
      "leveling2": "Mana Refunded:\n40 / 45 / 50 / 55 / 60",
      "description3": "Second Cast: After a brief delay, Xerath fires a beam of energy in the target direction, dealing  magic damage to all enemies hit.",
      "leveling3": "Magic Damage:\n80 / 120 / 160 / 200 / 240 (+ 75% AP)",
      "targeting": "Direction",
      "affects": "Self, Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "False",
      "notes": "* While charging, Arcanopulse can be interrupted by any hard disables.\n Arcanonopulse's cooldown starts after firing the beam or after it's cast time ends if not fired, not while channeling.\n Once casting, Arcanopulse cannot be interrupted. During the cast time, Xerath will ignore crowd control effects but still suffers from them if the duration persists. \n If Xerath is displaced by a knockback or pull effect during the cast time, the beam will fire from the original point of casting. \n If Xerath dies while charging or during the cast time, Arcanopulse will not fire but is still placed on cooldown."
    }
  },
  "skill_w": {
    "Eye of Destruction": {
      "name": "Eye of Destruction",
      "champion": "Xerath",
      "skill": "W",
      "target range": "1000",
      "effect radius": "210",
      "cost": "70 / 80 / 90 / 100 / 110",
      "costtype": "mana",
      "cooldown": "14 / 13 / 12 / 11 / 10",
      "icon": "Eye of Destruction.png",
      "blurb": "Calls down a barrage of arcane energy, slowing and dealing magic damage to all enemies in an area. Targets in the middle receive additional damage and a stronger slow.",
      "description": "Active: Xerath calls down a blast of arcane energy upon the target area which strikes after a 0.5-seconds delay, dealing magic damage to all enemies within and  slowing them by 25% for 2.5 seconds.",
      "leveling": "Magic Damage:\n60 / 90 / 120 / 150 / 180 (+ 60% AP)",
      "description2": "Enemies in the center of the blast take 50% increased damage and are  slowed by a greater amount, decaying down to 25% over the duration.",
      "leveling2": "Enhanced Damage:\n90 / 135 / 180 / 225 / 270 (+ 90% AP)\nEnhanced Slow:\n60 / 65 / 70 / 75 / 80%",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "* There is an 0.2 second casting time that must be completed in order for the impact to deal damage. After the 0.2 second casting time, there is no way to stop the blast.\n Cast times cannot be interrupted by crowd control effects, and will only be interrupted by Xerath's death. If Xerath dies during the 0.2 seconds, the impact will fizzle after the 0.5 seconds (and will not deal damage). \n During the cast time, Xerath will ignore crowd control effects but still suffers from them if the duration persists. \n If Xerath is displaced by a knockback or pull effect during the cast time, Eye of Destruction will still go off at the target location even if he is no longer in range. \n\n Eye of Destruction grants sight over a large area on-cast, which persists for a short duration after the blast hits."
    }
  },
  "skill_e": {
    "Shocking Orb": {
      "name": "Shocking Orb",
      "champion": "Xerath",
      "skill": "E",
      "target range": "1060",
      "collision radius": "60",
      "speed": "1600",
      "cost": "60 / 65 / 70 / 75 / 80",
      "costtype": "mana",
      "cooldown": "13 / 12.5 / 12 / 11.5 / 11",
      "icon": "Shocking Orb.png",
      "blurb": "Deals magic damage to an enemy and stuns them.",
      "description": "Active: Xerath fires an orb of energy in the target direction, dealing magic damage to the first enemy hit and  stunning them for 0.5 − 2 (based on distance the orb traveled) seconds.",
      "leveling": "Magic Damage:\n80 / 110 / 140 / 170 / 200 (+ 45% AP)",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Single target",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* No additional details."
    }
  },
  "skill_r": {
    "Rite of the Arcane": {
      "name": "Rite of the Arcane",
      "champion": "Xerath",
      "skill": "R",
      "target range": "5000",
      "effect radius": "135",
      "cost": "100",
      "costtype": "mana",
      "cooldown": "130 / 122.5 / 115 / 107.5 / 100",
      "icon": "Rite of the Arcane.png",
      "blurb": "Xerath immobilizes himself and gains numerous long-range barrages.",
      "description": "Active: Xerath  roots himself to his current location for up to 10 seconds, gaining the ability to cast  Arcane Barrage multiple times, but losing the ability to cast his other abilities.",
      "leveling": "Number of Barrages:\n3 / 3.5 / 4 / 4.5 / 5",
      "description2": "Arcane Barrage - Active: Xerath launches a blast of arcane energy to the target area which strikes after 0.5 seconds, dealing magic damage and briefly granting  sight of it. Each cast has a static cooldown of 0.8 seconds.",
      "leveling2": "Magic Damage:\n200 / 220 / 240 / 260 / 280 (+ 43% AP)\nTotal Damage:\n600 / 770 / 960 / 1170 / 1400 (+ 129 / 150.5 / 172 / 193.5 / 215% AP)",
      "description3": "Rite of the Arcane can be canceled early by moving or attacking. If Arcane Barrage ends without any usage, half the  cooldown is refunded. Rite of the Arcane is canceled and put on full cooldown if Xerath is affected by any  crowd control that prevents or interrupts the casting of abilities.",
      "targeting": "Ground",
      "affects": "Self, Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "False",
      "notes": "* Rite of the Arcane has a short activation time where Xerath ascends into his true form. During this time, Arcane Barrage cannot be activated and a circle indicating the ability's maximum range appears (starting small and rapidly expanding to the maximum range over the cast time).\n The maximum-range indicator is visible to both allies and enemies. \n\n Activating Rite of the Arcane does not automatically use the first cast of Arcane Barrage - you must activate the ability twice in order to first deal damage. \n Arcane Barrage uses a barrage system so that it can be cast multiple times within a given period at no additional cost.\n Each cast is classified as an activation for the purposes of effects such as  Tear and Spellblade.\n Xerath can use  Dark Passage while rooted."
    }
  }
}