{
  "id": 157,
  "apiname": "Yasuo",
  "title": "the Unforgiven",
  "attack": 8,
  "defense": 4,
  "magic": 4,
  "difficulty": 3,
  "herotype": "Fighter",
  "alttype": "Assassin",
  "resource": "Flow",
  "stats": {
    "hp_base": 523,
    "hp_lvl": 87,
    "mp_base": 100,
    "mp_lvl": 0,
    "arm_base": 30,
    "arm_lvl": 3.4,
    "mr_base": 30,
    "mr_lvl": 1.25,
    "hp5_base": 6.5,
    "hp5_lvl": 0.9,
    "mp5_base": 0,
    "mp5_lvl": 0,
    "dam_base": 60,
    "dam_lvl": 3.2,
    "as_base": 0.697,
    "as_lvl": 2.5,
    "range": 175,
    "ms": 345,
    "acquisition_radius": 400,
    "selection_radius": 75,
    "pathing_radius": 32,
    "crit_mod": 0.9,
    "as_ratio": 0.6700000166893,
    "attack_delay_offset": -0.0799999982118606
  },
  "rangetype": "Melee",
  "date": "2013-12-13",
  "patch": "V3.15",
  "changes": "V10.1",
  "role": [
    "Skirmisher"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 2,
  "mobility": 3,
  "utility": 2,
  "style": 20,
  "adaptivetype": "physical",
  "be": 6300,
  "rp": 975,
  "skill_i": {
    "Way of the Wanderer": {
      "name": "Way of the Wanderer",
      "champion": "Yasuo",
      "skill": "I",
      "icon": "Way of the Wanderer.png",
      "blurb": "Yasuo's Critical Strike Chance is doubled. Additionally, Yasuo builds toward a shield whenever he is moving. The shield triggers when he takes damage from a champion or monster.",
      "description": "Intent: Yasuo doubles his  total critical strike chance from all other sources, but his  critical strikes deal only (80% +  22.5%) AD  bonus physical damage.",
      "description2": "Resolve: Yasuo generates  Flow for every 59 / 52.5 / 46 (based on level) units he travels by any means. At   100 stacks    5900 / 5250 / 4600 (based on level) units traveled   and upon taking champion or monster damage, Yasuo consumes  all Flow to  shield himself for 100 − 510 (based on level) for up to 1 second.",
      "targeting": "Passive",
      "affects": "Self",
      "spelleffects": "Shield",
      "notes": "* No additional notes."
    }
  },
  "skill_q": {
    "Steel Tempest": {
      "name": "Steel Tempest",
      "champion": "Yasuo",
      "skill": "Q",
      "target range": "475 / 900",
      "effect radius": "375",
      "cast time": "0.4 − 0.133 (based on bonus attack speed)",
      "static": "4 − 1.33 (based on bonus attack speed)",
      "icon": "Steel Tempest.png",
      "blurb": "A skillshot basic attack. After two successful Steel Tempests, the next fires a tornado that knocks enemies Airborne.",
      "description": "First Cast - Steel Tempest: Yasuo thrusts his sword in the target direction, dealing physical damage to enemies hit and applying on-hit effects to the first enemy hit. The ability can  critically strike for (60% +  20%) AD bonus physical damage.",
      "leveling": "Physical Damage:\n20 / 45 / 70 / 95 / 120 (+ 100% AD)",
      "description2": "If Steel Tempest hits an enemy, he gains a Gathering Storm stack for 6 seconds to which he's able to cast Steel Wind Rising.",
      "icon3": "Steel Tempest 2.png",
      "description3": "Second Cast - Steel Wind Rising: Yasuo casts Steel Tempest. If it hits an enemy, Yasuo gains another Gathering Storm stack to which he can cast Gathering Storm.",
      "icon4": "Steel Tempest 3.png",
      "description4": "Third Cast - Gathering Storm: Yasuo consumes his stacks to unleash a whirlwind that travels in the target direction, dealing the same damage and  knocking up all enemies hit.",
      "description5": "Casting Steel Tempest, Steel Wind Rising or Gathering Storm during  Sweeping Blade will instead affect enemies around Yasuo at the end of the dash, or doing so immediately at his landing location after  blinking while ending the dash prematurely. Gathering Storm's whirlwind is not released when cast during  Sweeping Blade, but instead  knocks up all enemies hit around Yasuo for the same duration.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Special",
      "onhiteffects": "True",
      "spellshield": "True",
      "projectile": "Special",
      "notes": "* Only Gathering Storm can be  intercepted.\n Steel Tempest counts as single-target for the first enemy hit and area of effect for the others.\n  Ravenous Hunter will only heal from the damage dealt to secondary targets.\n\n Each parry has different interactions with this ability, whether it's the first target of Steel Tempest or the secondary one. In either case Yasuo still gets a stack of Gathering Storm and his whirlwind knockup cannot be blocked:\n  Counter Strike: both first target and secondary target do not deal damage.\n  Spirit's Refuge: first target does not deal damage, secondary target does deal damage.\n  Blinding Dart: both first target and secondary target do deal damage.\n\n Steel Tempest will not apply spell effects to the first target hit, but will do so to the secondary ones.\n Steel Tempest's damage is calculated individually for every enemy hit when  critically striking.\n Steel Tempest is not considered a basic attack for effects like  Guinsoo's Rageblade and stacking  Energizing attacks.\n It's been however special cased to be considered a basic attack for  Hail of Blades.\n\n Unlike other abilities, the first two Steel Tempests will cancel and reset their cooldown if Yasuo is  stunned during their cast time.\n The third Steel Tempest will continue its cast through the stun.\n If Yasuo however buffers Steel Tempest after  Sweeping Blade, a stun will cause Steel Tempest to cancel and go on full cooldown."
    }
  },
  "skill_w": {
    "Wind Wall": {
      "name": "Wind Wall",
      "champion": "Yasuo",
      "skill": "W",
      "target range": "400",
      "cooldown": "26 / 24 / 22 / 20 / 18",
      "icon": "Wind Wall.png",
      "blurb": "Creates a moving wall that blocks enemy projectiles.",
      "description": "Active: Yasuo creates a gust of wind that travels in the target direction over 0.25 seconds to form a wall in front of him. The wall slowly drifts forward 50 units over 3.75 seconds, blocking all hostile non- turret  projectiles.",
      "leveling": "Wall Width:\n300 / 350 / 400 / 450 / 500",
      "targeting": "Direction",
      "affects": "None",
      "projectile": "Special",
      "notes": "* Wind Wall starts blocking projectiles on-cast (despite not being fully formed) and grants  sight over a small area.\n Wind Wall is  knocked down if it collides with another."
    }
  },
  "skill_e": {
    "Sweeping Blade": {
      "name": "Sweeping Blade",
      "champion": "Yasuo",
      "skill": "E",
      "target range": "475",
      "speed": "750 (+ 60% movement speed)",
      "static": "0.5 / 0.4 / 0.3 / 0.2 / 0.1",
      "ontargetcdstatic": "10 / 9 / 8 / 7 / 6",
      "icon": "Sweeping Blade.png",
      "blurb": "Dashes through a unit, dealing escalating Magic Damage with each cast.",
      "description": "Active: Yasuo  dashes a fixed distance toward a target enemy, dealing  magic damage.",
      "leveling": "Magic Damage:\n60 / 70 / 80 / 90 / 100 (+ 20% bonus AD) (+ 60% AP)\nMaximum Magic Damage:\n90 / 105 / 120 / 135 / 150 (+ 20% bonus AD) (+ 60% AP)",
      "description2": "Each Sweeping Blade cast increases the next dash's base damage by 25% for 5 seconds, up to 50%.",
      "leveling2": "Bonus Damage:\n15 / 17.5 / 20 / 22.5 / 25\nMaximum Bonus Damage:\n30 / 35 / 40 / 45 / 50",
      "description3": "Yasuo cannot dash to the same target more than once every few seconds.",
      "description4": "Yasuo will be  knocked down by any  immobilizing crowd control during Sweeping Blade.",
      "targeting": "Unit",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Single target",
      "spellshield": "True",
      "notes": "* Sweeping Blade's dash speed is affected by  slows.\n Sweeping Blade will generate 7.5  Flow stacks per cast.\n Yasuo can use Sweeping Blade's fixed dash distance to cross walls both before and after hitting his target (provided his proximity to the wall and/or target allows it)."
    }
  },
  "skill_r": {
    "Last Breath": {
      "name": "Last Breath",
      "champion": "Yasuo",
      "skill": "R",
      "target range": "1400",
      "cooldown": "80 / 55 / 30",
      "icon": "Last Breath.png",
      "blurb": "Moves to a unit and strikes them repeatedly for heavy damage. Can only be cast on Airborne targets.",
      "description": "Active: Yasuo  blinks to the other side of a  visible  airborne enemy champion nearest to the cursor, instantly generating maximum  Flow while resetting  Steel Tempest's stacks.",
      "description2": "Upon arrival, he  suspends all nearby  airborne enemies around the target for 1 second, dealing  physical damage thereafter.",
      "leveling2": "Physical Damage:\n200 / 300 / 400 (+ 150% bonus AD)",
      "description3": "For the next 15 seconds, Yasuo's  critical strikes gain  50% armor penetration versus  bonus armor.",
      "description4": "If Yasuo would be placed inside a turret's attack range upon blinking, he will instead attempt to position himself outside it (does not apply to Nexus Obelisk).",
      "targeting": "Auto",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Single target",
      "spellshield": "True",
      "notes": "* Last Breath's area of effect when suspending enemies increases per rank.\n Last Breath's damage and bonus armor penetration do not interact with each other.\n Suspended enemies are immune to further displacements during Last Breath's animation time.\n Casting right after the triggering displacement(s) will overwrite the latter's duration (whether shorter/longer) to Last Breath's animation time (durations will not stack).\n\n The targets will remain suspended and the damage will be applied even if Yasuo dies during it.\n Displacement abilities (e.g.  Weaver's Wall,  Pillar of Ice,  Volcanic Rupture) that affect enemy champions are considered  Airborne, and will therefore interact with Last Breath.\n Self-applied displacements cannot be targeted by Last Breath:\n Enemies displaced by neutral monsters (e.g.  Dragon's initial knock-back) can be targeted.\n PENDING FOR TEST: Enemies displaced by their allies (e.g  Anivia's  Crystallize,  Ornn's  Volcanic Rupture,  Trundle's  Pillar of Ice) can be targeted.\n\n While blinking Yasuo creates an  untargetable clone of himself that instead dashes to the target location. This clone is considered a champion for  Turret Plating's  gold sharing."
    }
  }
}