{
  "id": 238,
  "apiname": "Zed",
  "title": "the Master of Shadows",
  "attack": 9,
  "defense": 2,
  "magic": 1,
  "difficulty": 3,
  "herotype": "Assassin",
  "resource": "Energy",
  "stats": {
    "hp_base": 584,
    "hp_lvl": 85,
    "mp_base": 200,
    "mp_lvl": 0,
    "arm_base": 32,
    "arm_lvl": 3.5,
    "mr_base": 32.1,
    "mr_lvl": 1.25,
    "hp5_base": 7,
    "hp5_lvl": 0.65,
    "mp5_base": 50,
    "mp5_lvl": 0,
    "dam_base": 63,
    "dam_lvl": 3.4,
    "as_base": 0.651,
    "as_lvl": 3.3,
    "range": 125,
    "ms": 345,
    "acquisition_radius": 400,
    "selection_radius": 100,
    "pathing_radius": 35,
    "as_ratio": 0.651000022888183,
    "attack_delay_offset": -0.102405503392219,
    "aram_dmg_dealt": 1.05,
    "urf_dmg_dealt": 0.9
  },
  "rangetype": "Melee",
  "date": "2012-11-13",
  "patch": "V1.0.0.151",
  "changes": "V9.8",
  "role": [
    "Assassin"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 1,
  "mobility": 3,
  "utility": 1,
  "style": 55,
  "adaptivetype": "physical",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Contempt for the Weak": {
      "name": "Contempt for the Weak",
      "champion": "Zed",
      "skill": "I",
      "ontargetcdstatic": "10",
      "icon": "Contempt for the Weak.png",
      "blurb": "Zed's basic attacks against targets below 50% Health deal 6-10% of the target's maximum Health as bonus Magic Damage. This effect can only occur once every 10 seconds on the same target.",
      "description": "Innate: Zed's basic attacks against targets  below 50% maximum health deal 6 / 8 / 10% (based on level) of target's maximum health as  bonus magic damage.",
      "description2": "Contempt for the Weak can only affect the same target once every few seconds.",
      "targeting": "Passive",
      "affects": "Enemies",
      "damagetype": "magic",
      "spelleffects": "proc",
      "onhiteffects": "Special",
      "spellshield": "False",
      "notes": "* The enhanced attack applies other on-hit effects and can  critically strike as normal but does not affect structures.\n Contempt for the Weak is not consumed when  dodged,  parried, or when Zed is  blinded, but it is consumed when  blocked."
    }
  },
  "skill_q": {
    "Razor Shuriken": {
      "name": "Razor Shuriken",
      "champion": "Zed",
      "skill": "Q",
      "target range": "900",
      "speed": "900",
      "cost": "75 / 70 / 65 / 60 / 55",
      "costtype": "energy",
      "cooldown": "6",
      "icon": "Razor Shuriken.png",
      "blurb": "Zed and his shadow both throw their spinning blades forward, dealing damage to any targets they pass through.",
      "description": "Active: Zed and his  Shadows throw their spinning blades toward the target location. Each blade deals  physical damage to all enemies struck, reduced to 60% against units beyond the first.",
      "leveling": "Physical Damage:\n80 / 115 / 150 / 185 / 220 (+ 100% bonus AD)\nSecondary Damage:\n48 / 69 / 90 / 111 / 132 (+ 60% bonus AD)",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "Special",
      "projectile": "True",
      "notes": "* Razor Shuriken has been special cased to apply a stack of  Electrocute for each Shuriken hit.\n A  spell shield may block multiple Razor Shurikens if they strike at the same time."
    }
  },
  "skill_w": {
    "Living Shadow": {
      "name": "Living Shadow",
      "champion": "Zed",
      "skill": "W",
      "target range": "650",
      "effect radius": "1950",
      "speed": "1750",
      "cost": "40 / 35 / 30 / 25 / 20",
      "costtype": "energy",
      "cooldown": "22 / 20 / 18 / 16 / 14",
      "icon": "Living Shadow.png",
      "blurb": "Zed's shadow dashes forward, remaining in place for 5 seconds, and mimicking his spell casts. Zed can reactivate to swap places with the shadow.",
      "description": "First Cast: Zed's  Shadow dashes in the target direction, remaining in place for 5 seconds and being able to mimic  Razor Shuriken and  Shadow Slash while in range of each other.",
      "description2": "Zed restores  energy whenever a  Shadow lands a mimicked ability on the same target he does. This may only happen once per cast ability.",
      "leveling2": "Energy Restored:\n30 / 35 / 40 / 45 / 50",
      "icon3": "Living Shadow 2.png",
      "description3": "Second Cast - Shadow Swap: While in range of each other, Zed and his  Shadow  blink to their respective locations, swapping places.",
      "targeting": "Direction / Auto",
      "affects": "Self",
      "damagetype": "None",
      "notes": "* The  Shadow grants  sight of its surroundings and is  untargetable.\n Zed always has an arrow next to him pointing in the direction of his  Shadows. It has three different colors, each one symbolizes important information about the specific Shadow. They are only visible to Zed.\n\n    Two arrows point toward their corresponding  Shadows.  \n\n    A green arrow (blue in colorblind mode) means the  Shadow can be swapped places with.  \n\n    A yellow arrow signifies the  Shadow is about to disappear.  \n\n    A red arrow (orange in colorblind mode) indicates the  Shadow is unable to be swapped places with."
    }
  },
  "skill_e": {
    "Shadow Slash": {
      "name": "Shadow Slash",
      "champion": "Zed",
      "skill": "E",
      "effect radius": "290",
      "cost": "50",
      "costtype": "energy",
      "cooldown": "5 / 4.5 / 4 / 3.5 / 3",
      "icon": "Shadow Slash.png",
      "blurb": "Zed and his shadow spin their blades, creating a burst of shadow energy. The shadow's spin slows.",
      "description": "Active: Zed and his  Shadows slash, dealing  physical damage to surrounding enemies.",
      "leveling": "Physical Damage:\n70 / 95 / 120 / 145 / 170 (+ 80% bonus AD)",
      "description2": "Enemies hit by a  Shadow's Shadow Slash are  slowed for 1.5 seconds. Enemies hit by multiple slashes take no additional damage but the slow's potency is increased by 50%.",
      "leveling2": "Slow:\n20 / 25 / 30 / 35 / 40%\nEnhanced Slow:\n30 / 37.5 / 45 / 52.5 / 60%",
      "description3": "Each enemy champion hit by Zed's slash reduces  Living Shadow's  cooldown by 2 seconds.",
      "targeting": "Auto",
      "affects": "Enemies",
      "damagetype": "Physical",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "* Shadow Slash has no cast time and does not interrupt Zed's previous orders."
    }
  },
  "skill_r": {
    "Death Mark": {
      "name": "Death Mark",
      "champion": "Zed",
      "skill": "R",
      "target range": "625",
      "cooldown": "120 / 90 / 60",
      "icon": "Death Mark.png",
      "blurb": "Zed becomes untargetable and dashes to an enemy champion, marking them. After 3 seconds the mark triggers, repeating a portion of all the damage Zed dealt to the target while they were marked.",
      "description": "First Cast: Zed becomes  untargetable for 0.6 seconds after which he  dashes through the target enemy  champion over 0.4 seconds, marking them, becoming  ghosted for 3 seconds, and spawning a  Shadow at the cast location which lasts for 6.5 seconds. After 0.5 seconds of his reappearance, he can activate  Death Mark Shadow.",
      "description2": "For the next 3 seconds, the mark stores a percentage of all pre-mitigation  physical damage and  magical damage Zed and his  Shadows deal to the target, detonating at the end of the duration to deal  physical damage.",
      "leveling2": "Physical Damage:\n100% AD (+ 25 / 40 / 55% of damage dealt)",
      "icon3": "Death Mark 2.png",
      "description3": "Second Cast - Death Mark Shadow: Regardless of distance between each other, Zed and the Death Mark  Shadow  blink to their respective locations, swapping places.",
      "description4": "If the target dies or is 1950 units away before the dash begins, Death Mark is canceled, goes on a 5 second  cooldown, and Zed reappears at the cast location.",
      "targeting": "Unit",
      "affects": "Self, Enemies",
      "damagetype": "Physical",
      "spelleffects": "Single target",
      "spellshield": "Special",
      "notes": "* The mark can be prevented by becoming  untargetable before it is applied (untargetability after application will not prevent the mark's detonation).\n Death Mark's  Shadow is functionally the same as a regular one, but it lasts longer and can be recast regardless of range.\n The range at which they mimic Zed's abilities do not change.\n\n Death Mark's stored damage derives from all abilities, items, and buffs.\n  Spell shields will only block the mark's application. They will not block the detonation from a mark that is already applied.\n If the mark is strong enough to kill the target, a spinning shuriken will appear above the victim to indicate their death. This does not however consider  shields or forms of damage modifiers.\n\n    The indicator shown in-game (base skin)."
    }
  }
}