{
  "id": 143,
  "apiname": "Zyra",
  "title": "Rise of the Thorns",
  "attack": 4,
  "defense": 3,
  "magic": 8,
  "difficulty": 2,
  "herotype": "Mage",
  "alttype": "Support",
  "resource": "Mana",
  "stats": {
    "hp_base": 504,
    "hp_lvl": 79,
    "mp_base": 418,
    "mp_lvl": 25,
    "arm_base": 29,
    "arm_lvl": 3,
    "mr_base": 30,
    "mr_lvl": 0.5,
    "hp5_base": 5.5,
    "hp5_lvl": 0.5,
    "mp5_base": 13,
    "mp5_lvl": 0.4,
    "dam_base": 53.376,
    "dam_lvl": 3.2,
    "as_base": 0.625,
    "as_lvl": 2.11,
    "range": 575,
    "ms": 340,
    "acquisition_radius": 575,
    "selection_radius": 120,
    "pathing_radius": 35,
    "as_ratio": 0.625,
    "attack_delay_offset": -0.154166668653488,
    "aram_dmg_dealt": 0.94,
    "aram_dmg_taken": 1.06
  },
  "rangetype": "Ranged",
  "date": "2012-07-24",
  "patch": "V1.0.0.143",
  "changes": "V10.1",
  "role": [
    "Catcher"
  ],
  "damage": 3,
  "toughness": 1,
  "control": 3,
  "mobility": 1,
  "utility": 1,
  "style": 100,
  "adaptivetype": "magic",
  "be": 4800,
  "rp": 880,
  "skill_i": {
    "Garden of Thorns": {
      "name": "Garden of Thorns",
      "champion": "Zyra",
      "skill": "I",
      "effect radius": "900",
      "static": "13 / 12 / 11 / 10 / 9 (based on level)",
      "icon": "Garden of Thorns.png",
      "blurb": "Seeds spawn around Zyra periodically, becoming faster with level and lasting 30 seconds. If an enemy Champion steps on a seed, it dies. Zyra can cast spells near seeds to grow plants. Extra plants striking the same target deal reduced damage.",
      "description": "Innate: Zyra periodically spawns one or two Seeds nearby that last for 30 seconds, briefly granting  sight over the surrounding area.",
      "description2": "After at least 1 second, enemy champions can destroy Seeds by stepping on them.",
      "description3": "Zyra can only have a total of 8 Seeds planted at a time, preserving placed Seeds over those spawned by Garden of Thorns.",
      "targeting": "Passive",
      "affects": "Self",
      "spelleffects": "pet",
      "notes": "* Zyra tries to plant Seeds in brush and not on top of walls.\n Zyra tries not to plant Seeds too close together and at different angles.\n Zyra does not plant any Seeds if she is concealed within a brush (unless there is an enemy ward in it, in which case it takes her a little longer to plant the Seed) or when there is no room for additional ones.\n PENDING FOR TEST: Zyra tries to plant Seeds close to an enemy near her.\n PENDING FOR TEST: Zyra tries to plant Seeds under enemy structures only if she is in basic attack range of them.\n PENDING FOR TEST: Zyra tries to plant Seeds on the other side of the wall she is facing and/or standing right next to.\n PENDING FOR TEST: Zyra tries to plant Seeds in the direction she is facing and/or moving.\n PENDING FOR TEST: Zyra tries to plant Seeds near jungle path entrances.\n PENDING FOR TEST: Zyra tries to plant Seeds behind herself when she is walking through the river and there are no jungle path entrances near her.\n PENDING FOR TEST: Zyra tries to plant SeedsSeeds between herself and the enemy champion she has vision of (or is heading towards her) in a 45° angle to the left or to the right depending on where on lane she is standing.\n PENDING FOR TEST: Zyra tries to plant Seeds against the inner walls of epic monster pits ( Dragon,  Rift Herald,  Baron Nashor)"
    }
  },
  "skill_q": {
    "Deadly Spines": {
      "name": "Deadly Spines",
      "champion": "Zyra",
      "skill": "Q",
      "target range": "800",
      "cost": "70",
      "costtype": "mana",
      "cooldown": "7 / 6.5 / 6 / 5.5 / 5",
      "icon": "Deadly Spines.png",
      "blurb": "Thick vines spread through the ground and explode into spines, dealing magic damage to enemies within the area. If cast near a seed, Deadly Spines grows a Thorn Spitter plant, which fires at enemies from afar.",
      "description": "Active: Zyra sprouts thorny spines at the target location that appear after a 0.625-seconds delay, dealing  magic damage to all enemies they hit.",
      "leveling": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                60,
                95,
                130,
                165,
                200
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                60,
                60,
                60,
                60,
                60
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        }
      ],
      "description2": "If Deadly Spines hits a Seed, it sprouts into a  Thorn Spitter, which remains on the battlefield for 8 seconds.",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "* No additional details."
    }
  },
  "skill_w": {
    "Rampant Growth": {
      "name": "Rampant Growth",
      "champion": "Zyra",
      "skill": "W",
      "target range": "850",
      "cost": "1",
      "costtype": "Seed",
      "recharge": "20 / 18 / 16 / 14 / 12",
      "icon": "Rampant Growth.png",
      "blurb": "Zyra plants a seed, lasting up to 60 seconds. Deadly Spines and Grasping Roots cast near seeds will turn them into plants who fight for Zyra. Additionally, Rampant Growth passively grants her plants improved maximum Health.",
      "description": "Passive: Zyra periodically stores a Seed, up to 2. Unit kills grant 20% charge toward a Seed, increased to 100% for large units killed and enemy champion  takedowns.",
      "description3": "Active: Zyra plants a Seed at the target location, which lasts for 60 seconds and briefly grants  sight of the spot Zyra planted it in.",
      "description4": "After 1.5 seconds, enemy champions can destroy Seeds by stepping on them, but doing so grants  true sight of them for 2 seconds.",
      "targeting": "Ground",
      "affects": "Self, Enemies",
      "spellshield": "False",
      "notes": "* Decoys count as champions for the takedown effect.\n A Seed's true sight can be removed with Quicksilver.\n Seeds can be targeted by allied abilities ( Teleport,  Leap Strike,  Shunpo,  Safeguard).\n Seeds cannot be attacked by enemy units or their structures and neither will they detonate their traps ( Yordle Snap Trap,  Captive Audience,  Bushwhack,  Noxious Trap)."
    }
  },
  "skill_e": {
    "Grasping Roots": {
      "name": "Grasping Roots",
      "champion": "Zyra",
      "skill": "E",
      "target range": "1100",
      "speed": "1150",
      "cost": "70 / 75 / 80 / 85 / 90",
      "costtype": "Mana",
      "cooldown": "12",
      "icon": "Grasping Roots.png",
      "blurb": "Zyra sends forth vines through the ground to ensnare her target, dealing damage and rooting enemies they come across. If cast near a seed, Grasping Roots grows a Vine Lasher, whose short range attacks reduce enemy Movement Speed.",
      "description": "Active: Zyra sends a surge of vines in the target direction, dealing magic damage to all enemies hit and  rooting them for a short duration.",
      "leveling": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                60,
                105,
                150,
                195,
                240
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                50,
                50,
                50,
                50,
                50
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        },
        {
          "attribute": "Root Duration",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                1,
                1.25,
                1.5,
                1.75,
                2
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            }
          ]
        }
      ],
      "description2": "If Grasping Roots hits a Seed, it sprouts into a  Vine Lasher, which remains on the battlefield for 8 seconds.",
      "targeting": "Direction",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "projectile": "True",
      "notes": "* No additional details."
    }
  },
  "skill_r": {
    "Stranglethorns": {
      "name": "Stranglethorns",
      "champion": "Zyra",
      "skill": "R",
      "target range": "700",
      "effect radius": "500",
      "cost": "100",
      "costtype": "Mana",
      "cooldown": "110 / 105 / 100 / 95 / 90",
      "icon": "Stranglethorns.png",
      "blurb": "Zyra summons a twisted thicket at her target location, dealing damage to enemies as it expands and knocking them airborne as it contracts.",
      "description": "Active: Zyra summons a monstrous thicket at the target location, dealing magic damage to all enemies in the area as it expands.",
      "leveling": [
        {
          "attribute": "Magic Damage",
          "modifiers": [
            {
              "modifier": "+",
              "values": [
                180,
                222.5,
                265,
                307.5,
                350
              ],
              "units": [
                "",
                "",
                "",
                "",
                ""
              ]
            },
            {
              "modifier": "+",
              "values": [
                70,
                70,
                70,
                70,
                70
              ],
              "units": [
                "% AP",
                "% AP",
                "% AP",
                "% AP",
                "% AP"
              ]
            }
          ]
        }
      ],
      "description2": "After 2 seconds, the vines snap upward,  knocking up all enemies caught in the thicket for 1 second.",
      "description3": "Plants hit by the thicket are enraged, restoring  50% of their current health, increasing their  maximum health by 50%, and resetting their duration for the full duration of the thicket, for a maximum bonus duration of 2 seconds. Additionally they attack in a flurry, launching two shots per attack, dealing [ 150% damage per flurry ][ 75% damage per shot ].",
      "targeting": "Ground",
      "affects": "Enemies",
      "damagetype": "Magic",
      "spelleffects": "Area of effect",
      "spellshield": "True",
      "notes": "*  Plants grown during the 2 seconds prior to the displacement will also be enraged.\n  Plants already grown before Stranglethorns is cast will have their duration refreshed if they are inside the area of effect."
    }
  }
}